LEAGUE_DATA = {
    '보스니아 헤르체고비나': {
        1: ('보스니아 프리미어리그', [# 12
            'FK 사라예보', 'FK 젤레즈니차르', 'HŠK 즈린스키 모스타르', 'FK 보라츠 바냐루카', 'NK 시로키 브리예그', 'FK 벨레주 모스타르', 'HŠK 포스셰', 'FK 슬로가 도보이', 'FK 이그만 코니츠', 'GOŠK 가벨라', 'FK 라드니크 비옐리나', 'FK 슬로보다 투즐라']),
        2: ('보스니아 퍼스트 리그', [# 16
            'NK 첼리크 제니차', 'FK 루다르 프리예도르', 'FK 레오타르', 'BFK 시민 한', 'NK 토미슬라브', 'FK 고라주데', 'FK 부둠노스트 바노비치', 'NK 제디니스트보 비하치', 'TOŠK 테샤니', 'FK 슬라비야 사레예보', 'FK 코자라 그라디슈카', 'FK 드리나 즈보르닉', 'FK 수체스카 포차', 'FK 류비치 프르냐보르', 'FK 젤레즈니차르 바냐루카', 'BFK 심바우']),
        3: ('보스니아 세컨드 리그', [# 12
            'NK 크리바야', 'FK 파마스', 'FK 보라츠 샤마츠', 'NK 브라트스트보', 'FK 포드린예', 'FK 일리자', 'NK 비테즈', 'FK 루다르 카칸', 'NK 트라브니크', 'NK 이스크라 부고이노', 'FK 루다르 한 빌라', 'NK 그라디나 스레브레니크'])
    },
    '대한민국': {
        1: ('K리그1', [# 12
            '울산 HD FC', '김천 상무', '강원 FC', '포항 스틸러스', '수원 FC', '광주 FC', 'FC 서울', '전북 현대 모터스', '인천 유나이티드', '제주 유나이티드', '대전 하나 시티즌', '대구 FC']),
        2: ('K리그2', [# 14
            'FC 안양', '전남 드래곤즈', '부산 아이파크', '서울 이랜드 FC', '수원 삼성 블루윙즈', '충북청주 FC', '성남 FC', '부천 FC 1995', '충남 아산 FC', '경남 FC', '김포 FC', '안산 그리너스', '천안 시티 FC', '메오티 FC']),
        3: ('K3리그', [# 16
            '화성 FC', 'FC 목포', '김해시청 축구단', '시흥시민축구단', '부산교통공사', '울산시민축구단', '경주 한수원', '대전 코레일', '파주시민축구단', '창원시청 축구단', '양주시민축구단', '포천시민축구단', '강릉시민축구단', '춘천시민축구단', '여주 FC', '대구 예술대']),
        4: ('K4리그', [# 16
            '전주시민축구단', '평택 시티즌', '평창 유나이티드', '진주시민축구단', '어곡 FC', '거제시민축구단', '충주시민축구단', '세종 바몬 FC', '당진시민축구단', '서울 노원 유나이티드', '양평 FC', '고양 해피니스', '남양주 FC', 'FC 세종', '전북 현대 B', '대구 FC B'])
    },
    '브라질': {
        1: ('세리에 A', [# 20
            '파우메이라스', '그레미우', '아틀레치쿠 미네이루', '플라멩구', '보타포구', '레드불 브라간티누', '플루미넨시', '상파울루 FC', '인테르나시오나우', '아틀레치쿠 파라나엔시', '포르탈레자', '쿠이아바', '코린치앙스', '크루제이루', '바스쿠 다 가마', '바히아', '비토리아', '주벤투드', '크리시우마', '아틀레치쿠 고이아니엔시']),
        2: ('세리에 B', [# 20
            '노보리존치누', '미라소우', '스포르트 헤시피', '빌라 노바', '산투스 FC', '고이아스', '코리티바', '아메리카 미네이루', '오페라리우', '브루스케', '아마조나스', '파이산두', 'CRB', '샤페코엔시', '폰치 프레타', '구아라니', '이투아누', '보타포구-SP', '세아라', '헤그라타스']),
        3: ('세리에 C', [# 20
            '볼타 헤돈다', '상베르나르두', '보타포구-PB', '조제엔시', '아틀레틱 클럽', '페로비아리아', '카시아스', '아나폴리스', '론드리나', '피게이렌시', '나우치쿠', 'CSA', '레메디움', '이피랑가', '톰벤시', '삼파이오 코레아', 'ABC', '콘피안사', '플로레스타', '페호비아리우']),
        4: ('세리에 D', [# 20
            '소우사', '레트루', '마링가', 'ASA', '산타크루스', '이과수', '아구아 산타', '포르투게자-RJ', '카스카베르', '헤실리우 루스', '캄보리우', '세르지피', '투나 루소', '나시오나우-AM', '트레지', '아그레미아상마구아리', '토칸틴스', '프린세사 두 솔리몽이스', '후마이타', '상하이문두']),
        5: ('에스토두알 2부', [# 16
            '타우바테', 'XV 드 피라시카바', '상벤투', '펠로타스', '주벤투스-SP', '리오 브란쿠', '코메르시아우', '나시오나우-SP', '오에스치', '리넨시', '프리마베라', '보투포랑겐시', '상카에타누', '페호비아리아-SP', '몬치 아줄', '카피바리아누'])
    },
    '아르헨티나': {
        1: ('프리메라 디비시온', [# 28
            '리버 플레이트', '보카 주니어스', '라싱 클럽', '데펜사 이 후스티시아', '산 로렌소', '라누스', '에스투디안테스', '고도이 크루스', '인데펜디엔테', '산타페 우니온', '타예레스 코르도바', '벨레스 사르스필드', '뉴웰스 올드 보이스', '로사리오 센트랄', '아르헨티노스 주니어스', '아틀레티코 투쿠만', '우라칸', '인스티투토', '플라텐세', '센트랄 코르도바', '바라카스 센트랄', '반필드', '힘나시아 라플라타', '티그레', '인데펜디엔테 리바다비아', '데포르티보 리에스트라', '벨그라노', '사르미엔토']),
        2: ('프리메라 나시오날', [# 24
            '알미란테 브라운', '아그로페쿠아리오', '차카리타 주니어스', '데포르티보 마이푸', '킬메스', '아틀레티코 라파엘라', '산마르틴 투쿠만', '산마르틴 후안', '페로 카릴 오에스치', '누에바 시카고', '올 보이스', '데포르티보 모론', '알마그로', '데포르티보 마드린', '히스토리아', '알도시비', '콜론 사타페', '아르세날 사란디', '데포르티보 카마노레스', '에스투디안테스 카세로스', '아트란타', '테페르레이', '브라운 드 아드로게', '데포르티보 산텔모']),
        3: ('프리메라 B 메트로', [# 16
            '타예레스 RE', '산 미겔', '아르헨티노 드 킬메스', '로스 안데스', '코무니카시오네스', '독 수도', '아카수소', '빌라 산 카를로스', '콜레히알레스', '데포르티보 아르메니오', '페닉스', '데포르티보 메를로', '스포르티보 도크 수드', '우아이 우르키사', '산마르틴 부르사코', '엑스쿠르시오니스타스']),
        4: ('프리메라 C 메트로', [# 16
            '데포르티보 라페레르', '헤네랄 라마드라이드', '루한', '미들랜드', '아틀라스', '클레이폴', '데포르티보 에스파뇰', '엘 포르베니르', '이투사잉고', '레안드로 N. 알렘', '빅토리아노 아레나스', '베라사테기', '후스토 호세 드 우르키사', '센트랄 코르도바 로사리오', '푸에르토 누에보', '루가노'])
    },
    '프랑스': {
        1: ('리그 앙', [# 18
            'PSG', '모나코', '브레스투아', '릴 OSC', '니스', '올랭피크 리옹', 'RC 랑스', '올랭피크 마르세유', '스타드 가스토 에르베', '툴루즈 FC', '스타드 랭스', '스타드 렌 FC', '몽펠리에 HSC', '스트라스부르', '르아브르 AC', '낭트', '앙제 SCO', '오세르']),
        2: ('리그 두', [# 18
            '생테티엔', '로데스 AF', '파리 FC', '캉', '라발', '갱강', 'FC 메스', '로orient', '클레르몽 푸트', '포 FC', '아미앵 SC', '그르노블', '바스티아', '아작시오', '당케르크', '안시 FC', '레드 스타 FC', '마르티그']),
        3: ('샹피오나 나시오날', [# 18
            '니오르', '디종 FCO', '르망 FC', '낭시', '소쇼', '루앙', '트루아 AC', '발랑시엔 FC', '콩카르노', '퀘빌리 루앙', '오를레앙', '샤토루', '님 올랭피크', '베르사유 78', '빌프랑슈', '마리냥 지냑', '에피날', '방드에 르푸제']),
        4: ('나시오날 2', [# 16
            '칸', '라싱 클럽 드 프랑스', '리부른', '플뢰리 91', '불로뉴', '와스케할', '토농 에비앙', '레 제르비에', '보르도', '크레테유', '샤르트르', '앙굴렘', '툴롱', '베지에', '부르캉브레스', '앙프리즈']),
        5: ('나시오날 3', [# 16
            '투르쿠앵', '아그드', '블라냐크', '우아셀', '생로', '쇼비니', '콜마르', '이스르', '아작시오 GFCO', '렝스 II', '낭트 II', '생테티엔 II', '릴 II', '이르송', '디에프', '샬롱'])
    },
    '독일': {
        1: ('분데스리가', [# 18
            '레버쿠젠', '바이에른 뮌헨', '슈투트가르트', '라이프치히', '도르트문트', '프랑크푸르트', '호펜하임', '하이덴하임', '베르더 브레멘', '프라이부르크', '아우크스부르크', '볼프스부르크', '보루시아 묀헨글라트바흐', '우니온 베를린', '마인츠 05', '보훔', '장크트 파울리', '홀슈타인 킬']),
        2: ('2. 분데스리가', [# 18
            '쾰른', '다름슈타트', '뒤셀도르프', '함부르크', '칼스루에', '하노버', '파더보른', '헤르타 베를린', '샬케 04', '뉘른베르크', '카이저슬라우테른', '마그데부르크', '그로이터 퓌르트', '브라운슈바이크', '엘페르스베르크', '우름 1846', '프로이센 뮌스터', '얀 레겐스부르크']),
        3: ('3. 리가', [# 20
            '디나모 드레스덴', '빌레펠트', '자르브뤼켄', '아우에', '로트바이스 에센', '잔드하우젠', '운터하힝', '오스나브뤼크', '한자 로스토크', '베헨 비스바덴', '인골슈타트 04', '발트호프 만하임', '빅토리아 쾰른', '페를', '도르트문트 II', '하노버 II', '에네르기 콧부스', '알레마니아 아헨', '슈투트가르트 II', '슈투트가르트 키커스']),
        4: ('레기오날리가', [# 20
            '부퍼탈러 SV', '포르투나 쾰른', 'SV 메펜', '키커스 오펜바흐', 'FC 08 홈부르크', '켐니처 FC', 'SV 트리어', 'FC 카를 차이스 예나', '바벨스베르크 03', '로트바이스 에르푸르트', '봔노버 96 II', '테우토니아 오텐센', '포르투나 뒤셀도르프 II', '오버하우젠', '뒤스부르크', '묀헨글라트바흐 II', 'FSV 프랑크푸르트', '바이에른 뮌헨 II', '뷔르츠부르거 키커스', '뉘른베르크 II']),
        5: ('오베르리가', [# 16
            'SSV 로이틀링겐', '투S 코블렌츠', '테니스 보루시아', 'VfR 만하임', 'FC 08 필링겐', '바이에른 호프', 'SV 아틀라스', 'VfB 아이히슈테트', 'FC 에쉬보른', '블라우바이스 베를린', '피르마센스', '베르기슈 글라트바흐', '루포 마르티니 볼프스부르크', '아르미니아 한노버', '쇼트 마인츠', '안스바흐'])
    },
    '스페인': {
        1: ('라리가', [# 20
            '레알 마드리드', '바르셀로나', '지로나 FC', '아틀레티코 마드리드', '아틀레틱 빌바오', '레알 소시에다드', '레알 베티스', '발렌시아 CF', '비야레알 CF', '헤타페 CF', '오사수나', '데포르티보 알라베스', '세비야 FC', 'RCD 마요르카', '라요 바예카노', '셀타 비고', '레가네스', '실베스트레 바야돌리드', 'RCD 에스파뇰', 'UD 라스팔마스']),
        2: ('세군다 디비시온', [# 22
            '에이바르', '스포르팅 히혼', '오비에도', '라싱 산탄데르', '엘체 CF', '레반테 UD', '라싱 페롤', '부르고스 CF', '테네리페', '카르타헤나', '사라고사', '엘덴세', '우에스카', '미란데스', '알바세테', '알메리아', '그라나다 CF', '카디스 CF', '데포르티보', '카스텔리온', '말라가 CF', '코르도바 CF']),
        3: ('프리메라 페데라시온', [# 20
            'UD 이비사', '레크레아티보', '세우타', '폰페라디na', '알코르콘', '안도라 FC', '비야레알 B', '아모레비에타', '무르시아', '안테케라', '인테르시티', '멜리야', '산 페르난도', '리나레스', '아틀레티코 마드리드 B', '바르셀로나 아틀레틱', '레알 마드리드 카스티야', '레알 우니온', '타라조나', '세스타오 리베르']),
        4: ('세군다 페데라시온', [# 20
            '폰테베드라', '누만시아', '아빌레스 인더스트리얼', '콤포스텔라', '례이다 에스포르티우', 'CE 에우로파', 'UD 로그로녜스', '바달로나', '헤라클레스', '산로케', '우테보', '게치카', '투델라노', '이strong자', '아길라스', '오리우엘라', '에스테포나', '마르베야', '세고비아나', '산세바스티안 레예스']),
        5: ('테르세라 페데라시온', [# 16
            '레알 하엔', 'CD 톨레도', 'CP 카세레뇨', 'CD 라레도', '레알 아빌라', 'CD 아수아가', 'UD 포블렌세', 'CD 킨타나르', '간디아', '엘체 이리시타노', '바라칼도', '포르투갈레테', '레알 마드리드 C', '토레도노', '팔렌시아', '콘켄세'])
    },
    '잉글랜드': {
        1: ('프리미어리그', [# 20
            '맨체스터 시티', '아스널', '리버풀', '애스턴 빌라', '토트넘 홋스퍼', '첼시', '맨체스터 유나이티드', '뉴캐슬 유나이티드', '웨스트햄 유나이티드', '크리스탈 팰리스', '브라이턴 앤 호브 앨비언', '본머스', '풀럼', '울버햄프턴 원더러스', '에버턴', '브렌트퍼드', '노팅엄 포레스트', '이프스위치 타운', '레스터 시티', '사우샘프턴']),
        2: ('EFL 챔피언십', [# 24
            '리즈 유나이티드', '선덜랜드', '코벤트리 시티', '미들즈브러', '노리치 시티', '왓포드', '스토크 시티', '번리', '루턴 타운', '셰필드 유나이티드', '웨스트 브로미치 앨비언', '헐 시티', '셰필드 유나이티드', '브리스톨 시티', '카디프 시티', '밀월', '스وان지 시티', '플리머스 아가일', '프레스턴 노스 엔드', '블랙번 로버스', '셰필드 웨드priority', '포츠머스', '더비 카운티', '옥스퍼드 유나이티드']),
        3: ('EFL 리그 원', [# 24
            '버밍엄 시티', '볼턴 원더러스', '피터버러 유나이티드', '반슬리', '찰턴 애슬레틱', '링컨 시티', '위건 애슬레틱', '블랙풀', '레딩', '위컴 원더러스', '브리스톨 로버스', '노샘프턴 타운', '레이턴 오리엔트', '스티브니지', '슈루즈버리 타운', '엑서터 시티', '캠브리지 유나이티드', '로더럼 유나이티드', '허더즈필드 타운', '스톡포트 카운티', '렉섬 AFC', '맨스필드 타운', '크롤리 타운', '위컴 원더러스']),
        4: ('EFL 리그 투', [# 24
            '크루 알렉산드라', 'MK 돈스', '배로 AFC', '브래드포드 시티', '동카스터 로버스', '질링엄', '윔블던', '월솔', '트랜미어 로버스', '아크링턴 스탠리', '노茨 카운티', '스윈던 타운', '뉴포트 카운티', '콜체스터 유나이티드', '그림즈비 타운', '해로게이트 타운', '살포드 시티', '모컴', '첼트넘 타운', '플리트우드 타운', '포트 베일', '체스터필드', '브롬리', '콜체스터 유나이티드']),
        5: ('내셔널리그', [# 24
            '올덤 애슬레틱', '로치데일 AFC', '사우스엔드 유나이티드', '요크 시티', 'FC 핼리팩스 타운', '올더샷 타운', '워킹 FC', '바넷 FC', '서턴 유나이티드', '포레스트 그린 로버스', '필드', '엡스플리트 유나이티드', '게이츠헤드', '솔리헐 무어스', '알트링컴', '이스트일리', '대거넘 앤 레드브리지', '메이든헤드 유나이티드', '웨일스톤', '보레햄 우드', '키더민스터 해리어스', '옥스퍼드 시티', '해밀턴', '탬워스'])
    },
    '포르투갈': {
        1: ('프리메이라 리가', [# 18
            '스포르팅 CP', '벤피카', 'FC 포르투', '브라가', '비토리아 기마랑이스', '모레이렌스', '아로우카', '파말리캉', '카사 피아', '파렌세', '리오 아베', '질 비센테', '보아비스타', '에스토릴 프라이아', '나시오날', '산타 클라라', 'AVS 푸테볼 SAD', '파렌세']),
        2: ('리가 포르투갈 2', [# 18
            '마리티무', '파소스 드 페레이라', '톤델라', '토레엔세', '마프라', '비제라', '샤베스', '레이شون이스', '벤피카 B', '포르투 B', '스포르팅 CP B', '브라가 B', '아카데미코 드 비제우', '페나피엘', '페이렌세', 'UD 올리베이렌스', '알베르카', '펠게이라스']),
        3: ('리가 3', [# 16
            '루시타니아 로우로사', '아틀레티코 CP', '바르짐', '코빌랴', '아카데미카', '알베르카', '펠게이라스', '산조아넨세', '루시타니아', '칼다스', '스포르팅 코빌랴', '파페', '트로펜세', '아나디아', '루시타노 에보라', '비토리아 드 세투발']),
        4: ('캄페오나투 드 포르투갈', [# 16
            '살게이루스', '아마란테', '로울레타노', '파브릴 바레이루', '신트렌세', '베이라-마르', '페비뎀', '레사', '올랴넨세', '오리엔탈', '임모르탈', '사카베넨세', '산타우나', '파레데스', '몬탈레그레', '비안넨세'])
    },
    '이탈리아': {
        1: ('세리에 A', [# 20
            '인테르나치오날레', 'AC 밀란', '유벤투스', '아탈란타', '볼로냐 FC', 'AS 로마', '라치오', '피오렌티나', '토리노 FC', '나폴리', '제노아 CFC', '몬차', '베로나', '레체', '우디네세', '엠폴리', '파르마 FC', '코모 FC', '베네치아 FC', '카利亚리']),
        2: ('세리에 B', [# 20
            '크레모네세', '카탄차로', '팔레르모 FC', '삼프도리아', '브레시아', '프로시노네', '사수올로', '살레르니타나', '수디롤', '피사', '치타델라', '모데나', '바리', '레조나', '코센차', '스페치아', '만토바', '체세나', '유베 스타비아', '카라레세']),
        3: ('세리에 C', [# 20
            '비첸차', '아벨리노', '베네벤토', '토레스', '파도바', '테르나나', '아스콜리', '페랄피살로', '타란토', '카세르타나', '페루자', '아레초', '폰테데라', '구비오', '루케세', '피네토', '스팔(SPAL)', '안코나', '유벤투스 넥스트 젠', '아탈란타 U23']),
        4: ('세리에 D', [# 16
            '피아첸차', '리보르노', '삼베네데테세', '트라파니', '그로세토', '바를레타', '바레세', '프라토', '카르피', '라벤나', '프로 세스토', '올비아', '피스토이에세', '산레메세', '레조 칼라브리아', '치바노바']),
        5: ('에첼렌차', [# 16
            '베르바노', '파비아', '알벤가', '엔나', '폼페이', '줄리아노바', '제니스 프라토', '카스트 브레시아', '포를리', '카스테라노', '로디자니', '비제바노', '마르사라', '카스텔란차', '산조반네세', '테라치나'])
    },
    '네덜란드': {
        1: ('에레디비시', [# 18
            'PSV 에인트호번', '페예노르트', '트벤터', 'AZ 알크마르', '아약스', 'NEC 네이메헌', '위트레흐트', '스파르타 로테르담', '고 어헤드 이글스', '포르투나 시타르드', '헤이렌베인', '즈볼러', '알메러 시티', '헤라클레스 알멜로', '발베이크', '빌렘 II', '흐로닝언', 'NAC 브레다']),
        2: ('에이르스터 디비시', [# 20
            '로다 JC', '도르드레흐트', 'ADO 덴 하흐', '드 흐라프스하프', '엠멘', '엑셀시오르', '볼렌담', '피테서', '캄뷔르', '펜로', '에인트호번 FC', '텔스타', '마스트리흐트(MVV)', '덴 보스', '헬몬드 스포르트', '토프 오스', '용 아약스', '용 PSV', '용 알크마르', '용 위트레흐트']),
        3: ('트위드 디비시', [# 18
            '스파켄부르크', '드 트레퍼스', '퀵 보이스', '카트베이크', 'AFC 암스테르담', 'HHC 하르덴베르크', '레인스뷔르흐서 보이스', 'GVVV', '노르드베이크', '코사켄 보이스', '엑셀시오르 마스라위스', '코니클레이커 HFC', '용 스파르타 로테르담', '용 알메러 시티', '스헤베닝언', '라인데이커', 'ACV 아선', '문스페르트']),
        4: ('데르더 디비시', [# 18
            '하르케마세 보이스', '호크', '스텔레도서', 'TOGB', "블라우 겔 '38", 'UNA', '캄퐁', '헤네마이던', '리서', '도버', '메이르서', '클로팅어', 'VVSB', 'OJC 로스말렌', '스포르트루스트 46', 'TEC', '바르덴부르크', '데뎀스바르트'])
    },
    '크로아티아': {
        1: ('HNL', [# 10
            '디나모 자그레브', '리예카', '하이두크 스플리트', '오시예크', '로코모티바 자그레브', '바라주딘', '고리차', '슬라벤 벨루포', '이스트라 1961', '시베니크']),
        2: ('1. NL', [# 12
            '즈린스키 유레바츠', '부코바르 1991', '세스베테', '두브라바', '오리옌트', '치발리아', '루데스', 'BSK 비옐로 브르도', '솔린', '야룬 자그레브', '크로아티아 즈미야브치', '오파티야']),
        3: ('2. NL', [# 16
            '라드니크 크리제브치', '마르소니아', '카를로바츠 1919', '쿠스토시야', '벨리 마나스티르', '야드란 포레치', '흐르바체', '벨리카 고리차', '믈라도스트 주드랄로비', '야드란 플로체', '두르고 셀로', '비옐로 바르도 B', '트르니에 자그레브', '포니크베', '흐르바츠키 드라고보랴츠', '자다르']),
        4: ('트레차 NL', [# 16
            '카를로바츠 1919 B', '세게스타 시사크', '마르소니아 B', 'RNK 스플리트', '유낙 신', '바르텍스 바라주딘', '루다르 라빈', '네레트바', '고스크 가벨라', '프리모라츠', '포모라츠', '크르크', '네레트바나츠', '자고라 우네시치', '보디체', '우스코크 클리스'])
    },
    '덴마크': {
        1: ('수페르리가', [# 12
            '미트윌란', '브뢴뷔 IF', 'FC 코펜하겐', '노르셸란', '오르후스 GF', '실케보르', '비보르', '란데르스 FC', '링비 BK', '바일레 BK', '쇠네르위에스케', '올보르 BK']),
        2: ('1. 디비전', [# 12
            '프레데리시아', '콜딩 IF', '벤수셀 FF', '호브로 IK', '힐레뢰드', '네스트베드', '오덴세 BK', '흐비도우레', 'B93', 'FC 로스킬데', '에스비에르 fB', 'HB 코이에']),
        3: ('2. 디비전', [# 12
            '오르후스 프레마드', '뉘쾨빙 FC', 'AB 글라드삭스', '헬레루프', '티스테드', '스키베', '볼클루벤 프렘', '이쇠이', '미델파르트', '브라반트', '프레드릭스하운', '뇌레순뷔']),
        4: ('3. 디비전', [# 12
            '홀스테브로', '반뢰세', '뤼셍', 'VSK 오르후스', '스벤보르', '네스뷔', '오덴세 카메레테네', '아바르타', '홀베크 B&I', '랑겔스코우', '영 보이스 FD', '타룹-파루프'])
    },
    '벨기에': {
        1: ('벨기에 프로 리그', [# 16
            '클럽 브뤼허', '루아얄 위니옹 SG', '안데를레흐트', '헨크', '앤트워프', '세르클러 브뤼허', '헨트', '메헬렌', '신트트라위던', '루베인', '스토르드 브뤼셀', '샤를루아', '베스테를로', '코르트레이크', '에이펜', '몰렌베크']),
        2: ('챌린저 프로 리그', [# 16
            '베이르스홋', '덴더르', '로멜 SK', '줄테 바레험', '파트루 아이스던', 'RFC 리에주', '베베런', '데인제', '프랑 보라앵', '리르서', '오스텐더', '세랭', 'RSCA 퓨처스', '종 헨크', 'SL16 FC', '종 KAA 헨트']),
        3: ('내셔널 디비전 1', [# 16
            'RAAL 라 루비에르', '로케런-템세', '크노케', '데셀 스포츠', '올림픽 샤를루아', '호그스트라텐', '헤이스트', '티넨', '우덴하르더', '나무르', '비르通', '카펠런', '비스', '메르크셈', '체프 유나이티드', '하셀트']),
        4: ('벨기에 디비전 2', [# 16
            '엔드라흐트 알스트', 'RFC 투르네', 'KRC 헨트', '베르험 스포츠', '통헤런', '디험 스포츠', '루멘', '오베이하서', '보르넴', '볼크스', '겐트 B', '브뤼셀 유나이티드', '앤트워프 레저브', '투비즈', '베르비에', '하를레베케'])
    },
    '일본': {
        1: ('J1리그', [# 20
            '비셀 고베', '요코하마 F. 마리노스', '가와사키 프론탈레', '산프레체 히로시마', '가시마 앤틀러스', '나고야 그램퍼스', '아비스파 후쿠오카', '우라와 레즈', '세레소 오사카', '알비렉스 니가타', 'FC 도쿄', '홋카이도 콘사도레 삿포로', '교토 상가 FC', '도스 마리노스', '쇼난 벨마레', '도쿄 베르디', '마치다 젤비아', '주빌로 이와타', '감바 오사카', '가시와 레이솔']),
        2: ('J2리그', [# 20
            '시미즈 에스펄스', '요코하마 FC', '제프 유나이티드 치바', '반포레 고후', '몬테디오 야마가타', 'V-바렌 나가사키', '파지아노 오카야마', '더스파구사츠 군마', '오이타 트리니타', '로아소 구마모토', '도쿠시마 보르티스', '베갈타 센다이', '미토 홀리혹', '이와키 FC', '후지에다 MYFC', '아키타 유나이티드', '레노파 야구치', '도치기 SC', '에히메 FC', '가고시마 유나이티드']),
        3: ('J3리그', [# 20
            '카탈레 도야마', 'FC 이마바리', '아술 클라로 누마즈', '가이나레 돗토리', '반라우레 하치노헤', 'FC 류큐', '오미야 아르디자', 'ツエーゲン 가나자와', '마츠모토 야마가', '나란하디토 나라', 'FC 오사카', '테게바자로 미야자키', '카마타마레 사누키', '지라반츠 기타큐슈', '후쿠시마 유나이티드', 'YSCC 요코하마', 'AC 나가노 파르세이루', 'SC 사가미하라', '이와테 그루야 모리오카', 'FC 기후']),
        4: ('JFL', [# 16
            '혼다 FC', '도쿄 무사시노 유나이티드', '라인미어 아오모리', '베르스파 오이타', '마루야스 오카자키', '고치 유나이티드', '브리오베카 우라야스', '티아모 히라카타', '미네베아 미쓰미 FC', '비아廷 미에', '클리어손 신주쿠', '레이락 시가', '아틀레티코 스즈카 FC', '브와리보 도치기', '오키나와 SV', '포르투나 하치노헤'])
    },
    '이란': {
        1: ('페르시안 걸프 프로리그', [# 18
            '페르세폴리스', '에스테글랄', '세파한', '트락토르', '풀라드', '골 고하르', '조브 아한', '샴스 아자르', '말라반', '메스 라프산잔', '하와다르', '알루미늄 아라크', '나프트 마스제드 솔레이만', '파이칸', '사나트 나프트', '에스테글랄 후제스탄', '케이바르 호라마바드', '차도르말루']),
        2: ('아자데간 리그', [# 16
            '파즈르 세파시', '사이파 FC', '메스 케르만', '파르스 조노우비 잠', '샤흐르다리 아스타라', '메스 숭군', '나프트 가치사란', '아리안 함단', '다마시 길란', '샤흐르 라즈', '나우티카 마잔다란', '메스 셰르 바브카', '라히안 케르만샤', '이스티글랄 몰라사니', '샤흐르다리 반다르 아바스', '나프트 아바단']),
        3: ('이란 2부 리그', [# 12
            '니루 모레', '샤흐르다리 마흐샤르', '추카 탈레시', '쇼하다 바볼사르', '스파드 테헤란', '샤히드 간디 야즈드', '샤흐르다리 밤', '파스 하메단', '아부모슬렘', '샤흐르다리 노샤르', '할리야 파르스', '카라 세페드루드']),
        4: ('이란 3부 리그', [# 12
            '에스테글랄 조누브', '페르세폴리스 카엠샤흐르', '세파한 B', 'PAS 하메단 B', '머신 사지 B', '바르그 시라즈', '라 아한', '샤힌 부셰르', '에스테글랄 아واز', '페르세폴리스 마샤드', '가하르 자그로스', '알보르즈 B'])
    },
    '사우디아라비아': {
        1: ('사우디 프로리그', [# 18
            '알 힐랄', '알 나스르', '알 아흘리', '알 이티하드', '알 타아운', '알 파테', '알 이티파크', '알 샤밥', '알 카디시야', '알 오루바', '알 콜로드', '알 파이하', '알 칼리즈', '알 웨흐다', '알 라에드', '알 담막', '알 오크두드', '알 리야드']),
        2: ('사우디 퍼스트 디비전', [# 18
            '알 파이살리', '알 아라비', '알 하즘', '알 바틴', '알 제블레인', '알 아달라', '알 파이하', '알 부케이리야', '알 나즈마', '알 사파', '알 아인', '알 주베일', '알 오후드', '알 자나드리야', '알 타예', '알 압하', '알 타라지', '알 제드다']),
        3: ('사우디 세컨드 디비전', [# 16
            '알 디라야', '알 카우카브', '알 쇼우라', '알 타까둠', '알 와쉬흠', '알 자이투스', '알 수쿠르', '알 무자잘', '알 지클', '알 무다르', '알 비샤', '알 누조움', '알 인티사르', '알 제르시', '알 투콰바', '알 라이얀 사우디']),
        4: ('사우디 써드 디비전', [# 16
            '알 아피프', '알 칼디야', '알 와디', '알 사드 사우디', '알 카우타르', '알 카르지', '알 하예트', '알 마즈드', '알 오마르', '알 알라', '알 우스바', '알 살미야', '알 바드르', '알 아르드', '알 타크가', '알 바틴 B'])
    },
    '카타르': {
        1: ('카타르 스타스 리그', [# 12
            '알 사드', '알 두하일', '알 가라파', '알 라얀', '알 아라비', '알 와크라', '카타르 SC', '알 아흘리', '알 무아이디르', '알 마르키야', '알 샤한야', '우메 살랄']),
        2: ('카타르 2부 리그', [# 12
            '알 가리아', '알 메사이메르', '알 카리티야트', '루사일', '알 비다', '알 와에브', '알 사이External', '알 코르', '자말렉 카타르', '알 제이시 레저브', '와크라 B', '아라비 B']),
        3: ('카타르 아마추어 리그', [# 12
            '알 사드 B', '알 두하일 B', '알 가라파 B', '도하 시티', '스피어스', '알 라얀 B', '펄 FC', '유니버시티 SC', '알 쿠도스', '카타르 아카데미', '라단 FC', '도하 유나이티드'])
    },
    '우즈베키스탄': {
        1: ('우즈베키스탄 수페르리가', [# 14
            '파흐타코르', '나브바호르', '나사프', 'AGMK', '부뇨드코르', '올림픽 타슈켄트', '네프치 페르가나', '소그디아나', '안디잔', '메탈루르크 베카바드', '키질쿰', '수르한 테르메즈', '로코모티프 타슈켄트', '디나모 사마르칸트']),
        2: ('우즈베키스탄 프로리그', [# 12
            '마샬 무바레크', '코칸드 1912', '투론', '부하라', '호레즘', '슈르탄', '아랄 누쿠스', '올림픽 FC B', '유니레드 FC', '안디잔-SGS', '지자흐 FC', '나브바호르-2']),
        3: ('우즈베키스탄 비스트야 리그', [# 12
            '파흐타코르 B', '나사프 B', '조민', '안디잔 II', '치르치크', '기주반', '양기에르', '샤흐리한', '나브바호르 B', '부뇨드코르 II', '네프치 B', 'AGMK II'])
    },
    '호주': {
        1: ('A리그 멘', [# 14
            '센트럴코스트', '웰링턴 피닉스', '멜버른 빅토리', '시드니 FC', '맥아더 FC', '멜버른 시티', '웨스턴 시드니', '브리즈번 로어', '애들레이드 유나이티드', '퍼스 글로리', '뉴캐슬 제츠', '웨스턴 유나이티드', '오클랜드 FC', '캔버라 유나이티드']),
        2: ('NPL 뉴사우스웨일스 1', [# 16
            '시드니 올림픽', '아피아 라이하르트', '시드니 유나이티드', '마르코니 스탤리언스', '울릉공 울브스', '블랙타운 시티', '록데일 일린든', '맨리 유나이티드', '센트럴코스트 마리너스 2군', '시드니 FC 2군', '웨스턴 시드니 원더러스 2군', '세인트 조지 시티', '엔필드 로버스', '수덜랜드 샤크스', '힐스 유나이티드', '세인트 조지 FC']),
        3: ('NPL 뉴사우스웨일스 2', [# 16
            '스피릿 FC', '하코아 시드니', '뱅크스타운 시티', '던바 로버스', '허스트ビル FC', '파라마타 FC', '프레이저 파크', '노스 브릿지', '노던 타이거스', '마운티스 원더러스', '리버풀 크리스탈', '맥아더 램스', '캔터베리 뱅크스타운', '스포팅 가이디아', '블랙타운 스파르탄스', '인터 라이온스']),
        4: ('NPL 뉴사우스웨일스 3', [# 12
            '캠든 타이거스', '혹스베리 시티', '글레이즈빌 리드콤', '프로스펙트 유나이티드', '네피안 FC', 'UNSW FC', '사우스 코스트', '돌리스 힐', '시드니 유니버시티', '스태스필드 FC', '배러구 더블', '뉴캐슬 올림픽 B'])
    },
    '중국': {
        1: ('중국 슈퍼리그', [# 16
            '상하이 포트', '산둥 타이산', '상하이 선화', '베이징 궈안', '청두 룽청', '제주앙 프로', '우한 쓰리타운스', '티안진 진먼 타이거', '창춘 야타이', '헤난 FC', '메이주 하카', '칭다오 하이뉴', '창저우 마이티 라이온스', '난퉁 지운', '선전 신펑청', '칭다오 웨스트코스트']),
        2: ('중국 갑급리그', [# 16
            '광저우 FC', '스자좡 궁푸', '구앙시 핑궈', '시안 유나이티드', '다롄 잉보', '충칭 통량롱', '수저우 동우', '옌볜 롱딩', '헤이룽장 아이스 시티', '랴오닝 티에렌', '상하이 가야', '포산 난스', '난징 시티', '우시 우구', '장시 루산', '칭다오 레드 라이온스']),
        3: ('중국 을급리그', [# 16
            '상하이 포트 B', '산둥 타이산 B', '베이징 궈안 B', '충칭 구롱', '후난 빌로우즈', '남통 지운 B', '광동 하이인', '하이난 스타', '광둥 광저우 레오파드', '산시 롄샹', '광시 란항', '장시 헤강', '다롄 화이', '취안저우 야신', '타이안 티안하', '후베이 이화'])
    },
    '인도': {
        1: ('인도 슈퍼리그', [# 12
            '모훈 바간', '뭄바이 시티', '고아 FC', '케랄라 블래스터스', '벵갈루루 FC', '오디샤 FC', '동벵골 FC', '첸나이인 FC', '노스이스트 유나이티드', '잠셰드푸르 FC', '펀자브 FC', '모함메단 SC']),
        2: ('I-리그', [# 14
            '스리니디 데칸', '하이더라바드 FC', '고쿨람 케랄라', '아이자울 FC', '네로카 FC', '처чил 브라더스', '실롱 라종', '델리 FC', '데포 FC', '인터 카시', '라자스탄 유나이티드', '남다리 FC', '트라우 FC', '스포팅 클럽 데 고아']),
        3: ('I-리그 2부', [# 12
            '뭄바이 시티 B', '벵갈루루 B', '고아 B', '케랄라 B', '벵갈루루 유나이티드', '골든 스레드', '아라 FC', '뎀포 SC', '수데바 델리', '케랄라 유나이티드', '유나이티드 SC', '오디샤 B'])
    },
    '미국': {
        1: ('메이저 리그 사커', [# 30
            '인터 마이애미', '콜롬버스 크루', 'LAFC', 'LA 갤럭시', 'FC 신시내티', '뉴욕 REDBULLS', '시애틀 사운더스', '휴스턴 다이너모', '뉴욕 시티 FC', '올랜도 시티', '샤를럿 FC', '애틀랜타 유나이티드', '필라델피아 유니언', 'CF 몽레알', '내슈빌 SC', '토론토 FC', '뉴잉글랜드 레볼루션', 'D.C. 유나이티드', '시카고 파이어', '세인트루이스 시티 SC', '실트레이크', '콜로라도 라피드', '미네소타 유나이티드', '포틀랜드 팀버스', '반쿠버 화이트캡스', '오스틴 FC', '댈러스', '스포팅 캔자스시티', '새너제이 어스퀘이크스', '샌디에이고 FC']),
        2: ('USL 챔피언십', [# 20
            '탬파베이 로우디스', '새크라멘토 리퍼블릭', '루이빌 시티 FC', '피닉스 라이징', '찰스턴 배터리', '오렌지 카운티 SC', '샌안토니오 FC', '인디 일레븐', '피츠버그 리버하운즈', '콜로라도 스프링스 스위치백스', '멤피스 901', '디트로이트 시티 FC', '하트포드 애슬레틱', '뉴멕시코 유나이티드', '오클랜드 루츠', '마이애미 FC', '털사', '라스베이거스 라이츠', '엘패소 로코모티브', '로드아일랜드 FC']),
        3: ('USL 리그 원', [# 16
            '유니온 오마하', '노스캐롤라이나 FC', '노던 콜로라도 헤일스톰', '샬럿 인디펜던스', '그린빌 트라이엄프', '리치먼드 키커스', '포워드 매디슨', '매디슨 56ers', '렉싱턴 SC', '사우스조지아 토르멘타', '센트럴 밸리 푸에고', '오캘라 FC', '스포팅 애리조나', '시라큐스 익스프레스', '텍사스 스퍼스', '애틀랜틱 시티']),
        4: ('USL 리그 투', [# 16
            '플린트 시티 벅스', '디모인 메네스', '벤투라 카운티 퓨전', '발라드 FC', '롱아일랜드 러프 라이더스', '텍사스 유나이티드', '애슈빌 시티', '버몬트 그린', '시카고 FC 유나이티드', '웨스턴 마시 피오니어스', '세인트루이스 라이온스', '라이언 FC', '맨해튼 SC', '오션 시티 노리스터스', '포트더들데일', '서던 서프'])
    },
    '멕시코': {
        1: ('리가 MX', [# 18
            '클럽 아메리카', '몬테레이', '티그레스 UANL', '과달라하라', 'PUMAS UNAM', '크루스 아술', '파추카', '톨루카', '레온', '산토스 라구나', '아틀라스 FC', '클럽 티후아나', '푸에블라', '아틀레티코 산 루이스', '마사틀란 FC', '네카사', '후아레스 FC', 'querétaro']),
        2: ('리가 드 에스판시온', [# 16
            '칸쿤 FC', '아틀란테 FC', '클럽 델리세시아스', '레오네스 네그로스', '아틀레티코 모렐리아', '미네로스 데 사카테카스', '시마로네스', '베나도스', '테파티틀란', '셀라야 FC', '타파티오', '알레브리헤스 데 오아하카', '코레카미노스 UAT', '틀락스칼라 FC', '도라도스 데 시날로아', '라파스 FC']),
        3: ('리가 프리미어', [# 16
            '치와와 FC', '이라푸아토', '탐피科 마데로', '라싱 포르투 팔메이라스', '페트롤레로스 살라만카', '가빌라네스', '인테르 플라야', '카페탈레로스', '알라크라네스 데 두랑고', '우니베르시다드 오토노마 데 사카테카스', '콜리마 FC', '멕시칼리 FC', '레보세로스 데 라 피에다드', '가빌라네스 데 마타모로스', '살티요 FC', '테코스 FC']),
        4: ('리가 TDP', [# 16
            '아카틀란', '아구아카테로스', '칠판싱고', '고릴라스 데 후아나카틀란', '마소르케로스', '묵세스', '페트롤레로스 포사 리카', '야우테펙', '아르테사노스 메테펙', '쿠아우틀라', '데포르티보 톨루카 B', '파추카 B', '티그레스 소노라', '셀라야 B', '아틀란테 찰코', '데포르티보 야우테펙'])
    },
    '코스타리카': {
        1: ('리가 FPD', [# 12
            '사프리사', '알라후엘렌세', '에레디아노', '카르타히네스', '과나카스테카', '산토스 데 구아필레스', '산카를로스', '스포르팅 산호세', '림몬 시티', '무니시팔 페레스 셀레돈', '푼타레나스 FC', '무니시팔 리베리아']),
        2: ('리가 데 아센소', [# 16
            '카르메리타', '에스카수세냐', '산타아나', '우루과이 데 코로나도', '투리알바', '골피토', '과달루페 FC', '히카랄 세르코바', '데포르티보 우프랄라', '림보네스', '산호세 FC', '에레디아노 B', '안티구아', '바리오 멕시코', '쿠에사다', '팔마레스']),
        3: ('코스타리카 3부 리그', [# 16
            '사프리사 B', '알라후엘렌세 B', '림바', '과달루페 B', '파라소', '모라비아', '에레디  B', '산호세 시티', '시라시', '사구아', '쿠라리단', '오로티나', '마티나', '포코시', '에스파르사', '바르바'])
    },
    '콜롬비아': {
        1: ('카테고리아 프리메라 A', [# 20
            '후니오르', '미요나리오스', '아틀레티코 나시오날', '아메리카 데 칼리', '인데펜디엔테 메데인', '데포르테스 톨리마', '산타페', '데포르티보 칼리', '아길라스 도라다스', '인데펜디엔테 엔비가도', '데포르티보 페레이라', '파스토', '라 에키다드', '온세 칼다스', '부카라망가', '보야카 치코', '알리안사 뻬뜨롤레라', '하과레스 데 코르도바', '포르탈레사 CEIF', '파트리오타스']),
        2: ('카테고리아 프리메라 B', [# 16
            '랴네로스', '쿠쿠타 데포르티보', '레알 카르타헤나', '아틀레티코 FC', '레오네스 FC', '데포르테스 킨디오', '오르소마르소', '레알 소아차', '우일라', '바랑키야 FC', '티그레스 FC', '보카 주니어스 데 칼리', '레알 산탄데르', '유니온 마그달레나', '보고타 FC', '인테르 팔미라']),
        3: ('리가 프리미어 아마추어', [# 16
            '나시오날 B', '미요나리오스 B', '후니오르 B', '칼리 B', '메데인 B', '톨리마 B', '산타페 B', '아메리카 B', '부카라망가 B', '엔비가도 B', '온세 칼다스 B', '페레이라 B', '랴네로스 B', '페레이라 유스', '레알 카르타헤나 B', '쿠쿠타 유스']),
        4: ('프리메라 C', [# 16
            '토탈 치코', '피오렌티나 카케타', '사이클론스 칼리', '디스트리우노스', '우니아우토노마', '판테라스 FC', '레알 산투아리오', '사커 로우', '안티오키아 FC', '데포르티보 네이바', '사바나 미요스', '나리뇨 FC', '수크레 FC', '아틀란티코 유나이티드', '볼리바르 FC', '카사나레 산토스'])
    },
    '우루과이': {
        1: ('프리메라 디비시온', [# 16
            '페냐롤', '나시오날', '리버풀 FC', '데펜소르 스포르팅', '몬테비데오 원더러스', '세로 라르고', '다누비오', '리버 플레이트', '몬테비데오 시티 토르케', '라싱 클룹 데 몬테비데오', '세로', '페닉스', '보스턴 리버', '데포르티보 말도나도', '프로그레소', '미라마르 미시오네스']),
        2: ('세군다 디비시온', [# 14
            '주벤투드', '플라사 콜로니아', '오리엔탈', '렌티스타스', '알비온', '세리토', '우루과이 몬테비데오', '람플라 주니어스', '아테나스 산카를로스', '수드 아메리카', '타쿠아렘보 FC', '베야 비스타', '세로 라르고 B', '포텐시아']),
        3: ('프리메라 아마추어', [# 16
            '콜론', '벨라 비스타', '바사녜스', '로차 FC', '우라칸 부세오', '캐나디안 FC', '빌라 테레사', '살토 FC', '데포르티보 콜로니아', '아트란티디아', '파르케 플라타', '마라톤', '알토 페루', '플라텐세 몬테비데오', '로스 하스미네스', '아르티가스']),
        4: ('디비시오날 D', [# 12
            '쿠페르', '파소 드 라 아레나', '하셀레 드 라 코스타', '도이처', '린콘', '리알 몬테비데오', '케구아이', '싱코 에스퀴나스', '우라칸 에스코르타', '몬테비데오 유나이티드', '체 가르디아', '뉴 보이스'])
    },
    '에콰도르': {
        1: ('LigaPro 세리에 A', [# 16
            '인디펜디엔테 델 바예', 'LDU 키토', '바르셀로나 SC', '에멜레크', '우니베르시다드 카톨리카', '아우카스', '엘 나시오날', '델핀', '무슈크 루나', '테크니코 우니베르시타리오', '데포르티보 쿠엥카', '오렌세 SC', '임바부라 SC', '마카라', '리베르타드 FC', '쿰바야 FC']),
        2: ('LigaPro 세리에 B', [# 10
            '쿠나이부로', '만타 FC', '9 데 옥투브레', '과야킬 시티', '레오네스 델 노르테', '산 안토니오', '샤샤란', '바르가스 토레스', '인디펜디엔테 주니어스', '구알라세오 SC']),
        3: ('세군다 카테고리아', [# 16
            '데포르티보 키토', '올메도', '과야킬 스포르트', '클루브 후벤투드', '아틀레티코 삼보론돈', '리가 데 로하', '아틀레티코 킨토', '로카푸에르테 FC', '임바부라 B', '콜론 FC', '후벤투드 미네라', '아틀레티코 토투아코', '아틀레티코 이바라', '데포르티보 구아노', '라 우니온', '3 데 마르소']),
        4: ('프로빈셜 리그', [# 12
            '후벤투드 이탈리아', '에스포리', '루미나우이', '푸에르토 키토', '데포르티보 케베도', '클루브 에스투디안테스', '발데스 SC', '파나마 SC', '로하 FC', '에스메랄다스 SC', '데포르티보 코토팍시', '테크니코 유스'])
    },
    '모로코': {
        1: ('보톨라 프로 1', [# 16
            '라자 카사블랑카', 'FAR 라바트', '위다드 카사블랑카', 'RS 베르칸', 'FUS 라바트', '올림픽 사피', '위니옹 투아르가', '마그레브 페스', '하사니아 아가디르', '마그레브 테투안', '샤바브 모하메디아', '이티하드 탄자', '유수피아 베레치드', '몰루디아 우지다', 'CODM 메크네스', '디파 하사니 엘 자디다']),
        2: ('보톨라 프로 2', [# 16
            '카우카브 마라케시', '위니옹 우지다', '스태드 마로캥', '샤바브 아틀라스 케니프라', '라피드 우에드 젬', 'JS 마시라', '올림픽 드 쿠립가', '라자 베니 멜랄', '샤바브 벵게리르', '라싱 드 카사블랑카', 'JS 수아렘', '이티하드 케미세트', '샤바브 리프 알 호세이마', 'WAF 페스', 'KAC 케니트라', '라샤드 베르누시']),
        3: ('나시오날 아마추어', [# 12
            'USM 우지다', '위다드 테마라', '파스 나도르', 'TAS 카사블랑카', '위니옹 테마라', 'JS 카스바 타들라', 'FATH 나도르', '위다드 칼라 세라그나', '올림픽 유수피아', 'AS 살레', 'CS 카스마트 투이자', '마그레브 마라케시']),
        4: ('아마추어 II', [# 12
            '에투알 카사블랑카', 'USM 우지다 B', 'SCC 모하메디아 B', '하사니아 아가디르 B', 'AS 살레 B', '위다드 세프루', '파스 나도르 B', '샤바브 라라슈', '라자 카사블랑카 B', 'FAR 라바트 B', '디파 에사우이라', '나자 자디다'])
    },
    '세네갈': {
        1: ('리그 1', [# 14
            '텡게트 FC', 'ASC 자라프', 'AS 피킨', '다카르 사크레-쾨르', '게디아웨이 FC', '링게르', 'US 고레', '카사 스포르츠', '스타드 드 음부르', '송코스', 'ASC 디암바르스', 'US 우아캄', '자스 하를렘', '오슬로 FA']),
        2: ('리그 2', [# 14
            '왈리단 FC', 'AJEL 드 뤼피스크', 'HLM', '잔 다르크', 'NGB', '포르 포르튀에르', '르네상스 다카르', 'AS 밤부르', '케르 마디오르', '아미티에 FC', '두아네스 다카르', '모데르 드 음부르', 'ASC 옐링가라', '티에스 FC']),
        3: ('나시오날 1', [# 12
            '음부르 프티-코트', 'ASC 예고', '캉베렌', '왈리단 B', 'RS 요프', '에주파트', '다카르 유니버시티 클럽', 'AS 살룸', 'US レ일', 'ASC 디알 디오프', '음부르 유나이티드', '루가 FC']),
        4: ('나시오날 2', [# 12
            'ASC 예고 주니어', '잔 다르크 B', 'RS 요프 B', '스타드 드 음부르 B', '콤볼레', '간디안 FC', '디암바르스 유스', '텡게트 유스', '피킨 레저브', '고레 B', '지긴쇼르 FC', '카올라크 FC'])
    },
    '나이지리아': {
        1: ('나이지리아 프리미어리그', [# 20
            '엔구가 レ인저스', '레모 스타스', '에님바', '로비 스타스', '카치나 유나이티드', '플라투 유나이티드', '카노 필라스', '슈팅 스타스', '바옐사 유나이티드', '나이저 토네이도스', '콰라 유나이티드', '선샤인 스타스', '아비아 워리어스', '아콰 유나이티드', '스포츠 브리프(스포르팅 라고스)', '하트랜드 FC', '나사라와 유나이티드', '엘-카네미 워리어스', '이코로두 시티', '비욘드 리미츠']),
        2: ('나이지리아 내셔널 리그', [# 16
            '워리 울브스', '곰베 유나이티드', '도마 유나이티드', '아다마와 유나이티드', '고 가운드 FC', '반델 유나이티드', '지에 가운드', '위키 투어리스츠', '크라운 FC', '게이트웨이 유나이티드', '자마파라 유나이티드', '소코토 유나이티드', '스마트 시티 FC', '로버스 FC 칼라바르', '원 로켓 FC', '자이트 FC']),
        3: ('나이지리아 전국 리그 1', [# 16
            '퍼스트 뱅크 FC', '라고스 시티 FC', '에보니 포스', '카두나 유나이티드', '바옐사 유나이티드 B', '워리 울브스 B', '가드로 FC', '아부자 FC', '제이드 아카데미', '코기 유나이티드', '콜린스 에드 FC', '에시엔 우딤 FC', '요베 데저트 스타스', '아남브라 유나이티드', '델타 포스', 'FC 에베데이']),
        4: ('나이지리아 전국 리그 2', [# 12
            '라구스 유나이티드', '조스 유나이티드', '아비아 그레이스', '우요 스타스', '이바단 보머스', '오웨리 나이트', '카노 필라스 유스', '에님바 유스', '레모 스타스 B', '플라투 유스', '아콰 레저브', '로비 스타스 유스'])
    },
    '카메룬': {
        1: ('카메룬 엘리트 원', [# 16
            '코톤 스포르', '바멘다(PWD 바멘다)', '캐논 야운데', '유니온 두알라', '디나모 두알라', '레스 아스트레스', '빅토리아 유나이티드', '스포르팅 마로아', '포브 바후삼', '밤부토스 Mbouda', '스타드 레나르', '에글 로얄', '콜롱브 뒤 자에에루보', 'AS 포르투나', '가주아 스포르', '아비옹 아카데미']),
        2: ('카메룬 엘리트 투', [# 16
            '티코 유나이티드', '뉴 스타 두알라', '판테르 방강테', '라싱 바푸삼', '에딩 스포르', '얄레 유나이티드', '마네무바', '통네르 야운데', '에글 로얄 드 멘주아', '레오파르 드 두알라', '폰차 FC', '유니스포르 바팡', 'ISOHSA 림베', 'AS 페닉스', '은가운데레 FC', '드래곤 야운데']),
        3: ('카메룬 리저널 리그', [# 12
            '코톤 B', '캐논 B', '야운데 시티', '두알라 FC', '가루아 유나이티드', '마루아 FC', '부메아 스타즈', '크리비 FC', '바멘다 유나이티드', '포르 가루아', '은콩삼바 FC', '에볼로와 FC'])
    },
    '이집트': {
        1: ('이집트 프리미어리그', [# 18
            '알 아흘리', '피라미즈', '자말렉', '알 마스리', '모던 퓨처(모던 스포츠)', '스무하', 'ZED FC', '엔피', '이티하드 알렉산드리아', '이스마일리', '엘 자이시', '세라미카 클레오파트라', '국립은행(뱅크 오브 이집트)', '엘 고우나', '이스타판', '발라디야트 엘 마할라', '페트로젝트', '가즐 엘 마할라']),
        2: ('이집트 세컨드 디비전 A', [# 18
            '하라베디아', '와디 데글라', '탄타 SC', '세카 엘 하디드', '라야', '라바나', '아스완', '엘 달킬레야', '테레콤 이집트', '프로 크롭', '라나나', '알 카나', '페트로아시우트', '엘 세카', '디크니스', '마크릴', '알루미늄 나흐', '엘 미니아']),
        3: ('이집트 세컨드 디비전 B', [# 12
            '엘 엔타그 엘 하르비', '소하고 SC', '베니 수에프 FC', '파늄 FC', '테라수스', '골디 FC', '포트사이드 시티', '셰이크 자예드', '룩소르 FC', '카프르 엘 셰이크', '엘 미니아 B', '아스완 B']),
        4: ('이집트 써드 디비전', [# 12
            '디역 네그', '빌베이스 FC', '샬브 FC', '마스르 타민', '텔 타 가바', '알 아흘리 B', '자말렉 B', '도미앗 SC', '엔피 B', '스무하 B', 'ZED B', '가즐 B'])
    },
    '가나': {
        1: ('가나 프리미어리그', [# 18
            '아산테 코토코', '하츠 오브 오크', '메데아마 SC', '아두아나 스타스', '베쳄 유나이티드', '레공 시티스', '사마르텍스', '나라시 내셔널', '하트 오브 라이온스', '골드 스타스', '베레쿰 첼시', '드림스 FC', '네이션스 FC', '카렐라 유나이티드', '악크라 라이온스', '그레이트 올림픽스', 'RTU', '보포아콰 타노']),
        2: ('가나 디비시온 원 리그', [# 16
            '킹 파이살', '나시오날 가나', '리버티 프로페셔널스', '테마 유나이티드', '스위드루 올 스타스', '테치만 시티', '볼가 아야네', '와 올 스타스', '은크란자 워리어스', '코토코 로얄스', '에부수아 드워프스', '뉴 에두비아스', '하츠 오브 라이온스 B', '베레쿰 B', '드림스 B', '메데아마 B']),
        3: ('가나 2부 리그', [# 12
            '코토코 B', '하츠 B', '아크라 시티', '쿠마시 스타즈', '타코라디 FC', '타말레 유나이티드', '케이프코스트', '오부아시', '아샤임 유나이티드', '코포리두아', '호 보머스', '수냐니 유나이티드'])
    },
    '튀니지': {
        1: ('튀니지 리그 프로페시엘 1', [# 16
            '에스페랑스 드 튀니스', '에투알 뒤 사헬', '클럽 아프리캥', 'CS 스팍시엔', 'US 모나스티르', '스타드 튀니지앵', 'US 벤 게르단', '클럽 비제르탱', 'EGS 가프사', '올림픽 베자', 'ES 자르지스', 'AS 가베스', 'AS 솔리만', 'US 타타우인', '메틀라우이', 'JS 카이루안']),
        2: ('튀니지 리그 프로페시엘 2', [# 14
            'CS 함맘-리프', 'AS 마르사', '스타드 가베시엔', '에스페랑스 자르지스', 'Jendouba 스포르', 'CS 코르바', 'EM 마흐디아', 'Sfax 래일웨이', '오세아노 케르케나', 'AS 오스만', 'SC 벤 아루스', '로켓 즈지스', '올림픽 베자 B', '비제르탱 B']),
        3: ('튀니지 리그 3', [# 12
            '에스페랑스 B', '사헬 B', '튀니스 시티', '스팍스 유나이티드', '카세린', '토죄르', '바디 FC', '멘젤 부젤파', '칼라 스포르', '제르바', '메드닌', '하젬'])
    },
    '알제리': {
        1: ('알제리 리그 프로페시엘 1', [# 16
            'CR 벨루이즈다드', 'CS 콘스탄틴', 'USM 알제', 'JS 카빌리', 'MC 알제', 'ES 세티프', 'JS 사우라', 'Paradou AC', 'MC 오란', 'ASO 슐레프', 'USM 켄첼라', 'NC 마그라', 'USS 수프', 'ES벤아크눈', '올림픽 아크부', '모스타가넴']),
        2: ('알제리 리그 2', [# 16
            'AS오란', 'NA 후세인 데이', 'RC 렐리잔', 'WA 틀렘센', 'AS 보르드즈', 'MO 베자이아', 'USM 엘 하라치', 'JSM 베자이아', 'CA 바트나', 'USM 안나바', 'JS 보르드즈 메나이엘', 'MC 엘 에울마', 'SKAF 켐스 밀리아나', 'RC 아르바', 'GC 마스카라', 'ASM 오란']),
        3: ('알제리 아마추어 인터-레전', [# 12
            '벨루이즈다드 B', '콘스탄틴 B', '알제 시티', '오란 유나이티드', '블리다', '구엘마', '바트나', '사이다', '티아레트', '스킥다', '겔마 B', '부이라'])
    },
    '말라위': {
        1: ('말라위 슈퍼리그', [# 16
            '냐사 빅 불리츠', '실버 스트라이커스', '마이티 원더러스', '시빌 서비스 수페르스', '치티파 유나이티드', '캄주 바라크스', '모얄레 바라크스', '카롱가 유나이티드', '데드자 다이내모스', '방구 올 스타스', '크레크 FC', 'FOMO FC', '음주주 시티 이글스', '마피에코 FC', '바카 유나이티드', '프리메로스']),
        2: ('말라위 리전 리그', [# 14
            '블란타이어 유나이티드', '음주주 시티', '좀바 워리어스', '릴롱궤 스타스', '치카와 FC', '은코타코타', '에콰엔디 로버스', '레드 라이온스', '블란타이어 틸레', '음친지 유나이티드', '루모피 유나이티드', '음주주 유니버시티', '실버 B', '원더러스 B']),
        3: ('말라위 디스트릭트 리그', [# 12
            '빅 불리츠 B', '블란타이어 B', '릴롱궤 B', '치주물루 유나이티드 FC', '망고치 FC', '카상구', '치라줄루 유나이티드', '발라카 FC', '풀로네 FC', '데드자 유스', '음주주 B', '좀바 B'])
    },
    '스위스': {
        1: ('스위스 슈퍼리그', [# 12
            '영 보이스', '루가노', '세르베트', '취리히', '장크트 갈렌', '루체른', '바젤', '빈터투어', '이베르동 스포르', '로잔 스포르', '그라스호퍼', '시온']),
        2: ('챌린지리그', [# 10
            '툰', '파두츠', '빌', '아라우', '뇌샤텔 크사마크스', '스타드 로잔-우시', '샤프하우젠', '벨린초나', '에투알 카루주', '스타드 니옹']),
        3: ('프로모션 리그', [# 16
            '라퍼스빌-요나', '크린스', '참', '브륄', '파라디소', '비엘-비엔', '바덴', '바젤 II', '취리히 II', '영 보이스 II', '루체른 II', '장크트 갈렌 II', '루가노 II', '들레몽', '바부아', '불레']),
        4: ('1. 리가 클래식', [# 16
            '그라스호퍼 II', 'FC 투겐', 'FC 솔로투른', 'FC 쇼츠', 'FC 베츠ビル-보스테텐', 'FC 에샬랑', 'FC 메이랭', '바덴 B', '린트 04', '크로이츠링겐', '코소바 취리히', '빈터투어 II', '로잔 스포르 II', '세르베트 II', '나터스', '베베 스포르'])
    },
    '오스트리아': {
        1: ('분데스리가', [# 12
            '스투름 그라츠', '레드불 잘츠부르크', 'LASK 린츠', '라피드 빈', 'TSV 하르트베르크', '아우스트리아 빈', '볼프스베르거 AC', '아우스트리아 클라겐푸르트', '블라우바이스 린츠', '알타흐', 'WSG 티롤', 'GAK 1902']),
        2: ('2. 리가', [# 16
            'SV 리트', '아드미라 바커', '플로리드스도르퍼 AC', 'SW 브레겐츠', '장크트 푈텐', 'SV 호른', '라피드 빈 II', '스투름 그라츠 II', '리페링', '암스텐텐', '라프니츠', '카펜베르크', '도른비른', '스트strip핑', 'ASK 보이츠베르크', '아우스트리아 루스테나우']),
        3: ('레기오날리가', [# 16
            '아우스트리아 잘츠부르크', 'LASK II', '핀츠가우 잘펠덴', '웨이즈', '글라이스도르프', '구르텐', 'DSV 레오벤', '크렘서 SC', '트라이스키르헨', '레오벤', '벨스', '마르크트올디스', '볼프스베르거 AC B', '아우스트리아 빈 II', '도나우펠트', '파어도르프']),
        4: ('란데스리가', [# 16
            'FC 바커 인스브루크', 'ASV 지겐도르프', 'SV 스피탈', 'TuS 바드 글라이헨베르크', 'SC 칼스도르프', 'SV 아우스트리아 잘츠부르크 B', '바드 자우에르브룬', '파르스', '그라처 AK B', '린츠 ASK B', '슈와츠', '쿠프슈타인', '장크트 요한', '아우스트리아 클라겐푸르트 B', '쾨플라흐', '페어트라흐'])
    },
    '우크라이나': {
        1: ('우크라이나 프리미어리그', [# 16
            '샤흐타르 도네츠크', '디나모 키이우', '크리우바스', '폴리샤 지토미르', '루흐 리비우', '올렉산드리아', '보르스클라 폴타바', 'LNZ 체르카시', '콜로스 코발리브카', '초르노모레츠 오데사', '조랴 루한스크', '오볼론 키이우', '베레스 리브네', '인굴레츠', '카르파티 리비우', '레프트 뱅크']),
        2: ('우크라이나 퍼스트 리그', [# 16
            '에피첸테르', '프리카르파티아', '마리우폴', '빅토리아 수미', '포딜리아', '메탈리스트 1925', '미나이', '메탈루르흐 자포리자', '부코비나 체르니우치', '니바 테르노필', '디나즈 비시고로드', '크레민 크레멘추크', '아그로비즈네스 Волочиськ', 'SK 폴타바', '쿠드 리브카', '유크스에이']),
        3: ('우크라이나 세컨드 리그', [# 12
            '니바 빈니차', '스칼라 1911', '차이카 페트로파블리브스카', '레알 파르마', '포돌리아 흐멜니츠키 B', '트로스탸네츠', '루흐 리비우 II', '카르파티 리비우 II', '폴리샤 B', '올렉산드리아 B', '빌리프', '메탈리스트 하르키우 유스']),
        4: ('우크라이나 아마추어 리그', [# 12
            'ODKA 키이우', '드루주바 므리우카', '모터 자포리자', '볼란 루츠크', '나프토빅 오흐티르카', '아그론 벨리키', '블라스트 포딜리아', '페닉스 포드모나스틸', '스탠다드 노비', '티탄 이스마일', '블라니 카르파티', '올림피아 사빈치'])
    },
    '튀르키예': {
        1: ('쉬페르리그', [# 20
            '갈라타사라이', '페네르바체', '트라브존스포르', '베식타스', '바샥셰히르', '카슴파샤', '알라니아스포르', '안탈리아스포르', '시바스스포르', '리제스포르', '가지안텝 FC', '삼순스포르', '카이세리스포르', '하타이스포르', '코냐스포르', '앙카라귀쥐', '카라귐뤼크', '펜디크스포르', '에유프스포르', '괴즈테페']),
        2: ('TFF 1. 리그', [# 18
            '사카리아스포르', '보드룸스포르', '촐룸 FK', '코자엘리스포르', '겐출레르비를리이', '볼루스포르', '위스쿠다르 안드레이', '마니사 FK', '반디르마스포르', '에르주룸스포르', '투즐라스포르', '우르파스포르', '아다나스포르', '기레순스포르', '우무라니예스포르', '예니 말라티아스포르', '아메드 SK', '에센레르 에레클리']),
        3: ('TFF 2. 리그', [# 16
            '부르사스포르', '알티노르두', '메네멘 FK', '카스타모누스포르', '반스포르', '이스켄데룬스포르', '듀즈체스포르', '페티예스포르', '부자스포르 1928', '앙카라스포르', '이스파르타 32', '소마스포르', '이네골스포르', '아르나부트쾨이', '데니즐리스포르', '사리에르']),
        4: ('TFF 3. 리그', [# 16
            '오르두스포르 1967', '카르시야카', '에르바아스포르', '아나돌루 셀추클루', '실리브리스포르', '쿠사다시스포르', '필드림스포르', '아디야만 FK', '토카트 FK', '에르진잔스포르 B', '아랄릭', '바르틴스포르', '차탈차스포르', '네브셰히르 스포르', '얄로바스포르', '우샤크스포르'])
    },
    '스웨덴': {
        1: ('알스벤스칸', [# 16
            '말뫼 FF', '엘프스보리', '헤켄', '유르고르덴', '하마르뷔', '칼마르 FF', 'AIK 솔나', 'IFK 예테보리', 'IFK 노르셰핑', '미엘비 AIF', '시리우스', '할름스타드 BK', 'IFK 베르나모', '브롬마포이카르나', '베스테로스 SK', 'GAIS']),
        2: ('수페레탄', [# 16
            '우트시크텐스 BK', '외스테르스 IF', '데게르포르스', '바르베리 BoIS', '외레브로', '헬싱보리 IF', '에스킬스투나', '브라게', '외스테르순드 FK', '란스크로나 BoIS', '예블레 IF', '수스발', '트렐레보리 FF', '외르그리테 IS', '산드비켄스 IF', 'IK 오데볼드']),
        3: ('디비전 1', [# 16
            '팔켄베리 FF', '노르딕 유나이티드', 'FC 스톡홀름', '룬드 BK', '에스킬스민네', '유나이티드 IK 노르딕', '루스엔고르드', '아시리스카 FF', '바살룬드 IF', '오스카스함스 AIK', '융스킬레 SK', '트룰스하탄', '칼스타드 포트볼', '피테오 IF', '우메오 FC', '타뷔 FK']),
        4: ('디비전 2', [# 16
            'IFK 말뫼', '엔스케데 IK', 'IFK 스톡홀름', '프리스카 빌요르', 'BK 올림픽', '후스콰르나 FF', '믈뢸비 AIK', '리디외', '보틀란드', '후디크스발', '산드비켄스 AIK', '칼마르 AIK', '엔셰핑스 SK', '베르가', '헤슬레홀름 IF', '킬레'])
    },
    '웨일스': {
        1: ('웨일스 프리미어리그', [# 12
            '더 뉴 세인츠', '코나스 키 노마즈', '발라 타운', '페니본트', '카디프 메트로폴리탄', '뉴타운 FC', '하버포드웨스트', '에버리스트위스', '카나번 타운', '배리 타운', '브리튼 페리', '플린트 타운']),
        2: ('심루 노스 / 심루 사우스', [# 16
            '에어버스 UK', '포트매도그', '카이르수스', '덴비 타운', '란디드노', '콜윈 베이', '폰티프리드 유나이티드', '란둘로', '프레스타틴 타운', '구일스필드', '홀리웰 타운', '아판 리도', '라네리 타운', '캄브리안 & 클라이닥', '아만포드', '카이라우 엘리']),
        3: ('웨일스 3부 리전 리그', [# 12
            'TNS B', '코나스 B', '카디프 시티 B', '스완지 시티 B', '렉섬 B', '뱅거 시티', '릴 FC', '뉴포트 B', '체셔 유나이티드', '몰드 알렉산드라', '루틴 타운', '포트 탤벗 타운'])
    },
    '폴란드': {
        1: ('엑스트라클라사', [# 18
            '레기아 바르샤바', '레흐 포즈난', '라쿠프 쳉스토호바', '포곤 슈체친', '실롱스크 브로츠와프', '야기엘로니아 비아위스토크', '피아스트 글리비체', '자그뛔비에 루빈', '구르니크 자브제', '우치 KS', '스탈 미엘레츠', '라도미악 라돔', '비제프 우치', '루흐 호주프', '바르타 포즈난', '크라코비아', '푸슈차 니에포워미체', '레치아 그단스크']),
        2: ('I 리가', [# 16
            '비스와 크라쿠프', '미에치 레그니차', '아르카 그디니아', '브루크베트 테르말리카', 'GKS 카토비체', '폴로니아 바르샤바', '티히 71', '오드라 오폴레', '위스라 플로크', '즈니치 프루슈쿠프', '흐로브리 그워구프', '지니치 플로크', '포드베스키지에', '스탈 스탈로바', '코트비차 코워브제크', '호이니찬카']),
        3: ('II 리가', [# 16
            '레기아 B', '레흐 B', '올림피아 엘블롱크', '자그뛔비에 소스노비에츠', '포곤 시에들체', '올림피아 그루지온츠', '비스와 푸와비', 'SKRA 쳉스토호바', '라두니아 스텡지차', '자그뛔비에 루빈 II', '야스트젱비에', 'KKS 칼리시', '후트니크 크라쿠프', '로즈보이 카토비체', '바르타 시에라즈', '스탈 미엘레츠 II'])
    },
    '헝가리': {
        1: ('넴제티 버이녹샤그 I', [# 12
            '페렌츠바로시', '케치케메트', '데브레첸', '푸스카스 아카데미아', '비디(페헤르바르)', 'MTK 부다페스트', '우이페스트', '퍽시 FC', 'ZTE FC', '디오스죄르', '키스바르다', '메조코베스드']),
        2: ('넴제티 버이녹샤그 II', [# 16
            '부다페스트 혼베드', '바사스 FC', '죄르 ETO', '젬프렌', '세게드 2011', '니레지하자', '페치 AFC', '코자르미스레니', '시오포크', '할라다스', '부다포크', '조르모트', '소크사르', '아즈카', '카진츠바르치카', '티사케치케']),
        3: ('넴제티 버이녹샤그 III', [# 16
            '페렌츠바로시 B', '푸스카스 B', '부다페스트 B', '데브레첸 B', '카포스바르', '베스프렘', '살고터랸', '체글레드', '쇼프론', '하즈두소보슬로', '티사우이바로시', '도로그', '베케스처버', '바사스 B', '우이페스트 B', '비디 B'])
    },
    '세르비아': {
        1: ('수페르리가', [# 16
            '츠르베나 즈베즈다', '파르티잔', 'TSC 바치카 토폴라', '추카리치키', '보이보디나', '노비 파자르', '라드니치키 1923', '보주도바츠', '나프레다크', '스파르타크 수보티차', '믈라도스트 루차니', '라드니치키 니시', '얀보르 이바니차', 'IMT 노비 베오그라드', '젤레즈니차르', '라드니크 수르둘리차']),
        2: ('프르바 리가', [# 16
            '믈라도스트 GAT', '콜루바라', '마치바', '오프카 베오그라드', '스메데레보 1924', '인디야', '그라피차르', '라드니치키 스렘스카미트로비차', '두보치차', '슬로보다 우지체', '브르샤츠', '예딘스트보 우브', '메탈라츠', '라드 베오그라드', '노비 사드', '라드니치키 노비 베오그라드']),
        3: ('스릅스카 리가', [# 12
            '즈베즈다 B', '파르티잔 B', '제문', '보라츠 차차크', '야고디나', '텔옵티크', '티모크', '부두치노스트 도바노브치', '바츠카', '로즈니차', '라드니치키 피로트', '프로레테르 노비 사드'])
    },
    '스코틀랜드': {
        1: ('스코티시 프리미어십', [# 12
            '셀틱', '레인저스', '하츠', '킬마녹', '세인트 미렌', '던디 FC', '애버딘', '마더웰', '하이버니언', '로스 카운티', '세인트 존스톤', '던디 유나이티드']),
        2: ('스코티시 챔피언십', [# 10
            '레이스 로버스', '파틱 시슬', '에어 유나이티드', '그리녹 모턴', '던펌클린 애슬레틱', '해밀턴', '폴커크', '퀸즈 파크', '인버네스', '리빙스턴']),
        3: ('스코티시 리그 1', [# 10
            '알로아 애슬레틱', '몬트로즈', '코브 레인저스', '켈티 하츠', '덤바턴', '스텐하우스뮤어', '아브로스', '안난 애슬레틱', '퀸 오브 더 사우스', '에어드rie오니언스']),
        4: ('스코티시 리그 2', [# 10
            '클라이드', '엘긴 시티', '포파 애슬레틱', '피터헤드', '스트랜라어', '스파르탄스', '본니리그 로즈', '이스트 파이프', '스프링번', '스터링 알비온'])
    },
    '체코': {
        1: ('체코 퍼스트 리그', [# 16
            '스파르타 프라하', '슬라비아 프라하', '빅토리아 플젠', '슬로바츠코', '시그마 올로모우츠', '오스트라바', '믈라다 볼레슬라프', '슬로반 리베레츠', '한델스 플젠', '테플리체', '야블로네츠', '파르두비체', '카르비나', '보헤미안스 1905', '즈브로요프카 브르노', '듀클라 프라하']),
        2: ('체코 내셔널 풋볼 리그', [# 16
            '비소치나 이흘라바', '바닉 오스트라바 B', '시그마 올로모우츠 B', '스파르타 프라하 B', '타보르스코', '프리브람', '블란스코', '흐루딤', '오파바', '블라심', '바르스도르프', '프로스테요프', '지즈코프', '리스엔', '한델스 브르노', '크롬네리츠']),
        3: ('ČFL/MSFL', [# 12
            '슬라비아 B', '플젠 B', '보헤미안스 B', '프리드란트', '할루치', '즐린 B', '피섹', '모스탄', '유스티 나드 라벰', '클라드노', '콜린', '소콜 브로자니'])
    },
    '칠레': {
        1: ('프리메라 디비시온', [# 16
            '콜로-콜로', '우니베르시다드 데 칠레', '우니베르시다드 카톨리카', '우아치파토', '팔레스티노', '에베르톤', '코브레살', '코킴보 우니도', '이키케', '크리코 유니도', '라 세레나', '아우다스 이탈리아노', '오히긴스', '뉴블렌세', '유니온 에스파뇰라', '데포르테스 코피아포']),
        2: ('프리메라 B', [# 16
            '코브레로아', '산티아고 원더러스', '데포르테스 안토파가스타', '테무코', '산루이스', '레인저스', '유니온 산 펠리페', '산티아고 모닝', '데포르테스 산타 크루스', '바르네체아', '멜리피야', '산 마르코스 데 아리카', '데포르테스 푸에르토 몬트', '라 세레나 B', '이키케 B', '레코레타']),
        3: ('세군다 디비시온 아마추어', [# 12
            '콜로콜로 B', 'U 칠레 B', 'U 카톨리카 B', '산 안토니오 유나이티드', '페르난데스 비알', '리마체', '트란스안디노', '콘셉시온', '프로브레시온 퀴요타', '오소르노', '라우타로 데 부인', '헤네랄 벨라스케스'])
    },
    '페루': {
        1: ('리가 1', [# 18
            '우니베르시타리오', '알리안사 리마', '스포르팅 크리스탈', '멜가르', '시엔시아노', '쿠스코 FC', '세사르 바예호', 'FBC 멜가르', '스포르트 보이스', '우니온 코메르시오', 'UTC 카하마르카', '카를로스 만누치', '아틀레티코 그라우', 'ADT 타루마', '데포르티보 가르실라소', '샹카스', '코메르시안테스 우니도스', '알리안사 아틀레티코']),
        2: ('리가 2', [# 12
            '데포르티보 무니시팔', '후안 아우리치', '아야쿠초', '산 마르틴', '루벤시아노', '피라타 FC', '알리안사 우아누코', '안토니오 산토스', '차바 코메르시오', '유니온 우아랄', '산토스 나스카', '리아바amba']),
        3: ('코파 페루', [# 12
            '우니베르시타리오 B', '알리안사 B', '크리스탈 B', '스포르트 앙카시', '코로넬 볼로그네시', '멜가르 B', '타루마 B', '호세 갈베스', '아틀레티코 우라칸', '데포르티보 쿱솔', '데포르티보 카하마르카', '피우라 유나이티드'])
    },
    '파라과이': {
        1: ('프리메라 디비시온', [# 12
            '올림피아', '세로 포르테뇨', '리베르타드', '구아라니', '나시오날', '스포르티보 루케뇨', '아멜리아노', '타쿠아리', '헤네랄 카바예로 JLM', '솔 데 아메리카', '2 데 마요', '트리니덴세']),
        2: ('디비시온 인테르메디아', [# 16
            '과이레냐', '레시스텐시아', '산 로렌소 파라과이', '페르난도 데 라 모라', '루비오 뉴', '12 데 옥투브레', '레꼬레따', '3 데 페브레로', '인디펜디엔테 CG', '페르난도', '산타니', '카아구아수', '마리아노 로케', '아티라 FC', '12 데 페브레로', '콜레히알레스']),
        3: ('프리메라 디비시온 B', [# 12
            '올림피아 B', '세로 포르테뇨 B', '리베르타드 B', '스포르티보 이테뇨', '산 로케', '필라르 유나이티드', '벤하민 아세발', '크리스토 레이', '3 데 페브레로 B', '구아라니 B', '타쿠아리 B', '루케뇨 B'])
    },
    '베네수엘라': {
        1: ('프리메라 디비시온', [# 14
            '데포르티보 타치라', '카라카스 FC', '아카데미아 푸에르토 카베요', '포르투게사', '모나가스', '메트로폴리타노스', '라 가이아(데포르티보 라 과이라)', '사모라', '카라보보', '에스투디안테스 데 메리다', '앙고스투라', '인테르 데 바리나스', '우니베르시다드 센트랄', '라요 술리아노']),
        2: ('세군다 디비시온', [# 12
            '미네로스 데 과야나', '우니온 아틀레티코', '티타네스', '우레냐', '라라 FC', '아틀레티코 엘 비히아', '디나모 푸에르토', '헤레스 FC', '마리티모 데 라 과이라', '아라구아 FC', '볼리바르 SC', '헤네라레스 데 마라카이보']),
        3: ('베네수엘라 테르세이라', [# 12
            '타치라 B', '카라카스 B', '마라카이보', '발렌시아 스타즈', '푸에르토 락 크루스', '메리다 유나이티드', '바리나스', '볼리바르 FC', '오리엔테 FC', '아카데미아 레이', '수아레 FC', '데포르티보 안소아테기 유스'])
    },
    '볼리비아': {
        1: ('프리메라 디비시온', [# 16
            '볼리바르', '더 스트롱기스트', '올웨이즈 레디', '호르헤 빌스테르만', '오리엔테 페트롤레로', '블루밍', '나시오날 포토시', '아우로라', '리얼 토마야포', '과비라', '인디펜디엔테 페트롤레로', '로얄 파리', '유니베르시타리오 데 빈토', '레알 산타크루스', '산 안토니오 불로 불로', 'G.V. 산 호세']),
        2: ('코파 시몬 볼리바르', [# 16
            '바카 디에스', '리얼 포토시', '데스트로이어스', '산 호세', '우니베르시타리오 수크레', '리베르타드 그란 마모레', '누에바 클루브', '아틀레티코 베르메호', '파투호스 FC', '아볼 프레소', '24 데 셉티엠브레', '토토라 리얼 오루로', '시클론', '시티 FC 산타크루스', '클루브 아바요아', '알리안사 베니']),
        3: ('볼리비아 리전 리그', [# 12
            '볼리바르 B', '스트롱기스트 B', '라파스 FC', '산타크루스 유나이티드', '코차밤바 스타즈', '포토시 유나이티드', '베니 FC', '판도 FC', '오리엔테 B', '블루밍 유스', '빌스테르만 B', '추키사카 FC'])
    },
    '캐나다': {
        1: ('캐나디안 프리미어리그', [# 8
            '포지 FC', '카발리 FC', '퍼시픽 FC', '할리팩스 완더러스', '아틀레티코 오타와', '발루어 FC', '반쿠버 FC', '요크 유나이티드']),
        2: ('리그1 캐나다', [# 16
            '본 아줄', '시그마 FC', '블루 데빌스', '반쿠버 화이트캡스 리저브', 'TFC 아카데미', '시마로네스 캐나다', '셀틱 QC', '로버스 FC', '스카버러 SC', '해밀턴 시티', '토론토 펄스', '우드브리지 스토라이커스', '시메트리 FC', '알리안스 드 몬트리올', 'FC 라발', '세인트-휴베르트']),
        3: ('캐나다 내셔널 아마추어 리그', [# 12
            '포지 B', '카발리 B', '토론토 시티', '몬트리올 유나이티드', '캘거리 스타즈', '에드먼턴 유나이티드', '위니펙 시티', '빅토리아 킹스', '리자이나 레인저스', '서스카툰 유나이티드', '할리팩스 시티', '오타와 로버스'])
    },
    '파나마': {
        1: ('리아 파나메냐 데 풋볼', [# 12
            'CAI 파나마', '타우로 FC', 'CD 플라사 아마도르', '스포르팅 산 미겔리토', '클럽 데포르티보 우니베르시타리오', '산 프란시스코', '알리안사 파나마', '아라베 우니도', '에레라 FC', '포티아 델 에스테(코스타 델 에스테)', '우니온 데포르티바', '베라구아스 유나이티드']),
        2: ('리가 나시오날 데 아센소', [# 16
            '아틀레티코 치리키', '파나마 시티 FC', '콜론 C-3', '선트라크스', '리오 아바호', '아틀레티코 파나마', '아길라스 데 라 초레라', '챔피언스 AC', '아라베 우니도 B', '타우로 B', '스포르팅 B', '플라사 아마도르 B', '센트라 카르타헤나', '산 마르틴 FC', '우니베르시타리오 B', '치리키 옥시덴탈']),
        3: ('파나마 디스트릭트 리그', [# 12
            'CAI B', '다비드 FC', '산티아고 스타즈', '치트레 FC', '라 초레라', '토쿠멘 FC', '페노노메 FC', '라스 테블라스', '보카스 델 토로', '콜론 스타스', '파나마 비에호', '발보아 FC'])
    },
    '자메이카': {
        1: ('자메이카 프리미어리그', [# 14
            '하버 뷰', '마운트 플레전트', '카발리어 FC', '아넷 가든스', '워터하우스 FC', '티볼리 가든스', '험블 라이온', '포트모어 유나이티드', '던베홀든', '몰린스 유나이티드', '몬테고 베이 유나이티드', '베어 패닉스(베어 플레전트)', '라스코 유나이티드', '채플턴 마룬스']),
        2: ('KSAFA 슈퍼리그', [# 12
            '보이즈 타운', '리얼 모이네스', '포트 안토니오', '록포트 FC', '레알 킹스턴', '불 베이 FC', '마버리 유나이티드', '브라운스 타운', '세인트 조지스', '바비칸 FC', '미드워크 유나이티드', '시포트 유나이티드']),
        3: ('자메이카 디스트릭트 리그', [# 12
            '하버 뷰 B', '마운트 B', '킹스턴 시티', '세인트 안드레', '네그릴 FC', '오초 리오스', '스페니시 타운', '사바나', '팔마우스 FC', '블랙 리버', '모란트 베이', '루세아 스타스'])
    },
    '아랍에미리트': {
        1: ('UAE 프로리그', [# 14
            '알 아인', '샤바브 알 아흘리', '샤르자 FC', '알 와슬', '알 자지라', '알 나스르 UAE', '알 와흐다', '알 아지만(아즈만)', '알 이티하드 칼바', '호르 파칸', '바니야스', '알 다프라', '디바 알 푸자이라', '하타 클럽']),
        2: ('UAE 디비전 1', [# 17
            '알 오루바', '푸자이라 FC', '에미레이트 클럽', '알 마스루프', '알 가리아', '디바 알 히슨', '알 아라비', '알 타이드', '알 람스', '하마리아', '알 자지라 알 함라', '마사피', '골프 유나이티드', '시티 FC두바이', '유나이티드 FC', '플리트우드 유나이티드']),
        3: ('UAE 세컨드 디비전', [# 12
            '알 아인 B', '샤바브 알 아흘리 B', '아부다비 시티', '두바이 유나이티드', '라스 알 카이마', '아즈만 B', '샤르자 B', '펄 두바이', '라 리가 발렌시아 아카데미', '지역 FC', '아틀레티코 아라비아', '팰컨스 FC'])
    },
    '오만': {
        1: ('오만 프로리그', [# 12
            '알 세에브', '도파르 클럽', '알 나흐다', '알 수와이크', '오만 클럽', '소하르 클럽', '수르 클럽', '알 랍사', '바흘라 클럽', '알 나스르 오만', '이브리 클럽', '알 샤바브 오만']),
        2: ('오만 1부 리그', [# 12
            '알 무디비', '니즈와 클럽', '살랄라 클럽', '미르바트', '알 무스카트', '판자 클럽', '알 카부라', '알 부스타이', '비디야 클럽', '알 이티하드 살랄라', '자일란 클럽', '아흘리 사다브']),
        3: ('오만 2부 리그', [# 12
            '알 세에브 B', '도파르 B', '무스카트 시티', '소하르 B', '마트라', '카사브', '부르카', '잘란', '디바 클럽', '사함 B', '이브리 B', '나흐다 B'])
    },
    '태국': {
        1: ('타이 리그 1', [# 16
            '부리람 유나이티드', '방콕 유나이티드', '포트 FC', 'BG 빠툼 유나이티드', '무앙통 유나이티드', '치앙라이 유나이티드', '랏차부리 FC', '콘캔 유나이티드', '람푼 워리어스', '우타이 타니', '프라추압 FC', '수코타이 FC', '나콘랏차시마', '농부아 피치야', '라용 FC', '치앙마이 유나이티드']),
        2: ('타이 리그 2', [# 16
            '수판부리', '패 프레 유나이티드', '사뭇 프라칸', '아야타야 유나이티드', '촌부리 FC', 'ตราด(뜨랏 FC)', '치앙마이 FC', '파타야 유나이티드', '람팡 FC', '나콘시 유나이티드', '찬타부리 FC', '카셋사트 FC', '시사켓 유나이티드', '마하사라캄 SBT', '방콕 시티 FC', '수판부리 유스']),
        3: ('타이 리그 3', [# 12
            '부리람 B', '방콕 시티', '송클라 FC', '치앙라이 시티', '사뭇 사콘', '콘캔 유나이티드 B', '핏사눌록 FC', '싱하 치앙라이 유스', '푸켓 명문', '우돈 타니 FC', '사뭇 쁘라깐 시티 B', '빠툼 리저브'])
    },
    '베트남': {
        1: ('V리그 1', [# 14
            '남딘 FC', '하노이 FC', '공안 하노이', '비엣텔 FC(더 콩 비엣텔)', '하이퐁 FC', '베카멕스 빈즈엉', '호앙아인 잘라이', 'FC 호치민 시티', '탄호아 FC', '빈딘 FC', '송람 게안', '홍린 하띤', '꽝남 FC', '다낭 FC']),
        2: ('V리그 2', [# 12
            'PVF-CAND', '빈프억', '바리아 붕따우', '롱안 FC', '후에 FC', '칸호아 FC', '동탑 FC', '동나이 FC', '푸토 FC', '호아빈 FC', '안장 FC', '트레 TP 호치민']),
        3: ('베트남 2부 리그', [# 12
            '하노이 B', '호치민 B', '하이퐁 B', '람동 FC', '지아 딘', '빈 투안', '꼰뚬 FC', '띠엔장 FC', '빈롱 FC', '하이퐁 유스', '남딘 레저브', '꽝남 유스'])
    },
    '코트디부아르': {
        1: ('코트디부아르 리그 1', [# 16
            'ASEC 미모사', '산 페드로', 'AFAD 제카누', 'SC 가뇨아', '레이싱 클럽 아비장', '스텔라 클럽', '부아케 FC', '소아', '스타드 다비장', 'CO 코로고', '리스 사산드라', 'AS 뎅겔레', 'SOL FC', '징구(AS 징구)', '무수 FC', '이아 아비장']),
        2: ('코트디부아르 리그 2', [# 12
            '아상도 하이바', '아그보빌', '우메 FC', '인더스트리얼', 'EF아미엔', '야무수크로 FC', '달로아 FC', '이사아 와지', 'USC 바상', '동부 스타즈', '아프리카 스포르 아비장', '만 FC']),
        3: ('코트디부아르 디비시온 3', [# 12
            'ASEC B', '산 페드로 B', '아비장 시티', '부아케 유나이티드', '코르고 B', '갈로아 레저브', '산드로 유스', '그랑 바상 B', '아비장 유나이티드', '소아 유스', '가뇨아 B', '오디엔네 FC'])
    },
    '말리': {
        1: ('말리 프리미어 디비시온', [# 16
            '스타드 말리앵', '조리바 AC', '레알 바마코', '온즈 크레아퇴르', '블랙 스타즈', 'US페 부구니', '바카리잔', '예일렌 올림픽', 'AS 폴리스 바마코', '코로피나(AS 코로피나)', '빙가 FC', 'US 시카소', '부구니 AC', '디지바 AC', '두구올로피라', 'AFE']),
        2: ('말리 디비시온 1', [# 12
            'CS 두구올로피라', '키타 FC', '라피드 카티', '세구 스타즈', '카이 FC', '아프리카 레일', '통부크투 FC', '가오 유나이티드', '시카소 유나이티드', '바마코 올림픽', '카티 시티', '모프티 스타즈']),
        3: ('말리 리전 리그', [# 12
            '스타드 B', '조리바 B', '바마코 시티', '팀북투 FC', '가오 스타즈', '모프티 FC', '쿨리코로', '키달 FC', '레알 B', '폴리스 레저브', '부구니 B', '카이 유스'])
    },
    '남아프리카공화국': {
        1: ('DSTV 프리미어십', [# 16
            '마멜로디 선다운즈', '올랜도 파이레이츠', '스텔렌보스', '세쿠쿠네 유나이티드', '케이프타운 시티', 'TS 갤럭시', '카이저 치프스', '수퍼스포르트 유나이티드', '골든 화살', '폴로콰네 시티', '치파 유나이티드', '아마줄루', '모로카 스왈로우스', '리차즈 베이', '마게시 FC', '마루모 갈란츠']),
        2: ('모츠세페 챔피언십', [# 16
            '오라클', '프리 스테이트 스타스', 'JDR 스타스', '유니버시티 프리토리아', '바로카', '블랙 레오파즈', '밀포드 FC', '배운즈 유나이티드', '케이프타운 스퍼스', '카스릭 스타즈', '헝그리 라이온스', 'Venda FC', '레알 킹스', '플래티넘 시티 리버스', '투 더 스타즈', '소웨토 시티']),
        3: ('ABC 모츠세페 리그', [# 12
            '밀라노 AFC', '스토니 카스트레', '알렉산드라 유나이티드', '아프리카 스포르팅', '바파나 클루브', '더반 FC', '템비사 클래식', '음푸말랑가 블랙 에이스', '블룸폰테인 셀틱 B', '치파 B', '아마줄루 B', '케이프타운 B']),
        4: ('SAB 지역 디비전', [# 12
            '센트럴 콜레지', '그린 플래시스', '마멜로디 유나이티드', '소웨토 스타스', '클립리버 유나이티드', '음블랑가 FC', '보트샤벨로 FC', '카틀레홍 유나이티드', '선다운즈 유스', '파이레이츠 B', '치프스 유스', '갤럭티카 FC'])
    },
    '뉴질랜드': {
        1: ('뉴질랜드 내셔널 리그', [# 10
            '오클랜드 시티', '웰링턴 올림픽', '이스턴 서버브스', '크라이스트처치 유나이티드', '네이피어 시티', '해밀턴 원더러스', '오클랜드 유나이티드', '서스 AFC', '웨스턴 스프링스', '캐시미어 테크니컬']),
        2: ('노더스 / 센트럴 / 사우더스 리전 리그', [# 16
            '노스 셔', '비라만', '웰링턴 피닉스 리저브', '미라마르 레인저스', '웨스턴 서버브스', '그린 아일랜드', '시드넘', '와이타케레 유나이티드', '베이 올림픽', '매너레와 FC', '피들 와이카토', '멜빌 유나이티드', '던에딘 시티 로얄스', '셀윈 유나이티드', '넬슨 서브스', '페토네 FC']),
        3: ('뉴질랜드 로컬 디비시온', [# 12
            '오클랜드 B', '올림픽 B', '더네딘 시티', '넬슨 서브', '타우랑가', '인버카길', '파머스턴', '로토루아', '유나이티드 B', '서버브스 유스', '네이피어 B', '크라이스트처치 B'])
    },
    '노르웨이': {
        1: ('엘리테세리엔', [# 16
            '보되/글림트', '브란', '몰데', '트롬쇠', '바이킹', '로센보르그', '릴레스트룀', '프레드릭스타드', '스트룀스고드세트', '샤릅스보르그 08', 'KFUM 오슬로', '하마캄', '하우게순', '산데프위에르', '볼레렌가', '오스']),
        2: ('OBOS-리가엔', [# 16
            '스타베크', '송달', '콩스빙에르', '란하임', '스타르트', '모스', '에이거순', '륀', '레반게르', '브뤼네', '라오포스', '소트라', '믈뢴달렌', '산드네스 울프', '호드', '아렌달']),
        3: ('포스트노르드-리가엔', [# 16
            '스케이드', '브라트바그', '그로루드', '스트뢰멘', '트롬스달렌', '플뢰위', '알타', '고우트', '얄룸', '노토덴', '크빅 할덴', '울렌사커/키사', '브란 II', '몰데 II', '바이킹 II', '로센보르그 II']),
        4: ('노르스크 티핑-리가엔', [# 12
            '프림', '피아르드', '스프린트-옐로이', '스포르트클루벤 스프린트', '릴레스트룀 II', '보되/글림트 II', '스타르트 II', '송달 II', '사네스 II', '하우게순 II', '프레드릭스타드 II', '스트룀스고드세트 II'])
    },
    '그리스': {
        1: ('수페르리가 엘라다', [# 14
            'PAOK', 'AEK 아테네', '올림피아코스', '파나시나이코스', '아리스', '라미아', 'OFI 크레테', '아스테라스 트리폴리스', '아트로미토스', '판세라이코스', '볼로스', '키피시아', 'PAS 야니나', '파네톨리코스']),
        2: ('수페르리가 2', [# 16
            '레바디아코스', '칼리테아', '이오니코스', '하니아', '라리사', '마케도니코스', '일리오폴리', '칼라마타', '디아고라스', '에갈레오', '파나차이키', '이라클리스', '조그라포우', '텔리크라티스', '유흐타스', '코자니']),
        3: ('감마 에스니키', [# 12
            '카발라', '아폴론 스미르니스', '프로오데프티키', '에트니코스 피레우스', '파니오니오스', '포스티라스', '일리시아코스', '아오 아요스 니콜라오스', '피에리코스', '도크사 드라마', '판드라마이코스', '코린토스']),
        4: ('그리스 지역 프리미어 리그', [# 12
            '아트로미토스 페이라이우스', '아크라티토스', '타브로스', '판세라이코스 B', 'PAS 야니나 B', '올림피아코스 B', 'PAOK B', 'AEK B', '파나시나이코스 B', '하니아 B', '칼라마타 B', '라리사 B'])
    },
    '루마니아': {
        1: ('리가 1', [# 16
            'FCSB', 'CFR 클루지', '우니베르시타테아 크라이오바', '라피드 부쿠레슈티', '파룰 콘스탄차', '셉시 OSK', '헤르만슈타트', '페트롤룰', '우니베르시타테아 클루지', 'UTA 아라드', '오첼룰 갈라치', '폴리 이아시', '디나모 부쿠레슈티', 'FC 보토샤니', '유니레아 슬로보지아', '글로리아 부저우']),
        2: ('리가 2', [# 16
            'FCU 크라이오바', '볼룬타리', '미오베니', '키아지나', '체아을러울', '코르비눌 훈도아라', 'CSM 레시차', '치크세레다', ' CSA 스테아우아 부쿠레슈티', '슬라티나', '둠브라비차', '메탈로그lobus', '아르제시 피테슈티', '바아 마레', '데이', '슬라티나 B']),
        3: ('리가 3', [# 12
            'FCSB B', '클루지 B', '브라쇼브', '폴리테흐니카 티미쇼아라', '오라데아', '바커우', '클린체니', '지울 페트로샤니', '포레스타 수체아바', '라피드 B', '크라이오바 B', '파룰 B'])
    },
    '슬로바이아': {
        1: ('니케 리가', [# 12
            '슬로반 브라티슬라바', '스파르타크 트르나바', '질리나', 'DAC 두나이스카 스트레다', '포드브레조바', '루조베록', '트렌친', '반스카 비스트리차', '스칼리차', '코시체', '젬플린 미할로브체', '코마르노']),
        2: ('2. 리가', [# 16
            '비온 즐라테 모라브체', '타트란 프레쇼브', '포흐로니에', '페트르잘카', '푸호브', '휴메네', '파르티잔 바르데요브', '포바즈스카 비스트리차', '립토프스키 미쿨라시', '질리나 B', '슬로반 브라티슬라바 B', '즈vol렌', '마우라노', '샤모린', '트레비쇼브', '스피스카 노바 베스']),
        3: ('3. 리가', [# 12
            '니트라', '인테르 브라티슬라바', '센첼', '바르데요브 B', '루조베록 B', '트르나바 B', '세레드', '프리비드자', '루체네츠', '피에스타니', '브라노브', '리마브스카 소보타'])
    },
    '아일랜드': {
        1: ('LOI 프리미어 디비시온', [# 10
            '샴록 로버스', '데리 시티', '세인트 패트릭스 애슬레틱', '보헤미안스', '셸번', '드로에다 유나이티드', '슬라이고 로버스', '골웨이 유나이티드', '워터포드', '던도크']),
        2: ('LOI 퍼스트 디비시온', [# 10
            '코브 램블러스', '웩스퍼드 FC', '브레이 원더러스', '롱퍼드 타운', '핀 하프스', '트리티 유나이티드', '코크 시티', '애슬론 타운', 'UCD(더블린 유니버시티)', '케리 FC']),
        3: ('렌스터 / 먼스터 시니어 리그', [# 12
            '샴록 B', '데리 B', '크럼린 유나이티드', '블루벨 유나이티드', '아본데일 유나이티드', '코크 시티 B', '세인트 케빈스', '말라하이드 유나이티드', '방고르 셀틱', '링마혼 레인저스', '셔우드 보이스', '피카바바'])
    },
    '핀란드': {
        1: ('베이카우스리가', [# 12
            'HJK 헬싱키', 'KuPS 쿠오피오', 'SJK 세이내요키', '일베스 탐페레', 'VPS 바사', 'FC 인테르 투르쿠', 'AC 오울루', 'IFK 마리에함', '하카', 'FC 라티', '그니스탄', 'EIF 에케내스']),
        2: ('위쾨스리가', [# 10
            'KTP 코트카', 'TPS 투르쿠', '야로', 'MP 미켈리', 'SJK B(아카데미아)', '살파', 'PK-35', 'JIPPO', '카파', 'JäPS']),
        3: ('위쾨넨', [# 12
            'HJK B(클루비 04)', 'KuPS B', '일베스 B', 'FC 홍카', 'VIFK', 'OLS', '쿠오피오 엘로', '로바니에미 PS(RoPS)', '에스포', '탬페레 유나이티드', '재즈 포리', '아틀란티스 FC'])
    },
    '조지아': {
        1: ('에로브눌리 리가', [# 10
            '디나모 트빌리시', '디나모 바투미', '이베리아 1999(사부르탈로)', '디라 고리', '토르페도 쿠타이시', '삼구랄리', '가그라', '텔라비', '삼트레디아', '콜헤티 포티']),
        2: ('에로브눌리 리가 2', [# 10
            '슈쿠라 콥레티', '시오니 볼니시', '스파에리', '위트 조지아', '메라니 마르트빌리', '가레지 사가레조', '로코모티프 트빌리시', '딘올라', '아라그비 두셰티', '슈투르미']),
        3: ('리가 3', [# 12
            '디나모 트빌리시 B', '바투미 B', '메라니 트빌리시', '치쿠라 사치케레', '루스타비', '골리', '조지아 FC', '보르조미', '삼구랄리 B', '디라 B', '주그디디', '메샤흐테 트키불리'])
    },
    '알바니아': {
        1: ('카테고리아 수페리오레', [# 10
            '파르티자니 티라나', 'KF 티라나', '에그나티아', '블라즈니아 슈코더르', '디나모 시티', '스켄데르베우', '테우타 두러스', '라치', '바이리스', 'AF 엘바사니']),
        2: ('카테고리아 에 파르', [# 12
            '에르제니', '쿠커시', '플라무르타리', '아폴로니아', '코라비', '토모리', '루쉬냐', '베사 카바여', '보라', '카스트리오티', '부트린티', '루프테타리']),
        3: ('카테고리아 에 디두', [# 12
            '티라나 B', '파르티자니 B', '포그라데치', '테펠레나', '쉬쿰비니', '벨레치쿠', '아드리아티쿠', '나프테타리', '마무라시', '히마라', '데볼리', '그라모지'])
    },
    '북마케도니아': {
        1: ('마케도니아 프르바 리그', [# 12
            '스트루가 트림-럼', '스켄디야', '실렉스', '슈쿠피', '라보트니치키', '바르다르 스코페', '티크베시', '브레갈니차', '고스티바르', '보스카 스포르트', '브레이라 시티(AP 판데프)', '마케도니야 GP']),
        2: ('마케도니아 브토라 리그', [# 16
            '벨라시차', '펠리스테르', '포베다', '스코페 FC', '테텍스', '오흐리드', '코주프', '사사', '노바치', '바시미', '데토니트 플라치코비차', '아르시미', '카라오르만', '바르다르 네고티노', '오소고보', '바스코에']),
        3: ('마케도니아 트레타 리그', [# 12
            '바르다르 B', '스켄디야 B', '티베리야', '쿠마노보', '로코모티프 스코페', '고스티바르 B', '슈쿠피 B', '실렉스 B', '말레시', '나프레도크', '도이란 스타즈', '크리바 팔랑카'])
    },
    '아이슬란드': {
        1: ('베스타 데일드 나이아', [# 12
            '비킹구르 레이캬비크', '발루르', '브레이다블리크', '스탸르난', 'FH 하프나르피외르두', 'KR 레이캬비크', 'KA 아쿠레이리', 'HK 코파보구르', '프람 레이캬비크', '필키르', 'IA 아크라네스', '베스트리']),
        2: ('렝주 데일딘', [# 12
            'IBV 베스트만나에이얄', '케플라비크', '그린다비크', '토르 아쿠레이리', '피외르니르', '아프투레르딩', '그로타', '레크니르 레이캬비크', '니얄드비크', 'IR 레이캬비크', '달비크/레이니르', '트로투르 레이캬비크']),
        3: ('2. 데일드 카를라', [# 12
            '하우카르', '셀포스', '쓰로투르 보가르', 'KF 피어르다빅', '레이니르 산드게르디', '볼룬가르비크', '쉰드라이', '후기니', 'Höttur', 'KFA', 'Völsungur', 'Ægir'])
    },
    '몬테네그로': {
        1: ('몬테네그로 프르바 리그', [# 10
            '부두치노스트 포드고리차', '수체스카 닉시치', '데치치', '아르세날 티밧', '예디닌스트보', '페트로바츠', '모르나르 바르', '보켈리', '오트란트-올림픽', '예제로 플라브']),
        2: ('몬테네그로 브토라 리그', [# 10
            '믈라도스트 DG', '루다르 플레블랴', '이스크라 다닐로브그라드', '제타 고', '코모 포드고리차', '이가로', '베라네', '포드고리차 FC', '그르발리', '로브첸 체티네']),
        3: ('몬테네그로 트레차 리그', [# 24
            '체티네', '첼릭 닉시치', '자블랴크', '구신예', '드레스노비치', '이블바르', '구스리', '플레블랴 1997', '부두치노스트 B', '수체스카 B', '바르 B', '티밧 B', 'Sloga Bar', 'Sloga Radovići', 'Hajduk Bar', 'Crno Jezero', 'Fair Play', 'Petnjica', 'Borac Bijelo Polje', 'Polimlje', 'Brskovo', 'Karioke', 'Ribnica', 'Olympico'])
    },
    '북아일랜드': {
        1: ('NIFL 프리미어십', [# 12
            '린필드', '클리프턴빌', '란 FC', '크루세이더스', '글렌토런', '콜레인', '밸리메나 유나이티드', '글레나본', '던개넌 스위프츠', '카릭 레인저스', '로프골', '포타다운']),
        2: ('NIFL 챔피언십', [# 12
            '뉴리 시티', '발리클레어 컴페니언스', '뱅거 FC', '인스티튜트 FC', 'HW 웰더스', '던엘라', '아즈 오 마', '리마바디 유나이티드', '발리마니 시티', '더그비', '애즈 유나이티드', '녹브레다']),
        3: ('NIFL 프리미어 중간 리그', [# 14
            '모욜라 파크', '토버모어', '퀸즈 유니버시티', '아마 시티', '밴브리지 타운', '포트스튜어트', '도네갈 셀틱', '루간 셀틱', '스트랩배인', '리버사이드', 'Coagh United', 'Lisburn Distillery', 'Dollingstown', 'Rathfriland Rangers'])
    },
    '이스라엘': {
        1: ('이스라엘 프리미어리그', [# 14
            '마카비 하이파', '마카비 텔아비브', '하포엘 베르셰바', '마카비 네타냐', '하포엘 예루살렘', '베이타르 예루살렘', '마카비 페타티크바', '하포엘 하이파', '마카비 브네이 라이나', '하포엘 하데라', 'MS 아슈도드', '브네이 사크닌', '이로니 티베리아스', '이로니 키리야트 슈모나']),
        2: ('리가 레우미트', [# 16
            '하포엘 텔아비브', '하포엘 람마트간', '마카비 헤르츨리야', '하포엘 움 알-파헴', '하포엘 크파르 사바', '하포엘 아코', '마카비 자우라', '하포엘 리current 레시온', '하포엘 노프 하갈릴', '하포엘 아풀라', '마카비 카빌리오 자파', '하포엘 헤르츨리야', '하포엘 크파르 샬렘', '이로니 네스 지오나', '하포엘 라아나나', 'SC 카프르 카심']),
        3: ('리가 알레프', [# 32
            '디모나', '티라', '심손 텔아비브', '마카비 샤라임', '하포엘 마르모레크', '하포엘 호드 하샤론', '이로니 모디인', '마카비 야브네', '하포엘 브네이 로드', '마카비 아키 나자렛', '하포엘 미그달 하에메크', '마카비 아쉬도드', '하포엘 부에인', '하포엘 가르비야', '하포엘 아줄', '하포엘 로드', '마카비 키리야트 말라키', '체이레 타이브', '마카비 이로니 아미샤브', '하포엘 브네이 잘라파', '하포엘 카우카브', '마카비 아타 비아릭', '체이레 움 알 파헴', '마카비 네베 샤난', '하포엘 하카티아', '하포엘 비카트 하야르덴', '심손 카프르 카심', '하포엘 키리야트 오노', '마카비 타이브', '이로니 네셰르', '하포엘 칸나', '마카비 브네이 자디다'])
    },
    '불가리아': {
        1: ('파르바 리그', [# 16
            '루도고레츠 라즈그라드', 'CSKA 소피아', '레프스키 소피아', '체르노 모레', '로코모티프 플로브디프', 'CSKA 1948', '보테프 플로브디프', '베로에', '로코모티프 소피아', '보테프 브라차', '헤바르 파자르지크', '크루모브그라드', '슬라비아 소피아', '아르다 커르잘리', '스파르타크 바르나', '셉템브리 소피아']),
        2: ('브토라 리그', [# 20
            '피린 블라고에브그라드', '에타르 벨리코 타르노보', '도브루드자 도브리치', '몬타나', '얀트라 가브로보', '스트루마 스라바', '스보게', '스파르타크 플레벤', '미뇨르 페르니크', 'CSKA 소피아 B', '루도고레츠 B', '보테프 B', '프라브다 레프스키', '두나브 루세', '벨라시차 페트리치', '네세바르', '로코모티프 고르나', '마렉 두프니차', '프라디즈라브', '스포르티스트 스보게']),
        3: ('트레타 리그', [# 18
            '레프스키 B', '슬리벤', '하스코보', '체르노모레츠 부르가스', '네프토치미크 부르가스', '비흐렌 산단스키', '소조폴', '파블리케니', '세블리에보', '스파르타크 플로브디프', '마리차 플로브디프', '베라스라 차르', '디미트로브그라드', '로도파 스몰랸', '보테프 일흐티만', '슬리브니슈키 게로이', '릴스키 스포르티스트', '발칸 보테브그라드'])
    },
    '룩셈부르크': {
        1: ('룩셈부르크 내셔널 디비시온', [# 16
            'F91 뒤들랑주', '스위프트 에스페랑주', '프로그레스 니더코른', '디페르당주 03', '죄네스 에슈', '레이싱 유니온', 'UNA 슈트라센', '몬도르프-레-뱅', '유니온 티투스 페탕주', '빌츠 91', '빅토리아 로스포르트', '호스페르트', '베거', '폴라 에슈', '베텔렘보르크', '로당주 91']),
        2: ('룩셈부르크 에렌프롬오시온', [# 14
            '에첼라 에텔브루크', '마리스카 메르시', '쉬플랑주 95', '그레벤마허', '매메르 32', '루멜랑주', '알리센티아 베르당주', '로렌츠바일러', '카에렝 97', '디키르히', '비올츠 스타즈', '메데르나흐', '쾨를리히', '발도르프']),
        3: ('룩셈부르크 1. 디비시온', [# 28
            '에슈 FC', '융린스터', '샌드바일러', '케렌츠', '비블스베르크', '샤이펜 95', '오버코른', '클레르보', '메디치 91', '뒤들랑주 B', '스위프트 B', '몬도르프 B', 'Bastendorf', 'Bourscheid', 'Colmar-Berg', 'Feulen', 'Heiderscheid', 'Lintgen', 'Merscheid', 'Pratzerthal', 'Schieren', 'Wincrange', 'Berdorf Consdorf', 'Biwer', 'Cebra', 'Itzig', 'Remich', 'Schengen'])
    },
    '아르메니아': {
        1: ('아르메니아 프리미어리그', [# 11
            '퓨니크 예레반', '우라르투', '알라슈케르트', '아라라트-아르메니아', '아라라트 예레반', '노아 FC', '시라크', '반 FC', '웨스트 아르메니아', '간자사르 카판', 'BKMA 예레반']),
        2: ('아르메니아 퍼스트 리그', [# 12
            '퓨니크 II', '우라르투 II', '알라슈케르트 II', '아라라트 II', '노아 II', '반 II', '시라크 II', '아라라트-아르메니아 II', '시카 에레반', '린도브 아르메니아', '에레부니', '안도니크']),
        3: ('아르메니아 리전 리그', [# 12
            '예레반 시티', '규므리 FC', '바나조르', '로리 FC', '아르마비르', '세반 FC', '딜리잔 FC', '코태크 아보비안', '아쉬타라크', '퓨니크 유스', '카판 유나이티드', '에레반 스타즈'])
    },
    '벨라루스': {
        1: ('벨라루스 프리미어리그', [# 16
            '디나모 민스크', '네만 그로드노', '토르페도 조디노', 'BATE 보리소프', '샤흐타르 솔리그로스크', '디나모 브레스트', '이슬로치', '슬루츠크', '고멜', '민스크 FC', '슬라비아 모지르', '아르세날 드제르진스크', '비텝스크', '나프탄 노보폴로츠크', '스모르곤', '드네프르 모길레프']),
        2: ('벨라루스 퍼스트 리그', [# 18
            '에네르게티크-BGU', '벨시나 보브루이스크', '로코모티프 고멜', '리다', '오르샤', '바라노비치', '몰로데치노 2018', '볼나 핀스크', '오스트로베츠', '슬로님 2017', '맥스라인 비텝스크', '니바 돌비즈노', 'BATE 보리소프 B', '디나모 민스크 B', '토리페도 조디노 B', '고멜 B', '샤흐타르 B', '민스크 리저브']),
        3: ('벨라루스 세컨드 리그', [# 32
            '네만 B', '슬루츠크 B', '파르티잔 솔리그로스크', '크루름카치 민스크', '스파르타크 슈클로우', '스타르트 오르샤', '레치차 2014', '오시포비치', '비크토리아 마리나 고르카', '가조비크 비텝스크', 'FC DMedia', 'FC Kolos', 'Stanles Pinsk', 'MNK Minsk', 'FC Gorki', 'FC Gazovik', 'FC Polotsk', 'FC Postavy', 'FC Miory', 'FC Lepel', 'FC Senno', 'FC Slavgorod', 'FC Krasnopolie', 'FC Klichev', 'FC Kirovsk', 'FC Kostyukovichi', 'FC Khotimsk', 'FC Mstislavl', 'FC Chaussy', 'FC Cherikov', 'FC Krugloe', 'FC Dribin'])
    },
    '몰도바': {
        1: ('몰도바 수페르리가', [# 8
            '셰리프 티라스폴', '페트로클루브 힌체슈티', '밀사미 오르헤이', '지브루 키시너우', 'CSF 발차니', '다시아 부이우카니', '스파르타 셀레메트', 'FC 플로레슈티']),
        2: ('몰도바 리가 1', [# 12
            '디나모-아우토', '빅토리아 키시너우', '스페란차 드로키아', '이스크라 리브니차', 'FCM 웅게니', '올림프 콤라트', '삭산', '셰리프 II', '수클리아', '레알 수치아', '팔레스티 몰도바', '유니베르 코마트']),
        3: ('몰도바 리가 2', [# 24
            '카훌 2005', '싱게레이', '에디네츠', '밀사미 B', '지브루 B', '티라스폴 시티', '콤라트 B', '발차니 B', '바사라베아스카', '크리올레니', '드로키아 유스', '스보보다', 'FC Barsa', 'FC Congaz', 'FC Maiak', 'FC Slobozia Mare', 'FC Stauceni', 'FC Sucleia B', 'FC Visoca', 'FC Vulturii', 'FC Grniceri', 'FC Inter Soroca', 'FC Pepeni', 'FC Rscani'])
    },
    '리투아니아': {
        1: ('A 리가', [# 10
            '잘기리스 빌뉴스', 'FK 파네베지스', '헤겔만', '카우노 잘기리스', '수두바', '시아울리아이', '방가 가르주다이', '디나바 알리투스', '트란스인베스트', 'FK 리테리아이']),
        2: ('I 리가', [# 16
            '네베지스', '요나바', '미니야', '네프투나스 클라이페다', '바브룽가스', '에크라나스', '타우라스', '벨사', '잘기리스 B', '시아울리아이 B', '카우노 잘기리스 B', '파네베지스 B', '가르주다이 B(방가 B)', '리테리아이 B', '트란스인베스트 B', '헤겔만 B']),
        3: ('II 리가', [# 16
            '수두바 B', '우테니스', '스베이카타', '실루테', '빌뉴스 시티', '디나바 B', '포르투나 카우나스', '클라이페다 FM', '사네지아 빌뉴스', '유벤투스', 'FK 데메브라', 'FK 비엔티베', 'FK 자이바스', 'FK 그라니타스', 'FK 시르벤타', 'FK 아테티스'])
    },
    '라트비아': {
    1: ('라트비아 비르스리가', [# 10
        'RFS', '리가 FC', '발미에라 FC', '아우다', '리에파야', '옐가바', '투쿠므스 2000', '메타', '그로비냐', '다우가브필스']),
    2: ('라트비아 1.리가', [# 14
        '슈페르 노바', 'Skanste', '레제크네', 'JDFS 알베르츠', '스밀테네', '마루페', 'Ogre United', '리가 FC II', 'RFS II', '발미에라 II', '투쿠므스 II', '다우가브필스 II', '메타 II', '아우다 II']),
    3: ('라트비아 2.리가', [# 16
        '살라스필스', '카로스타', '케카바', '림바지', '바비테', '스타이첼레', '프레일리', '굴베네', 'FC 가우야', 'Jelgava II', 'Alberts II', 'FK 스타이첼스 베브리', 'FK 리에파야 II', 'FC 디나모 리가', 'FK 탈시', 'FK 마도나'])
    },
    '에스토니아': {
        1: ('메이스트릴리가', [# 10
            '플로라 탈린', '레바디아 탈린', '넘메 칼류', '파이데 린나메스콘드', '칼레브 탈린', '쿠레사레', '타메카 타르투', '바프루스 패르누', '넘메 유나이티드', '나르바 트랜스']),
        2: ('에시리가', [# 10
            '비임시', '엘바', '패르누 JK', '타르투 웰코', '탈린나 칼레브 II', '플로라 II', '레바디아 U21', '파이데 II', '타바살루', '하리우 JK']),
        3: ('에시리가 B', [# 10
            '라네마', '실라마에 칼레브', '쿠레사레 II', '타메카 II', '피닉스 조흐비', '나르바 트랜스 B', '빌리안디 투레빅', '라플라마', '레바디아 U19', '넘메 칼류 II'])
    },
    '안도라': {
        1: ('프리메라 디비시온', [# 10
            '아틀레틱 클럽 데스칼데스', '인터 클럽 데스칼데스', 'FC 산타콜로마', 'UE 산타콜로마', '페냐 엥카르나다', '오르디노', '파스 데 라 카사', 'FC 랑헤르스', '라 마사나', 'FS 라 마사나']),
        2: ('세군다 디비시온', [# 8
            '엔캄', '렝게르스 안도라', '산트 줄리아', '카릴 B', '카니요', '피스 칼데스', 'UE 산타콜로마 B', 'FC 안도라 B']),
        3: ('안도라 아마추어 리그', [# 12
            '레스 보네스', '레 에스칼데스', '도 이요', '산트 줄리아 B', '페냐 B', '마사나 B', '파스 데 라 카사 B', '안도라 라 벨랴', '세인트 조셉', '루시타노스 レ전드', '카니요 B', '스포르팅 안도라'])
    },
    '산마리노': {
        1: ('캄페오나투 산마리네세', [# 16
            '트레펜네', '코스모스', '라 피오리타', '비르투스', '리베르타스', '트레 피오리', '유베네스-도가나', '무리타', '피오렌티노', '산 조반니', '도마냐노', '페냐로사', '카일룽고', '폴고레', '파에타노', '산마리노 아카데미 U22']),
        2: ('산마리노 A2 티어', [# 12
            '세라발레 시티', '볼고 마조레', '도마냐노 레저브', '파에타노 유스', '피오렌티노 B', '무리타 B', '코스모스 유스', '리베르타스 유스', '산 조반니 B', '카일룽고 B', '페냐로사 B', '비르투스 유스']),
        3: ('산마리노 리저브 디비시온', [# 12
            '트레펜네 B', '코스모스 B', '라 피오리타 B', '비르투스 B', '리베르타스 B', '트레 피오리 B', '도마냐노 B', '폴고레 B', '유베네스 B', '무리타 C', '파에타노 B', '산마리노 아카데미 B'])
    },
    '요르단': {
        1: ('요르단 프로리그', [# 12
            '알 웨흐다트', '알 파이살리 암만', '알 후세인 이르비드', '알 가이시 요르단', '알 라므사', '샤바브 알 오르돈', '아카바 클럽', '알 자지라 암만', '알 사리흐', '알 아흘리 암만', '마안 클럽', '사합 클럽']),
        2: ('요르단 1부 리그', [# 14
            '알 바카', '알 이티하드 요르단', '알 하워스', '쿠프르 솜', '알 토라', '블라마', '알 아라비 이르비드', '사마 알 사르한', '옴란 시티', '알 에르묵', '예르무크 암만', '알 얄릴', '암만 FC', '알 하셰미야']),
        3: ('요르단 2부 리그', [# 16
            '이르비드 시티', '자르카 FC', '암만 스타즈', '마프라끄', '아즐룬', '알 무로스', '카라크 FC', '타필라', '알 웨흐다트 B', '알 파이살리 B', '후세인 B', '라므사 B', '구르 사피', '와디 알 시르', '알 샴말', '데우르 알라'])
    },
    '바레인': {
        1: ('바레인 프리미어리그', [# 12
            '알 킬디야', '알 무하라크', '알 리파', '알 아흘리 마나마', '마나마 클럽', '알 샤바브 마나마', '싯트라 클럽', '이스트 리파', '알 할라', '부사이틴', '말키야', '바레인 클럽']),
        2: ('바레인 2부 리그', [# 12
            '알 하이드', '이싸 시티', '알 타다문 바레인', '칼랄리', '부디야 클럽', '알 네즈마', '이트하드 리파', '예르묵 바레인', '마카바', '함드 시티', '삼라 클럽', '우무 알 하삼']),
        3: ('바레인 리저브 리그', [# 12
            '무하라크 B', '리파 B', '킬디야 B', '마나마 시티', '무하라크 스타즈', '알 아흘리 B', '부사이틴 B', '하이드 B', '이스트 리파 B', '샤바브 B', '할라 B', '네즈마 B'])
    },
    '인도네시아': {
        1: ('리가 1', [# 18
            '보르네오 FC', '페르시브 반둥', '발리 유나이티드', '페르시자 자카르타', 'PSM 마카사르', '페르세바야 수라바야', 'PSIS 스마랑', '데와 유나이티드', '페르시크 케디리', '바리토 푸트라', '페르시스 솔로', '페르시타 탕에랑', '아레마 FC', 'PSS 슬레만', '말루트 유나이티드', 'PSBS 비악', '세멘 파당', '마두라 유나이티드']),
        2: ('리가 2', [# 24
            '란스 누산타라', '페르시푸라 자야푸라', '델트라스', '그레시크 유나이티드', '페르셀라 라몽간', '스리위자야 FC', 'PSMS 메단', '치마히 시티', '퍼르시라자 반다 아체', '벡스 풋볼', '페르시파 파티', '누산타라 유나이티드', '바양카라 FC', '페르시카보 1973', '페르시쿠스 쿠두스', '프레시도 자카르타', '페르시카시 브카시', '페르시코타 탕에랑', '아달 하이 부트라', '페르시파니 파니아이', '페르시보 보조네고로', '페르세와 자야푸라', 'PSKC 치마히', '숙룬 시티']),
        3: ('리가 3', [# 24
            '반둥 유나이티드', '자카르타 시티', '수라바야 FC', '마카사르 B', '발리 스타즈', '치레본 FC', '솔로 FC', '페르시포 프롤링고', '페르시디 이디', 'Nz리스 반둥', '퍼르세방기 산와', 'PSIW 워노소보', '페르세카브 반둥', 'PSGC 치아미스', '페르시푸라 리저브', '페르시크 유스', '페르세라 위라', '페르시발 자카르타', 'PS 바탐', '페르시클로 발리', '페르시람 유스', 'PS 타파눌리', '페르세판 마두라', '페르세바랑 스마랑'])
    },
    '말레이시아': {
        1: ('말레이시아 슈퍼리그', [# 13
            '조호르 다룰 탁짐', '셀랑오르 FC', '트렝가누 FC', '사바 FC', '쿠알라룸푸르 시티', '케다 다룰 아만', '페락 FC', '스리 파항', '쿠칭 시티', '느그리 슴빌란', 'PDRM FC', '페낭 FC', '켈란탄 다룰 나임']),
        2: ('말레이시아 M3 리그', [# 12
            '이미그레센 FC', '하리마우 FC(하리마우 무다)', '사임 다비', '부킷 잘릴', '멜라카 FC', '암드 포스 FC', '유아이티엠 FC', '사라왁 유나이티드', '켈란탄 FC', '쿠알라룸푸르 로버스', '마차 시티', '보르네오 로버스']),
        3: ('말레이시아 M4 리그', [# 12
            'JDT II', '셀랑오르 II', '쿠알라룸푸르 B', '말라카 시티', '이포 FC', '페낭 B', '쿠칭 유나이티드', '조호르 스타즈', '트렝가누 B', '사바 리저브', '페락 B', '케다 유스'])
    },
    '싱가포르': {
        1: ('싱가포르 프리미어리그', [# 9
            '라이언 시티 세일러스', '알비렉스 니가타 싱가포르', '탐파인스 로버스', '게일랑 인터내셔널', '발레스티어 칼사', '후강 유나이티드', '탄종 파가', '영 라이온즈', '브루나이 DPMM']),
        2: ('싱가포르 풋볼 리그 1', [# 10
            '워리어스 FC', '홈 유나이티드 B(비프로스트)', '싱가포르 크리켓 클럽', '티옹 바루', '유슌 센트럴', '사우스우드', '프로젝트 5-O', '스포르팅 싱가포르', '카틀레홍 유나이티드', '싱가포르 레크리에이션 클럽']),
        3: ('SFL 디비시온 2', [# 12
            '라이언 시티 B', '탐파인스 B', '게일랑 B', '후강 B', '우드랜드 웰링턴', '주롱 FC', '셈바왕 레인저스', '클레멘티', '탄종 파가 B', '발레스티어 B', '앙 모 키오', '베독 유나이티드'])
    },
    '몽골': {
        1: ('몽골 내셔널 프리미어리그', [# 10
            'FC 울란바토르', '데런 FC', '한가리드', 'SP 팔콘스', '울란바토르 시티', '호롬혼 FC', '바바리아라즈(바양골)', '에르침', '일치 FC', '바바리안스']),
        2: ('몽골 퍼스트 리그', [# 10
            'BCH 라이온스', '투브 부가누드', '울란바토르 레전즈', '에르침 II', '셀렝게 프레스', '렝게르 몽골', '다르한 FC', '에르덴트', '홉드 FC', '포워드 울란바토르']),
        3: ('몽골 세컨드 리그', [# 12
            '울란바토르 B', '데런 B', '고비 스타즈', '초이발산', '무룬 FC', '하라호름', '날라이흐', '바가누르', '팔콘스 B', '한가리드 B', '수흐바타르', '자브한'])
    },
    '홍콩': {
        1: ('홍콩 프리미어리그', [# 10
            '키치 SC', '리만 FC', '동방 축구단', '홍콩 레인저스', '남구 축구단(관당)', '타이포 FC', '홍콩 FC', '자원(주하이)', '노스 디스트릭트', '골프토 홍콩']),
        2: ('홍콩 갑조리그', [# 12
            '남화 체육회', '유안랑', '윙이', '샤틴', '시티즌 FC', '해양', '키치 B', '중서구 축구단', '가오룽 시티', '해피 밸리', '콰이청', '동구 축구단']),
        3: ('홍콩 을조리그', [# 12
            '동방 B', '레인저스 B', '구룡성', '츈완', '툰문', '완차이', '럭키 스타즈', '삼수이포 B', '가오룽성 B', '사우이반', '서구 축구단', '남구 B'])
    },
    '북한': {
        1: ('최고급축구련맹전', [# 12
            '4.25체육단', '압록강체육단', '평양체육단', '기관차체육단', '려명체육단', '소백수체육단', '선봉체육단', '월미도체육단', '제비체육단', '림명수체육단', '횃불체육단', '경공업성체육단']),
        2: ('1부류축구련맹전', [# 12
            '체비에체육단', '자강도체육단', '함경북도체육단', '황해남도체육단', '평안북도체육단', '양강도체육단', '함경남도체육단', '평안남도체육단', '황해북도체육단', '강원도체육단', '4.25 B', '평양 B']),
        3: ('2부류축구련맹전', [# 12
            '압록강 B', '기관차 B', '원산체육단', '청진체육단', '함흥체육단', '신의주체육단', '남포체육단', '강계체육단', '려명 B', '소백수 B', '선봉 B', '월미도 B'])
    },
    '피지': {
        1: ('디지셀 프리미어리그', [# 10
            '라우토카 FC', '레바 FC', '수바 FC', '바 FC', '나디 FC', '라바사 FC', '나드로가', '타이레부 나이타시리', '나부아 FC', '나시누 시티']),
        2: ('피지 시니어 리그', [# 12
            '사부사부', '타베우니', '락락', '시가토카', '바누아 레부', '수바 리저브', '라 스타즈', '바누아 레부 유나이티드', '타부아 FC', '라키라키', '바 B', '나누쿠 FC']),
        3: ('피지 로컬 디스트릭트 리그', [# 12
            '라우토카 B', '레바 B', '수바 B', '코로보보', '나부아 B', '로토카 스타즈', '나디 B', '라바사 B', '나드로가 B', '나시누 B', '타이레부 B', '라키라키 B'])
    },
    '슬로베니아': {
        1: ('프르바리가', [# 10
            'NK 마리보르', '올림피야 류블랴나', '셀레', '코페르', '돔잘레', '무라', '브라보', '라도믈리에', '나프타 렌다바', '프리모리에']),
        2: ('2. SNL', [# 16
            '고리차', '트리글라브 크란', '알루미니이', '타보르 세자나', '벨레녜(루다르 벨레녜)', '비스트리차', '크르카', '일리지야', '톨민', '드라비냐', '빌리에', '벨트인치', '슬로반 류블랴나', '드라바 프투이', '브레지체', '야르드란 데카니']),
        3: ('3. SNL', [# 12
            '마리보르 B', '올림피야 B', '이졸라', '센추르', '크란 B', '포드빈치', '도브', '쉬엔추르', '크르스코', '자호리에', '비하치', '슬로벤스카 비스트리차 B'])
    },
    '카자흐스탄': {
        1: ('카자흐스탄 프리미어리그', [# 12
            '오르다바시', '아스타나 FC', '악토베', '카이라트 알마티', '토볼', '키질자르', '아티라우', '샤흐타르 카라간디', '제티수', '투란', '엘리마이(코크셰타우)', '카이사르']),
        2: ('카자흐스탄 퍼스트 리그', [# 12
            '옥제트페스', '카스피이', '악수', '카이라트 자스', '아스타나 II', '한 텡그리', '타라즈', '에키바스투즈', '악자이이크', '알타이 동카자흐스탄', '아리스 FC', '울루타우']),
        3: ('카자흐스탄 세컨드 리그', [# 12
            '오르다바시 B', '악토베 B', '알마티 스타즈', '심케트 FC', '파블로다르(이르티시 파블로다르)', '타라즈 B', '세메이 FC', '토볼 B', '카이사르 B', '아티라우 B', '샤흐타르 B', '제티수 B'])
    },
    '케냐': {
        1: ('케냐 프리미어리그', [# 16
            '고어 마히아', '투스커 FC', 'AFC LEOPARDS(레오파드)', '케냐 경찰청(포리스)', '반다리 FC', '카카메가 홈보이즈', '나이로비 시티 스타즈', '샤바나 FC', '포스타 레인저스', '비디코 골드', '카리오방기 샤크스', '머루 유나이티드', 'FC 탈란타', '소파카 FC', '무호로니 유스', '우린지 스타즈']),
        2: ('케냐 슈퍼리그', [# 16
            '와지토(무호로니 유나이티드)', '비히가 불릿츠', '키수무 알루포', '모바사 스타즈', '나쿠루 FC', '엘도레트', '마타레 유나이티드', '나이바샤 시티', '키수무 올 스타즈', '물리 FC', '딤바 스타즈', '구시 FC', '레인보우 FC', '루와카 슛츠', '코스트 스타즈', '나이로비 유나이티드']),
        3: ('케냐 디비시온 원', [# 12
            '고어 마히아 B', '투스커 B', '레오파드 B', '키수무 시티', '티카 FC', '니에리 FC', '말린디', '로드와', '가리사 스타즈', '몸바사 B', '나쿠루 스타즈', '비히가 유나이티드'])
    },
    '앙골라': {
        1: ('지라볼라', [# 12
            '페트루 아틀레티쿠', '프리메이루 드 아고스투', '사그라다 에스페란사', '인테르클루브', '와하 도 우이헤', '브라보스 도 마키스', '데포르티보 루안다(루안다 시티)', '데포르티보 후일라', '아카데미카 도 로비토', '레크레아티보 도 리볼로', '스포르팅 드 카빈다', '윌리에테 드 벵겔라']),
        2: ('지라볼라 2부', [# 12
            '프롱크 스포르트', '벵겔라 FC', '우암보(페로비아리오 우암보)', '말란헤(유니온 말란헤)', '카빈다 스타즈', '사우리스모 FC', '루방고 스타즈', '소요 FC', '숨베 시티', '모시코 FC', '쿠방고 FC', '남베 FC']),
        3: ('앙골라 프로빈셜 리그', [# 12
            '페트루 B', '아고스투 B', '로비토 B', '나미베 FC', '루방고', '숨베', '우암보 스타즈', '리볼로 B', '인테르 B', '마키스 B', '우이헤 유스', '말란헤 B'])
    },
    '잠비아': {
        1: ('잠비아 슈퍼리그', [# 16
            'ZESCO 유나이티드', '파워 다이너모스', '엔카나 FC', '레드 애로우즈', '그린 버팔로스', '카브웨 워리어스', '자나코 FC', '무풀리라 원더러스', '포레스트 레인저스', '냅사 스타즈', '은창가 레인저스', '그린 이글스', 'FC 무자', '치파타 유나이티드', '루무완스 라디에이츠', '콘콜라 블레이즈']),
        2: ('잠비아 내셔널 퍼스트 리그', [# 12
            '리빙스턴 파이러츠', '키트웨 유나이티드', '은콰지 FC', '프라이즌 LEOPARDS', '찬사 시티', '은도니 스타즈', '카프에 셀틱스', '루사카 다이너모스', '무풀리라 블랙풀', '곰베 시티', '은도라 스타즈', '마운틴 스타즈']),
        3: ('잠비아 디비시온 원', [# 12
            'ZESCO B', '파워 B', '엔카나 B', '루사카 시티', '은돌라 FC', '리빙스턴 시티', '칭골라', '카라마', '화살 B', '버팔로스 유스', '워리어스 B', '자나코 B'])
    },
    '러시아': {
        1: ('러시아 프리미어리그', [# 16
            '제니트', '크라스노다르', '디나모 모스크바', '로코모티프 모스크바', '스파르타크 모스크바', 'CSKA 모스크바', '루빈 카잔', '로스토프', '크릴리아 소베토프', '아흐마트 그로즈니', '우랄', '오렌부르크', '파켈 보로네시', '파리 NN', '힘키', '디나모 마하치칼라']),
        2: ('러시아 퍼스트 리그', [# 16
            '아크론 톨리아티', '아르세날 툴라', '로디나 모스크바', '예니세이', '신니크', '토페도 모스크바', '볼가르 아스트라한', '캄차카 시티', '소치', '발티카 칼리닌그라드', '우랄 B', '체르노모레츠 노보로시스크', '네프테히미크', '스카-하바롭스크', '로토르 볼고그라드', '우파']),
        3: ('러시아 세컨드 리그 A', [# 12
            '안지 마하치칼라', '톰 톰스크', '볼가 울리야노프스크', '이르티시 옴스크', '디나모 브랸스크', '첼라빈스크', '시베리아 노보시비르스크', '벨로그로드', '벨레스 모스크바', '무롬', '크라스노다르-2', '로디나-2']),
        4: ('러시아 세컨드 리그 B', [# 12
            '암카르 페름', '사투른 라멘스코예', '스파르타크 날치크', '텍스틸라크 이바노보', '노스타 노보트로이츠크', '토페도 블라디미르', '제니트-2', '스파르타크-2 모스크바', '루빈-2', '디나모-2 모스크바', '에스트렐라', '사할린'])
    },
    '코소보': {
        1: ('코소보 수페르리가', [# 10
            '발카니', '드리타', '프리슈티나', '질라니', '라피', '두카지니', '페로니켈리', '말리셰바', '수바 레카', '페리자이']),
        2: ('코소보 퍼스트 리그', [# 12
            '트렙차 89', '블라즈nia(포조란)', '리리아 이 프리즈레닛', '우우카(부슈트리아)', '플라무르타리', '이스토구', '비티아', '코소바 VR', '트렙차 미트로비차', '울피아나', '디나모 페리자이', '오니릭스']),
        3: ('코소보 세컨드 리그', [# 12
            '베사 페야', '미나토리', '레페치', '샤리', '텔레코미', '더다니아', '오보릴리', '카스트리오티', '발카니 B', '드리타 B', '프리슈티나 B', '라피 B'])
    },
    '아제르바이잔': {
        1: ('아제르바이잔 프리미어리그', [# 10
            '카라바흐', '네프트치 바쿠', '사바흐', '지라', '숨가이트', '사바일', '투란 토부즈', '카파즈', '아라즈 나흐치반', '샤마키']),
        2: ('아제르바이잔 퍼스트 디비전', [# 12
            '가발라', '자가탈라', '가라다흐', '모익 바쿠', '밍게체비르', '임스리', '디나모 바쿠', '아프토모빌리스트', '카라바흐 B', '사바흐 B', '네프트치 B', '지라 B']),
        3: ('아제르바이잔 세컨드 디비전', [# 12
            '샤흐다그 구사르', '바쿠 FC', '하자르 렌코란', '게벨레 유스', '고야잔', '에너지틱', '시르반', '밀 카라바흐', '사바일 B', '투란 B', '샤마키 B', '레릭 FC'])
    },
    '지브롤터': {
        1: ('지브롤터 내셔널리그', [# 11
            '링컨 레드 임프스', '세인트 조셉스', '브루노스 마그파이스', '유로파 FC', '몬스 칼페', '글라시스 유나이티드', '맨체스터 62', '유로파 포인트', '리온스 지브롤터', '컬리지 1975', 'FC 보카 지브롤터']),
        2: ('지브롤터 디비전 2', [# 12
            '하운드 독스', '스포르팅 지브롤터', '레알 가드', '지브롤터 스키프', '웨스트 엔드', '리덕스 FC', '칼페 유나이티드', '바스티온 FC', '록 시티', '캐슬 시티', '트레이드윈즈', '가레 가드']),
        3: ('지브롤터 챌린지 리그', [# 12
            '지브롤터 유스', '사우스 유나이티드', '노스 가드', '웨스트 가든', '이스트 POINT', '베이사이드 FC', '카탈란 FC', '링컨 B', '유로파 B', '세인트 조셉스 B', '마그파이스 B', '맨체스터 62 B'])
    },
    '키프로스': {
        1: ('키프로스 1부 리그', [# 14
            'APOEL', '아폴론 리마솔', '오모니아', 'AEK 라르나카', '아리스 리마솔', '파포스 FC', '아노르토시스', 'AEL 리마솔', '네아 살라미스', '카르미오티사', '오모니아 29M', '에니시스 네온 파라림니', '도크사 카토코피아스', '오모니아 아라디푸']),
        2: ('키프로스 2부 리그', [# 16
            '에르미스 아라디푸', '아크리타스 클로라카스', '올림피아코스 니코시아', 'PAEEK', '아야 나파', '디게니스 아크리타스', '아실리아 FC', 'ALKI 오로클리니', 'AEZ 자카키우', '페이아 2014', '아나게니시 데리네이아', '오텔로스 아티엔우', 'MEAP 니수', '아크론 살라미스', '프레네로스', '할카노라스 이달리우']),
        3: ('키프로스 3부 리그', [# 12
            '에나드 폴리스', '이라클리스 게로라코스', '코르노스 FC', '아피포 아크로나', '리바디아', '오르메디아 FC', '스파르타코스 시티', '아포엘 B', '오모니아 B', '아폴론 B', '아실리아 B', '아야 나파 B'])
    },
    '페로 제도': {
        1: ('페로 제도 프리미어리그', [# 10
            'KI 클락스비크', 'HB 토르스하운', 'B36 토르스하운', 'VIK 이스투로이', 'B68 토프티르', '07 베스투르', '스칼라 IF', 'EB 스트레이무르', 'NSI 루나비크', 'IF 푸글라프요르두르']),
        2: ('페로 제도 1부 리그', [# 10
            'TB 트보로위리', 'AB 아르기르', 'B71 산도이', 'FC 수두로이', 'FC 호이비크', 'KI 클락스비크 B', 'HB 토르스하운 B', 'B36 토르스하운 B', 'VIK 이스투로이 B', 'NSI 루나비크 B']),
        3: ('페로 제도 2부 리그', [# 12
            '미바구르', '클락스비크 C', '룬 가드', '산두르 FC', '토르스하운 시티', '베스투르 유스', '07 베스투르 B', 'B68 토프티르 B', 'EB 스트레이무르 B', 'AB 아르기르 B', '호이비크 B', 'TB 트보로위리 B'])
    },
    '몰타': {
        1: ('몰타 프리미어리그', [# 12
            '햄룬 스파탄스', '하이버니언스', '발레타 FC', '플로리아나 FC', '비르키르카라', '그지라 유나이티드', '모스타 FC', '발잔 FC', '슬리에마 원더러스', '나크사르 라이온즈', '구디아 유나이티드', '자바르 세인트 패트릭']),
        2: ('몰타 챌린지 리그', [# 16
            '지툰 코린티안스', '타시엔 레인보우즈', '피에타 핫스퍼스', '즈베크 라이온즈', '루카 세인트 안드류스', '멜리하 FC', '음가르 유나이티드', '아타르드 FC', '마르사 FC', '셍글레아 애슬레틱', '스위키 유나이티드', '리자 애슬레틱', '산환 FC', '생드니 컵', '존디 컵', '마르사스칼라']),
        3: ('몰타 내셔널 아마추어리그', [# 12
            '시지위 FC', '키르콥 유나이티드', '딩글리 스왈로우스', '가르구르 FC', '그렌디 FC', '펨브로크 아틀레타', '음타파 FC', '칼카라 유나이티드', '스타베라 FC', '샤이라 토네이도스', '산타 베네라', '피에타 B'])
    },
    '리히텐슈타인': {
        1: ('리히텐슈타인 엘리트리그', [# 7
            'FC 파두츠', 'FC 에셴 마우렌', 'FC 발처스', 'FC 트리센', 'FC 샨', 'FC 루겔', 'FC 트리센베르크']),
        2: ('리히텐슈타인 챌린지리그', [# 12
            '파두츠 B', '에셴 마우렌 B', '발처스 B', '트리센 B', '샨 B', '루겔 B', '트리센베르크 B', '파두츠 유나이티드', '레지오 샨', '라인 탈 FC', '루겔 스파르타크', '알프스 FC']),
        3: ('리히텐슈타인 아마추어리그', [# 12
            '파두츠 C', '에셴 C', '말분 FC', '플랑켄 레인저스', '셀렌베르크', '벤더스 FC', '감프린 시티', '발처스 유스', '에셴 D', '샨 C', '트리센 C', '오버란트 킹스'])
    },
    '이라크': {
        1: ('이라크 스타스 리그', [# 20
            '알 쇼르타', '알 쿠와 알 자위야', '알 자우라아', '알 탈라바', '알 나자프', '에르빌 SC', '두호크 SC', '알 나프트', '알 미나아', '나프트 마이산', '나프트 알 바스라', '알 카르크', '카르발라 SC', '알 카심', '나프트 알 와사트', '디얄라 FC', '알 카르마', '알 파하드', '자코 SC', '나프트 알 자누브']),
        2: ('이라크 퍼스트 디비전', [# 12
            '알 시나아', '새마와 SC', '알 디와니야', '아마나 바그다드', '라마디 FC', '나자프 시티', '피슈메르가 SC', '산업 클럽', '아파크 FC', '알 타지', '알 후세인', '바스라 FC']),
        3: ('이라크 세컨드 디비전', [# 12
            '알 수크', '모술 SC', '술라이마니야', '키르쿠크 FC', '나시리야 SC', '신자르 SC', '바빌론 FC', '쿠트 SC', '아마라 FC', '듀자일', '알 투즈', '디얄라 B'])
    },
    '시리아': {
        1: ('시리아 프리미어리그', [# 12
            '알 포투와', '알 자이시', '알 이티하드 알레포', '알 카라마', '알 와트바', '티스린 SC', '자블레 SC', '알 탈리아', '알 홋틴', '알 와흐다', '알 사헬', '후리야 SC']),
        2: ('시리아 퍼스트 디비전', [# 16
            '알 마즈드', '알 사나메인', '알 나와이르', '아프린 SC', '알 자지라', '알 자하드', '알 나우만', '알 야르묵', '아라비', '알 미카드', '알 키스와', '나벡', '알 하리야', '무하다람', '자말레크 다마스쿠스', '라타키아 FC']),
        3: ('시리아 세컨드 디비전', [# 16
            '홈스 스타즈', '하마 유나이티드', '데이르 에조르', '다라 SC', '하사카 킹스', '알 수와이드', '팔미라 FC', '바니아스 레인저스', '타르투스 시티', '샤바바', '알 부스탄', '이드리브 유나이티드', '지스르 알 슈구르', '만비즈 FC', '제라블루스', '알 와스바 B'])
    },
    '팔레스타인': {
        1: ('팔레스타인 프리미어리그', [# 12
            '자발 알 무카베르', '힐랄 알 쿠드스', '샤바브 알 칼릴', '샤바브 알 다히리야', '마르카즈 발라타', '타카피 툴카름', '샤바브 알 오베이디야', '아흘리 알 칼릴', '타라지 와디 알 네스', '샤바브 아마리', '이슬라미 칼킬리아', '무아사트 알 비레']),
        2: ('팔레스타인 퍼스트 디비전', [# 12
            '마르카즈 아스카르', '투바스 유나이티드', '젠인 SC', '베들레헴 시티', '예리코 유나이티드', '마르카즈 투카람', '실완 SC', '카르멜 SC', '아흘리 가자', '샤바브 자발리아', '이티하드 칸 유니스', '사다카 SC']),
        3: ('팔레스타인 세컨드 디비전', [# 16
            '가자 스포츠 클럽', '하드마트 라파', '샤바브 칸 유니스', '이티하드 슈자이야', '나블루스 FC', '라말라 스타즈', '헤브론 로버스', '툴카름 유스', '베이트 우마르', '누세이라트 캠프', '부레이즈 유나이티드', '마가지 스타즈', '자이툰 FC', '자우야 SC', '도라 유나이티드', '칼킬리아 로버스'])
    },
    '타지키스탄': {
        1: ('타지키스탄 위스샤야 리가', [# 12
            '이스티클롤', '라브샨 쿨롭', '에스하타', 'CSKA 파미르 두샨베', '후잔드', '레가르 타다즈', '호실лот 마르카르', '쿠크토시', '파이즈칸드', '이스타라브샨', '바르크치', '파니 유나이티드']),
        2: ('타지키스탄 퍼스트 리그', [# 12
            '디나모 두샨베', '훌부크', '사로이카마르', '라브샨 하이랜드', '두샨베-83', '모히르', '구liston', '사르하치', '샤흐리스투스', '이스파라 FC', '자파르아바드', '바흐다트 유나이티드']),
        3: ('타지키스탄 세컨드 리그', [# 16
            '무르고브 FC', '가르스트', '보크타르 스타즈', '판자켄트', '호로그 FC', '투르순조다', '바흐다트 로버스', '야반 킹스', '아스트라 FC', '누레크 시티', '당가라 유나이티드', '루샨 파이터스', '이shkashim', '아이니 FC', '샤르투즈 메탈루르그', '자파르 킹스'])
    },
    '키르기스스탄': {
        1: ('키르기스스탄 프리미어리그', [# 10
            '압디쉬 아타', '알라이 오시', '도르도이 비슈케크', '무라스 유나이티드', '알가 비슈케크', '네프트치 코치코르아타', '탈란트', '일비르스', '카라 발타', '오시 시티']),
        2: ('키르기스스탄 내셔널 리그', [# 12
            '리더 FC', '디나모 오시', '이시크쿨 유나이티드', '잘랄아바드 스타즈', '나린 FC', '탈라스 레인저스', '추이 프리미어', '알디에르 술레이만', '지바 FC', '자스틱', '나셰 네브트치', '압디쉬 아타 B']),
        3: ('키르기스스탄 세컨드 리그', [# 16
            '비슈케크 로버스', '바트켄 FC', '우즈겐 유나이티드', '코치코르 시티', '키질키야', '카라콜 시티', '토크모크 FC', '알라이 유스', '바자르 코르곤', '티안샨 에이스', '숄폰아타 로버스', '노오카트 레인저스', '이시크쿨 스타즈', '비슈케크 유나이티드', '칸트 메탈루르그', '추이 에이스'])
    },
    '레바논': {
        1: ('레바논 프리미어리그', [# 12
            '알 안사르', '네즈메 SC', '알 아헤드', '샤바브 알 사헬', '알 사파', '부르즈 FC', '라싱 베이루트', '트리폴리 SC', '샤바브 알 가지에', '살람 즈가르타', '타다몬 타이어', '아흘리 나바티에']),
        2: ('레바논 세컨드 디비전', [# 12
            '이티하드 아크마르', '티레 유나이티드', '사이다 SC', '베카 스타즈', '바알베크 FC', '알 마브라', '샤바브 알 아라비', '라싱 주니에', '이크하 알 아흘리', '스포르팅 베이루트', '알 에gt레알', '나르 자말타']),
        3: ('레바논 써드 디비전', [# 16
            '호멘멘 베이루트', '호멘에트멘', '샤바브 마즈달', '주니에 시티', '비블로스 FC', '슈프 레인저스', '알 안사르 유스', '네즈메 B', '바트룬 FC', '쿠라 유나이티드', '자흘레 에이스', '나바티에 스타즈', '베이루트 시티 FC', '티레 로버스', '알 아말 마르카바', '샤바브 지브치트'])
    },
    '쿠웨이트': {
        1: ('쿠웨이트 프리미어리그', [# 10
            '알 쿠웨이트 SC', '알 카디시야', '알 아라비', '알 카즈마', '알 살미야', '알 파하힐', '알 나스르', '알 자하라', '알 야르무크', '알 샤바브']),
        2: ('쿠웨이트 디비전 1', [# 8
            '알 타다몬', '카이탄 SC', '알 사헬', '수라이비카트', '알 부르간', '쿠웨이트 시티 유나이티드', '알 솔라이비야', '알 가이시 쿠웨이트']),
        3: ('쿠웨이트 챌린지 리그', [# 12
            '자하라 유스', '필라카 아일랜드', '나스르 킹스', '살미야 블루스', '아라비 로버스', '카디시야 스타즈', '사바 에이스', '알 와프라', '파하힐 시티', '카즈마 에이스', '알 아흐메디 로버스', '자브리아 유나이티드', '알 자하라 B'])
    },
    '필리핀': {
        1: ('필리핀 풋볼 리그', [# 12
            '유나이티드 시티', '카야 이로이로', '스탈리온 라구나', '멘디올라 1991', '마할리카 마닐라', '세부 FC', '필리핀 에어포스', '필리핀 아미', '다바오 아길라스', '마닐라 디거스', '로욜라 메랄코 스파크스', '원 태기그 FC']),
        2: ('필리핀 내셔널 디비전 2', [# 12
            '그린 아처스 유나이티드', '파사이 시티', '바콜로드 유나이티드', '카가얀 킹스', '일로일로 스타즈', '일로일로 유나이티드', '세부 시티 FC', '리가 마닐라', '마카티 FC', '잠보앙가 유나이티드', '케존 시티 유니온', '도니코 FC']),
        3: ('필리핀 챌린지 리그', [# 16
            '잠보앙가 FC', '타클로반 레인저스', '안티폴로 FC', '케존 시티 로버스', '민다나오 파이터스', '루손 일렉트릭', '비사야스 파이오니어스', '카야 유스', '바기오 시티 FC', '나가 유나이티드', '레가스피 로버스', '레이테 워리어스', '두마게티 스타즈', '일리간 시티', '부투안 킹스', '파라냐케 FC'])
    },
    '투르크메니스탄': {
        1: ('투르크메니스탄 요카리 리가', [# 9
            '알틴 아시르', '아할 FK', '코페트다그 아시가바트', '네비트치', '샤가담', '메르브 마리', '아르카다그 FC', '에네르게틱', '아시가바트 FC']),
        2: ('투르크메니스탄 비린지 리가', [# 12
            '탈리플라리', '레바프 FC', '발칸 아바자', '마리 킹스', '세르헤다치', '바흐티야를리크', '다쇼구즈 FC', '구브라다그', '바이라마리', '차르주 SC', '하자르 FK', '투란 다쇼구즈']),
        3: ('투르크메니스탄 세컨드 리그', [# 16
            '기질아르바트', '하 자르 로버스', '고크데페', '아르카다그 B', '알틴 유스', '아무다리야', '라쿰 스타즈', '테젠 FC', '바하르덴 FC', '카카 유나이티드', '세라흐스 스타즈', '무르갑 SC', '사카르차게', '가라베케웰', '에트레크 로버스', '파라프 FC'])
    },
    '예멘': {
        1: ('예멘 프리미어리그', [# 14
            '알 아흘리 사나', '알 와흐다 사나', '알 틸랄', '알 샤브 하드라마우트', '알 사크르', '파흐만 SC', '알 얄무크 사나', '알 힐랄 알 후다이다', '알 샤브 이브', '알 이티하드 이브', '알 오루바 사나', '알 와흐다 아덴', '알 슈알라', '삼안 SC']),
        2: ('예멘 퍼스트 디비전', [# 12
            '살람 바빌', '타디아몬 알 가이디야', '샤브 사나', '나디 탈라에아', '알 자작', '알 라이얀', '시밤 SC', '사운 SC', '알 인티락', '알 나스르 아덴', '알 미나', '키파 SC']),
        3: ('예멘 세컨드 디비전', [# 8
            '알 호스니', '샤바브 알 질', '알 파테', '알 라시드', '나디 샤바브', '알 자말레크 아덴', '알 클레파', '알 타다몬 이브'])
    },
    '아프가니스탄': {
        1: ('아프가니스탄 챔피언스리그', [# 12
            '샤힌 아스마예', '투판 하리로드', '시모르그 알보르즈', '마웨이하이 아무', '데 스핀 가르 바잔', '오카반 힌두쿠시', '데 아바신 바페', '데 마이완드 아탈란', '수르흐 포샨', '코다만 스타즈', '아부 무스림 FC', '이스타클랄 FC']),
        2: ('카불 프리미어리그', [# 10
            '페로지 FC', '빅토리 FC', '세라미아스트 FC', '자완안 미한', '하비비아 FC', '마무디아 FC', '자완안 아자디', '오르두 FC', '하코마트 FC', '솔흐 FC']),
        3: ('아프가니스탄 지역 디비전', [# 8
            '헤라트 FC', '칸다하르 FC', '마자르샤리프 FC', '잘랄아바드 FC', '쿤두즈 FC', '바미안 FC', '가즈니 FC', '팍티아 FC'])
    },
    '중화 타이베이': {
        1: ('대만 프리미어리그', [# 8
            '타이난 시티', '타이중 푸투로', '타이완 파워 컴퍼니', '타이페이 비킹스', '밍추안 대학', '신북 항유엔', '대만 체육대학', '타이페이 시티 타퉁']),
        2: ('대만 챌린지 리그', [# 9
            '타이페이 플레이원', '가오슝 디펜스', '이란 FC', '화롄 FC', '주베이 인터내셔널', '타오위안 국제 FC', '사스콰치 FC', '가오슝 100 마일즈', '항유엔 FC B']),
        3: ('대만 디스트릭트 리그', [# 8
            '지룽 시티 FC', '가오슝 시티 FC', '핑둥 유나이티드', '타이둥 FC', '자이 카운티 FC', '신주 풋볼 클럽', '난터우 FC', '타이난 유스 AC'])
    },
    '몰디브': {
        1: ('몰디브 디베히 리그', [# 9
            '마지야 S&RC', '클럽 발렌시아', 'TC 스포츠 클럽', '유나이티드 빅토리', '클럽 이글스', '수퍼 크루즈 스포츠', '클럽 그린 스트리트', '부루 스포츠 클럽', '빅토리 SC']),
        2: ('몰디브 2부 리그', [# 9
            'JJ 스포츠 클럽', '클럽 PK', '뉴 라디안트 SC', 'BG 스포츠 클럽', '클럽 ZEF', '다운 타운 스포츠', '한디마두 유스', '마히바두 스포츠', '틴아두 자완안']),
        3: ('몰디브 3부 리그', [# 8
            '비아두 스포츠', '쿠라마티 FC', '가푸 달루 풋볼', '라 아톨 풋볼 클럽', '말레 스포츠 클럽', '훌후말레 스포츠', '마히바두 스포츠 클럽', '틴아두 유나이티드'])
    },
    '미얀마': {
        1: ('미얀마 내셔널리그', [# 10
            '양곤 유나이티드', '샨 유나이티드', '한타와디 유나이티드', '야다나본 FC', '에야와디 유나이티드', '미야와디 FC', '마하 유나이티드', '다가 FC', '다곤 스타즈 유나이티드', '이스페 FC']),
        2: ('미얀마 MNL-2', [# 9
            '네피도 FC', '친 유나이티드', '카친 유나이티드', '라카인 유나이티드', '실버 스타즈', '궤가빈 유나이티드 FC', '대학교 FC', '롄니에르 FC', '바고 레인저스']),
        3: ('미얀마 아마추어리그', [# 8
            '타운지 FC', '몰라먄 유나이티드', '만달레이 FC', '파안 유나이티드', '시트웨 FC', '메이클라 FC', '모곡 FC', '바고 유나이티드'])
    },
    '온두라스': {
        1: ('온두라스 리가 나시오날', [# 10
            'CD 올림피아', 'CD 모타구아', '레알 CD 에스파냐', 'CD 마라톤', '오란초 FC', 'CD 빅토리아', 'CD 레알 소시에다드', 'CD 헤네시스', '로보스 UPNFM', '플라텐세 FC']),
        2: ('온두라스 아센소 리그', [# 10
            '레알 유벤투스', '파리야스 원', '아틀레티코 촐로마', '유니온 사바', '요로 FC', '론 가드 FC', '아틀레티코 인디펜디엔테', '유벤투드 알바라도', '아틀레티코 주니어', '산 후안 SB']),
        3: ('온두라스 리가 마요르', [# 8
            '산페드로수라 스포츠', '테구시갈파 FC', '라세이바 클럽', '코판 마야스', '촐루테카 풋볼', '단리 FC', '인디펜디엔테 모나스테리오', '올란치토 FC'])
    },
    '엘살바도르': {
        1: ('엘살바도르 프리메라 디비전', [# 12
            '알리안사 FC', 'CD FAS', 'CD 아길라', 'CD 루이스 앙헬 피르포', 'AD 이시드로 메타판', 'CD 플라텐세', 'CD 푸에르테 산 프란시스코', 'CD 무니시팔 리메뇨', '11 데포르티보 FC', '산타 테클라 FC', 'CD 드라곤', 'CD 찰라테낭고']),
        2: ('엘살바도르 세군다 디비전', [# 9
            '아틀레티코 마르테', '손소나테 FC', 'CD 티탄', 'CD 카카우아티케', '인디펜디엔테 산 비센테', '벤피카 산 이시드로', '토포스 FC', 'CD 마르테 소야팡고', '레알 데스트루요르']),
        3: ('엘살바도르 테르세라 디비전', [# 8
            'CD 아우아차판', 'CD 우수루탄', '라 리베르타드 FC', '산살바도르 FC', 'CD 크루세이루', '이코스테페케', '산타아나 무니시팔', '산미겔 FC'])
    },
    '아이티': {
        1: ('아이티 상피오나 나시오날', [# 12
            '하싱 클럽 하이시엔', '아르카하이 FC', '비올레트 AC', '돈 보스코 FC', '카발리 AS', 'FICA', 'AS 카포이즈', '볼티모어 SC', '템페트 FC', '하싱 Gonaives', 'AS 미라발레', '아메리카 데 카예']),
        2: ('아이티 디비전 2', [# 10
            '유벤투스 레카이', '자크멜 유나이티드', '고나이브 스타즈', '레오간 FC', '제레미 FC', '포르토프랭스 FC', '포르 드 페 FC', '엑사풋', '로즈 카포이즈', '아틀레티코 생마르크']),
        3: ('아이티 디비전 3', [# 8
            '레카이 스포츠', '페티온빌 클럽', '생마르크 FC', '카프하이시엔 유나이티드', '포르 드 페 스포츠', '앙스 아 포도 FC', '자크멜 이글스', '레오간 파이오니어스'])
    },
    '퀴라소': {
        1: ('퀴라소 프로메 디비시온', [# 10
            'CRKSV 종 홀란드', 'RKSV 센트로 도밍귀토', 'SV SUBT', 'RKSV 스헤르펜회펄', 'CVV 인테르 빌렘스타트', 'CRKSV 종 콜롬비아', 'CSD 바르베르', 'UNDEBA', 'Victory Boys', 'RKVFC 시토크']),
        2: ('퀴라소 세군드 디비시온', [# 8
            'SV VESTA', 'CD 산타 로사', 'SV 후벤투트 포르투나', 'SV 뉴 송', 'UD 테라 코라', 'FC 인테르 퀴라소', 'SV 아토믹', 'SC 아틀레티코 살리냐'])
    },
    '과테말라': {
        1: ('과테말라 리가 나시오날', [# 12
            '코무니카시오네스 FC', 'CSD 무니시팔', '안티구아 GFC', '셀라후 MC', 'CD 말라카테코', 'CD 과스타토야', '코반 임페리알', '데포르티보 아추아파', '데포르티보 믹스코', '데포르티보 자카파', '세라 FC', '데포르티보 마르켄세']),
        2: ('과테말라 프리메라 디비전', [# 20
            '데포르티보 사카치스파스', 'CSD 수치테페케스', '우니베르시다드 SC', '오로라 FC', '유벤투드 피눌레카', '치말테낭고 FC', '데포르티보 카르차', '데포르티보 아구아 카탄카', '산 페드로', '누에바 콘셉시온', '데포르티보 이스타파', 'CSD 바르베레나', '데포르티보 킬코', '데포르티보 사마야', '데포르티보 타쿠', 'CSD 소롤라', '데포르티보 라 리베르타드', '데포르티보 페텐', '데포르티보 킨트', 'CD 믹클란']),
        3: ('과테말라 세군다 디비전', [# 40
            '아마티틀란 FC', '데포르티보 레우', '티키사테 FC', '잘라파 FC', '과테말라 시티 FC', '데포르티보 산라파엘', 'FC 산타 루시아', '데포르티보 텔루만', '데포르티보 칠라', '데포르티보 아카스구아스틀란', '데포르티보 파나하첼', '데포르티보 타후물코', '데포르티보 랄라', '데포르티보 사나라테', '데포르티보 촐라', '데포르티보 몬하', '데포르티보 시팔라', '데포르티보 파야', '데포르티보 아요르카', '데포르티보 텔루만 B', '데포르티보 산후안', '데포르티보 벤다나', '데포르티보 아토', '데포르티보 구아카', '데포르티보 룬', '데포르티보 찰로', '데포르티보 알로', '데포르티보 팡', '데포르티보 룬카', '데포르티보 산타', '데포르티보 시나', '데포르티보 마타', '데포르티보 오메', '데포르티보 테라', '데포르티보 누에', '데포르티보 카사', '데포르티보 텔', '데포르티보 나바', '데포르티보 칠', '데포르티보 오로'])
    },
    '세인트키츠 네비스': {
        1: ('SKNFA 프리미어리그', [# 10
            '세인트 폴스 유나이티드', '가든 핫스퍼스 FC', '뉴타운 유나이티드', '카이온 로케츠', '맨티스 FC', '올드 로드 제츠', '빌리지 수퍼스타즈', '세인트 피터스 FC', '콘에리 FC', '새들러스 유나이티드']),
        2: ('SKNFA 디비전 1', [# 9
            '네비스 AC', '샤를스타운 유나이티드', '샌디 포인트 FC', '보안군 FC', '바스테르 주니어스', '블랙 이글스 FC', '챌린저스 FC', '진저랜드 FC', '세인트 메리스 FC']),
        3: ('SKN 디스트릭트 리그', [# 8
            '케욘 유스', '가든 핫스퍼스 유스', '뉴타운 스타즈', '네비스 킹스', '새들러스 FC', '바스테르 로버스', '세인트 피터스 레인저스', '진저랜드 에이스'])
    },
    '도미니카 공화국': {
        1: ('리가 도미니카나 데 풋볼', [# 10
            '치바오 FC', '클럽 아틀레티코 판토하', '모카 FC', '델피네스 델 에스테', '아틀레티코 베가 레알', 'O&M FC', '아틀레티코 산 크리스토발', '아틀레티코 산토도밍고', '자라바코아 FC', '산티아고 시티 FC']),
        2: ('LDF 세군다 디비전', [# 10
            '라 로마나 FC', '카리브 레알 FC', '푸에르토 플라타 FC', '바라호나 FC', '산 페드로 FC', '바바오 로얄스', '푼타카나 FC', '산티아고 FC', '나바레테 FC', '산 프란시스코 FC']),
        3: ('도미니카 아마추어리그', [# 8
            '산토도밍고 파이오니어스', '아주아 FC', '나구아 유나이티드', '사마나 블루스', '히구에이 FC', '바니 킹스', '코투이 FC', '엘 세이보 FC'])
    },
    '니카라과': {
        1: ('니카라과 리가 프리메라', [# 10
            '레알 에스텔리', '디리앙헨 FC', 'CD 발터 페레티', '마나과 FC', 'ART 하라파', 'CS 세바코', 'CD 오코탈', 'UNAN 마나과', '마타갈파 FC', '인디펜디엔테 산 마르코스']),
        2: ('니카라과 세군다 디비전', [# 10
            '유벤투스 마나과', '치난데가 FC', '레알 마드리스', '후이갈파 FC', '오르가니카 마사차파', 'FC 에스텔리', '소모토 FC', '산 유다스', '브라보스 데 프레이레', '디리앙헨 아카데미']),
        3: ('니카라과 테르세라 디비전', [# 8
            '데포르티보 그라나다', 'FC 레온', '지노테가 FC', 'CD 보아코', '데포르티보 리바스', '티피타파 FC', '산 라파엘 델 수르', '마사야 FC'])
    },
    '버뮤다': {
        1: ('버뮤다 프리미어리그', [# 10
            'PHC 제브라스', '노스 비리지 라스칼스', '서머셋 트로잔스', '데번셔 쿠거스', '해밀턴 파리시', '세인트 조칩스 콜츠', '패짓 레인저스', '영 메니스 사회 클럽', '사우스햄튼 레인저스', '부더 보이스 SC']),
        2: ('버뮤다 퍼스트 디비전', [# 8
            '데번셔 다크호스', '울브스 SC', '아일랜드 レ인저스', '바스 유나이티드', '소머셋 이글스', '아일랜드 풋볼 클럽', '보아즈 아일랜드', '세인트 데이비스'])
    },
    '세인트루시아': {
        1: ('세인트루시아 SLFA 퍼스트 디비전', [# 10
            'B1 FC', '플래티넘 FC', '포크 스타즈 FC', '마리곳 유나이티드', '가이아 코린스', '수프리에르 스타즈', '초이셀 FC', '비외포르 테크', '그로스 아일렛', '노던 유나이티드']),
        2: ('세인트루시아 세컨드 디비전', [# 8
            '캐스트리스 중앙', '데너리 유나이티드', '미쿠드 FC', '라보리 FC', '안스 라 레이', '카나리스 FC', '마부야 벨리', '티 로셰 FC'])
    },
    '그레나다': {
        1: ('그레나다 GFA 프리미어리그', [# 10
            '파라다이스 FC 인터내셔널', '세인트 존스 스포츠 클럽', '하드 록 FC', '퀸스 파크 레인저스', '챈트미엘 FC', '이글스 수퍼 스트라이커스', '사보 유나이티드', '폰이 하운즈', '카리브 가든스', '해피 힐 FC']),
        2: ('그레나다 퍼스트 디비전', [# 8
            '구야브 스타즈', '그렌빌 레인저스', '카리아쿠 유나이티드', '쁘띠 마르티니크 FC', '파이브 스타즈 FC', '스파이스 보이스', '벨레어 FC', '스프링스 FC'])
    },
    '푸에르토리코': {
        1: ('리가 푸에르토리코', [# 8
            '바야몬 FC', '메트로폴리탄 FA', '푸에르토리코 솔', '과이나보 시티 FC', '아카데미아 킨타나', 'CSD 카우세', '마야구에스 FC', '아틀레티코 산후안']),
        2: ('푸에르토리코 디비시온 데 아센소', [# 8
            '폰세 유나이티드', '카구아스 스포팅', '아레시보 FC', '과야마 FC', '레알 아나스코', '도라도 FC', '캐롤라이나 지안테스', '트루히요 알토 FC'])
    },
    '세인트빈센트 그레나딘': {
        1: ('SVGFF 프리미어 디비전', [# 10
            '호프 인터내셔널', '주에 FC', '아노스 벨리 스타즈', '시온 힐 FC', '시스템 3 FC', '레이턴 아스날', '베키아 유나이티드', '라부카 워리어스', '캠프던 파크', '노스 윈드워드']),
        2: ('SVGFF 퍼스트 디비전', [# 8
            '조지타운 유나이티드', '샤프 보이스 FC', '바로우아리에 FC', '그레나딘 팔콘스', '킹스타운 유나이티드', '스프링 비리지', '로즈 홀', '체스타운 FC'])
    },
    '바베이도스': {
        1: ('바베이도스 프리미어리그', [# 10
            '웨이머스 웨일스', 'BDF 스포팅 클럽', '파라다이스 FC', '엠파이어 클럽', 'UWI 블랙버즈', '노트르담 SC', '세인트 앤드류 라이온즈', '엘레이 FC', '브리지타운 로버스', '실버 산즈']),
        2: ('바베이도스 디비전 1', [# 8
            '화이트 이글스', '크레인 FC', '호라이즌 스타즈', '세인트 필립 유나이티드', '오이스타인스 FC', '스페이츠타운 FC', '베이사이드 유나이티드', '데이렐스 아모리'])
    },
    '도미니카 연방': {
        1: ('도미니카 프리미어리그', [# 10
            '두블랑 FC', '하부 유나이티드', '센트럴 SC', '포츠머스 보머스', '사우프리 아틀레티코', '더블라 아틀레틱', '바스 이글스', '마하고 익스프레스', '위어 카발리에스', '글랜빌라 FC']),
        2: ('도미니카 퍼스트 디비전', [# 8
            '로조 시티 Valley', '그랜드 베이 유나이티드', '마리고 스타즈', '세인트 조셉 FC', '케인필드 유나이티드', '에메랄드 스타즈', '칼리나고 내셔널', '우드포드 힐'])
    },
    '케이맨 제도': {
        1: ('케이맨 제도 CIFA 프리미어리그', [# 10
            '보덴 타운 FC', '스콜라스 인터내셔널', '엘리트 SC', '이스트 엔드 유나이티드', '조지 타운 SC', '퓨처 SC', '로열 케이맨', '선셋 FC', '노스 사이드 SC', '로마 유나이티드']),
        2: ('케이맨 제도 퍼스트 디비전', [# 8
            '케이맨 브락 FC', '리틀 케이맨 FC', '사우스 사운드 FC', '웨스트 베이 FC', '바스 유나이티드', '타이거스 FC', '앨런 시티', '서던 스타즈'])
    },
    '아루바': {
        1: ('아루바 디비시온 디 오노르', [# 10
            'RCA 아루바', 'SV 다코타', 'SV 데포르티보 나시오날', 'SV 라 파마', 'SV 에스트레야', 'SV 브리타니아', 'SV 리버 플레이트', 'SV 카케티오', 'SV 부바리', 'SV 스포르팅']),
        2: ('아루바 디비시온 우노', [# 8
            'SV 유벤투스 아루바', 'SV 인데펜디엔테', '산니콜라스 FC', '오란스타드 유나이티드', '사바네타 스타즈', '노르드 스타즈', '파라데라 FC', '브라질 아루바'])
    },
    '솔로몬 제도': {
        1: ('솔로몬 제도 S-리그', [# 10
            '솔로몬 워리어스 FC', '코사 FK', '중앙 해안 FC', '라우구 유나이티드', '마리스트 FC', '호니아라 시티', '레알 카카우 FC', '서부 연합', '말레이타 킹즈', '이사벨 유나이티드']),
        2: ('솔로몬 제도 디비전 1', [# 8
            '과달카날 FC', '마키라 스타즈 FC', '초이셀 워리어스', '테모투 에이스', '렌벨 유나이티드', '산타 크루즈 FC', '뉴조지아 유나이티드', '솔로몬 워리어스 B'])
    },
    '뉴칼레도니아': {
        1: ('뉴칼레도니아 수페르 리그', [# 10
            'AS 마장타', 'AS 이엔겐 스포르', 'AS 가이차', 'SC 수퍼 리푸', 'AS 뢰시', '탕겐 스포츠', 'AS 몽도르', '누메아 Horizon', 'AS 둠베아', 'AS 뵈코']),
        2: ('뉴칼레도니아 프로모션 도뇌르', [# 8
            'AS 쿤디에', 'AS 포야', 'AS 카날라', '부라일 스포츠', '코네 유나이티드', '파이타 FC', '티오 스포츠', 'AS 리푸 풋볼'])
    },
    '타히티': {
        1: ('타히티 리가 1', [# 10
            'AS 피라에', 'AS 베뉘스', 'AS 드래곤', 'AS 테파나', 'AS 센트럴 스포츠', 'AS 푸나아우이아', 'AS 타하아', 'AS 마히나', 'AS 타마리 푸나아우이아', 'AS 만누 우']),
        2: ('타히티 리가 2', [# 8
            'AS 엑셀시오르', 'AS 아루에', 'AS 파페에테', 'AS 보라보라', 'AS 라이아테아', 'AS 모오레아', 'AS 파파라', 'AS 후아히네'])
    },
    '파푸아뉴기니': {
        1: ('파푸아뉴기니 내셔널 소커리그', [# 8
            '헤카리 유나이티드', '라에 시티 FC', '포트모르즈비 스타즈', '걸프 코모로 FC', '모로베 와우 FC', '마당 FC', '포트모르즈비 아일런더스', '하이랜드 스타즈 FC']),
        2: ('PNG 퍼스트 디비전', [# 8
            '라바울 기아스', '키엠베 SC', '마누스 유나이티드', '고로카 이글스', '마운트하겐 FC', '웨와크 유나이티드', '부카 워리어스', '바니모 FC'])
    },
    '바누아투': {
        1: ('바누아투 VFF 내셔널 수페르리그', [# 8
            '이페라 체프 FC', '타페아 FC', '아미칼레 FC', '갤럭시 FC', '시아라가 FC', '에라코르 골든 스타즈', '투푸카 FC', '말람파 리바이버스']),
        2: ('바누아투 포트빌라 프리미어리그', [# 8
            '포트빌라 유나이티드', '산토 이글스 FC', '루간빌 유나이티드', '펜테코스트 FC', '앰브림 스포츠', '말레쿨라 유나이티드', '에피 FC', '타나 라이온즈'])
    },
    '사모아': {
        1: ('사모아 내셔널리그', [# 8
            '루페 올레 소아가', '키위 FC', '바이바세-타이 FC', '바이텔레-우타 SC', '레아우바아 FC', '바이알라 유나이티드 FC', '바이푸나 FC', '실레마 FC']),
        2: ('사모아 퍼스트 디비전', [# 8
            '모아우아 FC', '살레롤로가 FC', '파가말로 FC', '파기 FC', '레타스 FC', '파아토아 FC', '토가푸아푸아 FC', '바이우수 FC']),
        3: ('사모아 디스트릭트 리그', [# 8
            '사포투 FC', '물리파누아 FC', '아피아 유스', '레페아 FC', '파랄리 FC', '솔로솔로 FC', '루투안 FC', '사마다우 FC'])
    },
    '수리남': {
        1: ('수리남 SVB 최고리그', [# 10
            'SV 로빈후드', '인터 문고타푸', 'SV 트란스발', '노트 카포에르', 'PVV 수리남', 'SV 보르오르더', '레오 빅토르', '산토스 니케리', 'SV 부르하브', '클럽 아틀레티코 아마존']),
        2: ('수리남 SVB 퍼스트 디비전', [# 8
            'SV 보스캄프', 'SV 엑셀시오르', '파라나마 FC', 'SV 파라마리보', '코로니 유나이티드', '마로와인 FC', 'SV 타쿠에르', '수리남 내셔널 FC']),
        3: ('수리남 SVB 세컨드 디비전', [# 8
            '브로코폰도 FC', '사라마카 FC', '코메와인 FC', '워니카 스포츠', '파라 FC', '레리 FC', '알비나 스포츠', '니케리 유나이티드'])
    },
    '가이아나': {
        1: ('가이아나 GFF 엘리트 리그', [# 8
            '가이아나 방방위 방가스', '조지타운 풋볼 클럽', '웨스턴 타이거스 FC', '덴 암스텔 FC', '부익스턴 유나이티드', '산토스 가이아나 FC', '가이아나 디펜스 포스', '폴리스 FC']),
        2: ('가이아나 리조널 디비전 1', [# 8
            '루피누니 레인저스', '린덴 스타즈', '바비체 유나이티드', '마하이카 데테미나토르스', '안나 레지나 파이오니어스', '바티카 풋볼 클럽', '멜로즈 FC', '쿠루 쿠루 워리어스']),
        3: ('가이아나 리조널 디비전 2', [# 8
            '디메하라 유나이티드', '포메룬 FC', '에세키보 이글스', '스튜어트빌 FC', '위어 유나이티드', '뉴 암스테르담 FC', '코렌틴 스타즈', '레오노라 FC'])
    },
    '쿠바': {
        1: ('쿠바 캄페오나토 나시오날', [# 8
            '산티아고 데 쿠바', '시에고 데 아빌라', '빌라 클라라', '라 하바나', '피나르 델 리오', '아르테미사', '라투나스', '과르다라바카 FC']),
        2: ('쿠바 토르네오 데 아센소', [# 8
            '시엔푸에고스', '카마구에이', '구안타나모', '그란마 FC', '올긴 FC', '산크티 스피리투스', '마탄사스', '마야베케']),
        3: ('쿠바 아마추어리그', [# 8
            '이슬라 데 라 유벤투드', '바라데로 FC', '트리니다드 FC', '바야모 FC', '만사니요 FC', '누에비타스 FC', '모아 FC', '팔마 소리아노'])
    },
    '카보베르데': {
        1: ('카보베르데 프리메이라 디비시온', [# 8
            'CS 민델렌세', '스포르팅 프라이아', '아카데미카 도 민델로', '클루브 오스 트라바도레스', '볼카니코스', '보아비스타 프라이아', '살 레이 FC', '울트라마리나']),
        2: ('카보베르데 세군다 디비시온', [# 8
            '아카데미카 프라이아', '바투쿠 FC', '데포르티보 프라이아', '더비 FC', '산타 마리아 FC', '산 비센테 FC', '폴리스 프라이아', '셀레상 살'])
    },
    '기니': {
        1: ('기니 리그 1 프로', [# 8
            '호로야 AC', '하피아 FC', 'AS 칼룸 스타즈', 'CI 카임사르', 'SO아르메', '밀로 FC', '아샴티 골든 보이스', '미네르 보케']),
        2: ('기니 리그 2 프로', [# 8
            '사텔리트 FC', '펠란 AC', '엘레방 FC', '루 가베', '산가레디 AC', 'FC 세크', '와크리아 AC', '르네상스 코나크리']),
        3: ('기니 내셔널 챔피언십', [# 8
            '시기리 FC', '캉칸 FC', '은제레코레 FC', '마무 FC', '프리아 FC', '라베 풋볼 클럽', '다보라 FC', '킨디아 FC'])
    },
    '가봉': {
        1: ('가봉 상피오나 나시오날 D1', [# 8
            'AS 망가스포르', 'CF 무나나', 'US 비탐', 'AO 센트라프릭', '스타드 망드지', 'FC 105 리브르빌', '부엥기디 스포츠', 'AS 디카이']),
        2: ('가봉 상피오나 나시오날 D2', [# 8
            '포르장틸 FC', '오예무 SC', '프랑스빌 FC', 'USM 리브르빌', '아칸다 FC', '로앙다 스포츠', '무일라 FC', '치방가 FC']),
        3: ('가봉 프로빈셜 리그', [# 8
            '마코쿠 FC', '람바레네 FC', '라스트루빌 FC', '쿨라무투 FC', '보우에 FC', '미지크 FC', '포우가무 FC', '오코우자 FC'])
    },
    '우간다': {
        1: ('우간다 프리미어리그', [# 8
            '캄팔라 시티 카운실 (KCCA)', '바이퍼스 SC', '빌라 SC', '익스프레스 FC', '우간다 레버뉴 오소리티 (URA)', '불 FC', '마룬스 FC', '킷타라 FC']),
        2: ('우간다 빅 리그', [# 8
            '블랙스 파워 FC', '음바라라 시티 FC', '와키소 자이언츠 FC', 'NEC FC', '폴리스 FC 우간다', '럭스 디오세세 FC', '카탈라 FC', '진자 북부 FC']),
        3: ('우간다 리조널 리그', [# 8
            '굴루 유나이티드', '아루아 힐 SC', '음발레 히어로즈', '리라 유나이티드', '마사카 시티 FC', '토로 유나이티드', '부웨쿠라 FC', '은제루 유스'])
    },
    '베냉': {
        1: ('베냉 샹피오나 나시오날', [# 8
            '코톤 FC', '로토-포포 FC', '아예마 FC', '다제 FC', 'AS 코토누', '레콰일 FC', '부플 드 보르고우', '드래곤 드 루에메']),
        2: ('베냉 리그 2', [# 8
            '아브라쿠 FC', '자파 FC', '포르토노보 FC', '파라쿠 FC', '나티팅구 FC', '우이다 FC', '호지오 FC', '아자 FC']),
        3: ('베냉 디스트릭트 리그', [# 8
            '주구 FC', '보히콘 FC', '사발루 FC', '캉디 FC', '로코사 FC', '그랑포포 FC', '코토누 스포츠', '말란빌 FC'])
    },
    '모리타니': {
        1: ('모리타니 수페르 D1', [# 8
            '누아디부 FC', '킹스 누악쇼트', '티지크자 FC', 'ACS 가르드 나시오날', 'AS 아르메', 'AS 콩코드', '인터 누악쇼트', '테그라 자이나']),
        2: ('모리타니 수페르 D2', [# 8
            '로소 FC', '주에라트 FC', '카에디 FC', '네마 FC', '아타르 FC', '부길 FC', '샤바브 모리타니', '셀리바비 FC']),
        3: ('모리타니 디스트릭트 리그', [# 8
            '키파 FC', '티시트 FC', '샹게티 FC', '우아단 FC', '틴탄 FC', '아이운 FC', '악주주트 FC', '보게 FC'])
    },
    '마다가스카르': {
        1: ('마다가스카르 프로 리그', [# 8
            'CFFA 안타나나리보', '조나크 FC', 'AS 아데마', '포사 주니어스', '엘게코 플러스', '디시플스 FC', 'Ajesaia', 'COSFA']),
        2: ('마다가스카르 리그 2', [# 8
            '투아마시나 FC', '마하장가 FC', '안치라베 FC', '피아나란초아 FC', '톨리아라 FC', '안치라나나 FC', '포트 도핀 FC', '삼바바 FC']),
        3: ('마다가스카르 리조널 리그', [# 8
            '바오바브 FC', '레무르 FC', '마나카라 FC', '안타나나리보 시티', '노시베 FC', '하이랜드 FC', '암바토보에니 FC', '안두아니 FC'])
    },
    '남수단': {
        1: ('남수단 프리미어리그', [# 8
            '아틀라바라 FC', '알 힐랄 주바', '살람 와우', '말라칼 유나이티드', '아마랏 유나이티드', '카토르 주바', '공 시티 FC', '야이 센트럴 FC']),
        2: ('남수단 퍼스트 디비전', [# 8
            '주바 FC', '와우 유나이티드', '말라칼 FC', '보르 시티 유나이티드', '벤티우 워리어스', '토릿 FC', '룸베크 유나이티드', '아웨일 유나이티드']),
        3: ('남수단 코뮤니티 리그', [# 8
            '피보르 FC', '카포에타 FC', '마리디 FC', '남수단 군대팀', '나일 블루스 FC', '주바 파이오니어스', '라작 FC', '와우 킹스'])
    },
    '나미비아': {
        1: ('나미비아 프리미어 풋볼 리그', [# 8
            '아프리칸 스타즈 FC', '블루 워터스 FC', '올랜도 파이러츠 빈트후크', '시빅스 FC', '나미비아 마이티 건스', '유엔남 FC', '타이거스 빈트후크', '정 칼리 FC']),
        2: ('나미비아 퍼스트 디비전', [# 8
            '빈트후크 유나이티드', '월비스베이 FC', '룬두 킹스 FC', '오샤카티 시티 FC', '마리엔탈 FC', '스바코프문트 FC', '고바비스 FC', '오티와롱고 FC']),
        3: ('나미비아 리조널 리그', [# 8
            '켸트만스호프 FC', '우타피 FC', '에엔하나 FC', '나미브 디저트 FC', '칼라하리 유나이티드', '아웃조 FC', '카리비브 FC', '룬두 첼시'])
    },
    '기니비사우': {
        1: ('기니비사우 캄페오나토 나시오날', [# 8
            '스포르팅 클루브 드 비사우', '벤피카 드 비사우', 'UDIB 비사우', '소니 드 가부', 'FC 카체우', '카치오 유나이티드', '포르투 드 비사우', '발란타 데 만소아']),
        2: ('기니비사우 세군다 디비시온', [# 8
            '바파타 FC', '콰이니아 SC', '볼라마 FC', '만소아 FC', '부가 FC', '가부 스포츠', '인고레 FC', '에스타투 드 비사우']),
        3: ('기니비사우 테르세이라 디비시온', [# 8
            '플라푸 FC', '비옴보 FC', '오이오 풋볼 클럽', '루바 FC', '쿠이나라 FC', '파린 FC', '티테 FC', '카티오 FC'])
    },
    '브루나이': {
        1: ('브루나이 수페르 리그', [# 8
            'DPMM FC', '카스카 FC', '코타 레인저스 FC', 'MS ABDB', '인드라 프리미어 FC', 'MS PDB', '바브룰 스타즈 FC', '룬 바방 FC']),
        2: ('브루나이 프리미어리그', [# 8
            '반다르 세리 베가완 FC', '투통 FC', '벨라이트 FC', '템부롱 FC', '림바 스타즈 FC', '세리아 FC', '쿠알라 벨라이트 FC', '가동 파이터스']),
        3: ('브루나이 디스트릭트 리그', [# 8
            '베라카스 FC', '무아라 브리즈 FC', '제루동 FC', '키아랑 FC', '셍쿠롱 FC', '멘지리 FC', '팡칼란 바투', '라비 FC'])
    },
    '지부티': {
        1: ('지부티 프리미어리그', [# 8
            'AS 아르타/솔라 7', 'AS 알리 사비에', 'GR/SIAF', '지부티 텔레콤', '포트 FC', 'AS 디킬', 'AS 오복', '하우들리 FC']),
        2: ('지부티 퍼스트 디비전', [# 8
            '지부티 시티 FC', '타주라 스타즈', '도르할레 FC', '유니온 아프리카', '홍해 FC', '요보키 FC', '로야 시티', '발발라 FC']),
        3: ('지부티 코뮤니티 리그', [# 8
            '가바드 FC', '바브 엘 만데브', '로얄 지부티', '알리 사비에 유나이티드', '오복 스포츠', '디킬 풋볼 클럽', '란다 FC', '알리 아디 FC'])
    },
    '파키스탄': {
        1: ('파키스탄 프리미어리그', [# 8
            '칸 리서치 래보러토리 (KRL)', '파키스탄 아미 FC', '파키스탄 WAPDA', '카라치 포트 트러스트', '수이 소던 가스 (SSGC)', '무슬림 FC', '파키스탄 네이비', '라이알푸르 FC']),
        2: ('파키스탄 PFF 축구 연맹리그', [# 8
            '파키스탄 에어포스 FC', '파키스탄 폴리스 FC', '수이 북부 가스 (SNGPL)', '과다르 포트 Authority', '마샤 유나이티드', '카라치 유나이티드', '발로치 FC 누시키', '힌두쿠시 FC']),
        3: ('파키스탄 디스트릭트 리그', [# 8
            '라호르 라일스 FC', '페샤와르 콤바인츠', '퀘타 조르 FC', '파이살라바드 유나이티드', '멀탄 창스 FC', '하이데라바드 시티 FC', '숙쿠르 FC', '길기트 발티스탄 FC'])
    },
    '세이셸': {
        1: ('세이셸 프리미어리그', [# 8
            '포레스트 유나이티드', '라 파스 FC', '생 미셸 FC', '코트 도르 FC', '리베이르 스타즈', '바자 브라더스', '라이트 스타즈', '안세 레유니']),
        2: ('세이셸 챔피언십', [# 8
            '빅토리아 시티 FC', '벨 에어 FC', '글라시스 FC', '마헤 이글스 FC', '벨 옴브레 FC', '아일랜드 보이즈 FC', '유니온 베일', '몽 부스통 FC']),
        3: ('세이셸 디스트릭트 리그', [# 8
            '보 발롱 FC', '안세 루아얄 FC', '포드 Glacis FC', '카스케이드 FC', '그랜드 안세 FC', '포인트 라루 FC', '타카마카 FC', '로슈 카이만 FC'])
    },
    '동티모르': {
        1: ('동티모르 리가 푸트볼 아마도라 프리메라', [# 8
            '라릴라 FC', '카르케투 디리', '아틀레티코 울트라마르', '폰테 레스테', '스포르팅 디리', '아사 아카데미카', 'SLB 라이팔라', '디나모 디리']),
        2: ('동티모르 LFA 세군다', [# 8
            '바우카우 스타즈 FC', '말리아나 유나이티드', '리키사 FC', '에르메라 유나이티드', '나게르카 FC', '로스팔로스 유나이티드', '피토 FC', '제브라 FC']),
        3: ('동티모르 LFA 테르세라', [# 8
            '오에쿠시 유나이티드', '수아이 시티 FC', '비케케 타운 FC', '디리 시티 FC', '마나투토 FC', '아일레우 FC', '코바 리마 FC', '라우템 FC'])
    },
    '통가': {
        1: ('통가 메이저 리그', [# 8
            '로토하아파이 유나이티드', '베이팅가 FC', '폴리오우아 FC', '마리스트 통가', '라파하 FC', '콜로포우 FC', '아하우 FC', '하아타푸 FC']),
        2: ('통가 퍼스트 디비전', [# 8
            '무아 유나이티드', '마키 스타즈', '누쿠알로파 시티 FC', '바바우 풋볼 클럽', '에우아 유나이티드', '하아파이 사브레', '토포아 FC', '파타헤 FC']),
        3: ('통가 코뮤니티 리그', [# 8
            '홀로가 FC', '호우마 FC', '콜로모투아 FC', '바이니 FC', '페레헤 FC', '타타카모토', '마우 FC', '노무카 FC'])
    },
    '소말리아': {
        1: ('소말리아 프리미어리그', [# 8
            '모가디슈 시티 클럽', '호르시드 FC', '데케데하 FC', '엘만 FC', '가디드카 FC', '모가디슈 유나이티드', '바나디르 SC', '자가 신호(Jezza)']),
        2: ('소말리아 퍼스트 디비전', [# 8
            '키스마요 FC', '바이도아 유나이티드', '하르게이사 시티 FC', '보사소 FC', '가르웨 풋볼 클럽', '갈카요 유나이티드', '조하르 유나이티드', '마르카 스포츠']),
        3: ('소말리아 디스트릭트 리그', [# 8
            '발라드 FC', '바라웨 FC', '아프고예 FC', '코리오레이 FC', '두사마레브 FC', '벨레드웨이네 FC', '보라마 FC', '에릴 FC'])
    },
    '터크스 케이커스 제도': {
        1: ('터크스 케이커스 프로보 프리미어리그', [# 8
            '새 아카데미(SABA FC)', '블루 힐스 FC', '프로보 프리미어 FC', '그랜드 터크 유나이티드', '수퍼 스타즈 TCI', '티타늄 FC', '레드 이글스 FC', '플라밍고 FC']),
        2: ('TCI 퍼스트 디비전', [# 8
            '사우스 케이커스 FC', '노스 케이커스 FC', '미들 케이커스 FC', '솔트 케이 FC', '파롯 케이 FC', '파인 케이 FC', '코크번 타운 FC', '백 가든 FC'])
    },
    '괌': {
        1: ('괌 부도이저 수페르리그', [# 8
            '나이키 스트라이커스', '괌 Shipyard FC', '로버스 FC 괌', '퀄리티 디스트리뷰터스', '아일랜더스 FC', '윙즈 FC', '사이드킥스 FC', 'NAPA 로버스']),
        2: ('괌 퍼스트 디비전', [# 8
            '하갓냐 스타즈', '투몬 베이 FC', '데데도 풋볼 클럽', '요나 유나이티드', '괌 유나이티드 FC', '타무닝 크루세이더스', '조냐 자이언츠', '탈로포포 FC']),
        3: ('괌 코뮤니티 리그', [# 8
            '앤더슨 AFB 군팀', '망길라오 블루스', '이글스 괌', '바리가다 크루세이더스', '치고 파이터스', '아가트 카우보이스', '피티 유나이티드', '인하라잔 히트'])
    },
    '영국령 버진아일랜드': {
        1: ('BVIFA 내셔널리그', [# 8
            '원 러브 유나이티드', '슈가 보이스 FC', '아일랜더스 FC', '이글스 FC BVI', '레벨스 FC', '월트 레인저스', '올드 매드리드', '포지티브 바이브스']),
        2: ('BVI 퍼스트 디비전', [# 8
            '로드 타운 FC', '토르톨라 유나이티드', '버진 고르다 유나이티드', '요스트 반 다이크 FC', '아네가다 이글스', '비프 아일랜드 FC', '포트 시티 FC', '카리브 브리즈 FC'])
    },
    '스리랑카': {
        1: ('스리랑카 챔피언스리그', [# 8
            '블루 스타 SC', '디펜더스 FC', '콜롬보 FC', '레나운 SC', '라트남 SC', '업 컨트리 라이온즈', '시 시티 SC', '마타라 시티 FC']),
        2: ('스리랑카 퍼스트 디비전', [# 8
            '네곰보 유스 SC', '가골라 SC', '자프나 스타즈 FC', '캔디 풋볼 클럽', '가일 유나이티드', '쿠루네갈라 펠컨스', '바티칼로아 FC', '라트나푸라 SC']),
        3: ('스리랑카 디스트릭트 리그', [# 8
            '트린코말리 FC', '아누라다푸라 SC', '바두야 SC', '칼루타라 풋볼 클럽', '암파라 유나이티드', '케갈레 SC', '폴론나루와 FC', '함반토타 FC'])
    },
    '미국령 버진아일랜드': {
        1: ('USVIFA 프리미어리그', [# 8
            '헬렌 라이츠 FC', '리볼리 FC', 'LR 가드 FC', '세인트 크로아 유나이티드', '세인트 토마스 FC', '라사 유나이티드', '웨스트 엔드 타이거스', '레이온 스타즈 FC']),
        2: ('USVI 퍼스트 디비전', [# 8
            '샬럿 아마리에 FC', '크리스찬스테드 유나이티드', '프레데릭스테드 FC', '세인트 존 이글스', '크루즈 베이 FC', '코랄 베이 FC', '레드 후크 FC', '워터 아일랜드 FC'])
    },
    '부탄': {
        1: ('부탄 프리미어리그', [# 8
            '팀푸 시티 FC', '파로 FC', '트랜스포트 유나이티드', 'Ugyen Academy', 'BFF 아마추어 FC', 'RTC FC', '나마 시티 FC', '텐숭 FC']),
        2: ('부탄 퍼스트 디비전', [# 8
            '푸엔초링 FC', '파로 유나이티드', '팀푸 유나이티드', '왕디 시티 FC', '풍카 유나이티드', '삼드룹 종카르 FC', '겔레푸 SC', '자카르 FC']),
        3: ('부탄 디스트릭트 리그', [# 8
            '트롱사 FC', '몽가르 FC', '하 디스트릭트 FC', '루엔체 FC', '가사 FC', '트라시강 FC', '체랑 FC', '페마가첼 FC'])
    },
    '바하마': {
        1: ('바하마 BFA 시니어 리그', [# 8
            '바하마스 유나이티드', '베어스 FC', '가든 힐스 라이온즈', '서부 연합 FC', '카발리어 FC', '다이너모스 FC', '레니게이즈 FC', '나소 시티 FC']),
        2: ('바하마 퍼스트 디비전', [# 8
            '프리포트 FC', '아바코 유나이티드', '엘루세라 유나이티드', '엑수마 스타즈 FC', '안드로스 유나이티드', '비미니 FC', '롱 아일랜드 FC', '포트 샬럿 FC'])
    },
    '에리트레아': {
        1: ('에리트레아 프리미어리그', [# 8
            '레드 시 FC', '아스마라 브루어리', '아도리스 FC', '안세바 체렌', '게자 반다', '덴덴 FC', '마이 테메나', '알 가드']),
        2: ('에리트레아 퍼스트 디비전', [# 8
            '마사와 FC', '아싸브 유나이티드', '테세네이 FC', '바렌투 FC', '나크파 유나이티드', '케렌 풋볼 클럽', '아디 케이 FC', '멘데페라 FC'])
    },
    '리비아': {
        1: ('리비안 프리미어리그', [# 8
            '알 아흘리 트리폴리', '알 이티하드 트리폴리', '알 아흘리 벵가지', '알 나스르 벵가지', '알 수웨흘리', '알 메디나', '알 아크달', '올림픽 AZ']),
        2: ('리비안 퍼스트 디비전', [# 8
            '알 자지라 수아라', '알 타하디 벵가지', '알 와다 트리폴리', '알 사와에크', '알 샤라라 세브하', '알 오라바', '알 다르네스', '알 히랄 벵가지']),
        3: ('세컨드 디비전', [# 8
            '알 안사르', '알 키파', '알 나즈마', '알 슈알라', '알 테하드', '알 마즈드', '알 아말 변가치', '알 무루지'])
    },
    '니제르': {
        1: ('니제르 프리미어리그', [# 8
            'AS GNN', 'AS 도안 니아메', 'US 가르드 나시오날', 'AS포니', '사헬 SC', '올림픽 FC 니아메', '니제르디아', 'ASN 니제르렉']),
        2: ('두지엠 디비전', [# 8
            'AS 폴리스 니아메', '장도르므리 내셔널', 'JS 타우아', '마라디 풋볼 클럽', '진더 유나이티드', '디파 스포르', '아가데즈 FC', '틸라베리 스포르']),
        3: ('트루아지엠 디비전', [# 8
            '타우아 시티', '도소 풋볼 클럽', '마라디 스타즈', '아가데즈 유나이티드', '테라 FC', '비르니 은코니', '구레 FC', '가야 FC'])
    },
    '감비아': {
        1: ('GFA 리그 퍼스트 디비전', [# 8
            '리얼 드 반줄', '포춘 FC', '가방 FC', '월리단 FC', '브리카마 유나이티드', '호크스 FC', '마리모 FC', '샘거 FC']),
        2: ('세컨드 디비전', [# 8
            '봄바다 FC', 'PSV 웰링가라', 'BK 밀란 FC', '라트리쿠인다 유나이티드', '자라 유나이티드', '팀 리노', '반줄 유나이티드', '세레쿠인다 FC']),
        3: ('서드 디비전', [# 8
            '칸니핑 유나이티드', '바카우 유나이티드', '군주르 유나이티드', '수쿠타 유나이티드', '파자라 FC', '브루풋 유나이티드', '키앙 유나이티드', '에센 FC'])
    },
    '수단': {
        1: ('수단 프리미어리그', [# 8
            '알 힐랄 옴두르만', '알 메레이흐 옴두르만', '하이라 알 아랍', '알 아흘리 셰디', '알 힐랄 알 우바이이드', '알 아흘리 카르툼', '알 아흘리 메로웨', '코르도판 FC']),
        2: ('수단 퍼스트 디비전', [# 8
            '알 투티 카르툼', '알 와디 니알라', '알 메레이흐 알 파셰르', '알 힐랄 카달리', '알 아흘리 아트바라', '알 힐랄 파셰르', '알 코프라', '알 수크']),
        3: ('로컬 리그', [# 8
            '옴두르만 유나이티드', '바리 풋볼 클럽', '포트수단 스포츠', '카살라 유나이티드', '와드 메다니 FC', '엘 오베이드 시티', '나할 시티', '게다레프 FC'])
    },
    '토고': {
        1: ('내셔널 챔피언십', [# 8
            'AS코 페아', 'ASC 카라', '디나미크 토골레', '고오호수', 'AS OTR', '엔텐테 II', '셈마시 FC', '에스포아 FC']),
        2: ('두지엠 디비전', [# 8
            '아가자 로메', '마란나타 FC', '이포제 FC', '코토코 FC', '안젤 FC', '골프 FC', '아라비아 FC', '타보 리그 2']),
        3: ('트루아지엠 디비전', [# 8
            '로메 시티 FC', '카라 유나이티드', '페아 스타즈', '오티 FC', '모노 스포르', '소코데 유나이티드', '아네호 FC', '체비에 FC'])
    },
    '콩고 민주 공화국': {
        1: ('리나풋 리그 1', [# 8
            'TP 마젬베', 'AS 비타 클럽', 'FC 생엘루아 루포포', 'DC 모테마 펨베', 'AS 마니에마 유니온', 'JS 킨샤사', 'SM 발랑드', '루방바시 스포르']),
        2: ('리나풋 리그 2', [# 8
            'FC 르네상스 두 콩고', 'AC 우캉가', 'RC 킨샤사', 'AS 도앙 코노', 'US 트쉬인쿠', 'OC 무앙가이', 'AS 니아키', 'FC 세인트 엘로이']),
        3: ('프로방스 로컬 리그', [# 8
            'FC 마케사', 'AS 방투', 'FC 키부', 'JS 리카시', 'CS 카탕가', 'FC 킬로', 'AS 코발트', 'FC 오카피'])
    },
    '부르키나 파소': {
        1: ('부르키나베 프리미어 리그', [# 8
            'ASFA 옌넹가', 'RC 보보 디울라소', '에투알 필랑트', '마제스틱 FC', '살리타스 FC', 'AS 도안 와가두구', 'AS SONABEL', 'RAHIMO FC']),
        2: ('두지엠 디비전', [# 8
            'USFA 와가두구', 'ASEC 쿠두구', 'RC 카디오고', 'AS 폴리스 부르키나', '산토스 FC 와가두구', 'US 프리앙', 'FC 보보', 'AS 코스모스']),
        3: ('트루아지엠 디비전', [# 8
            '와가두구 시티 FC', '볼투르 FC', '볼타 스포르', 'AS 구르마', '야텡가 FC', '지니 아카데미 FC', '보보 유나이티드', '사바나 FC'])
    },
    '모잠비크': {
        1: ('모잠비콜라', [# 8
            '페로비아루 마푸투', '코스타 두 솔', '블랙 불스', 'UD 스롱구에', '페로비아루 베이라', '페로비아루 나풀라', '리가 무술마나', '에스투디안테스 마푸투']),
        2: ('디비장 드 온라', [# 8
            '디스포르티바 마푸투', '텍사프리카 드 친조', '페로비아루 켈리마네', '클루브 드 마샤케네', '빌랑쿨로 FC', '이ням바네 풋볼 클럽', '가자 유나이티드', '칭가노 드 테테']),
        3: ('프로방스 챔피언십', [# 8
            '마푸투 시티 FC', '베이라 유나이티드', '나풀라 풋볼 클럽', '치모이오 스포르', '켈리마네 유니온', '솔 도 솔 FC', '아틀레티코 무술마나', '펨바 FC'])
    },
    '적도 기니': {
        1: ('리메라 디비시온', [# 8
            '아코낭기 FC', '데포르티보 몽고모', '레알 마라보', '소니 엘라 낭게', '레오네스 베게타노스', '드래곤 FC', '카노 스포르', '데포르티보 니에팡']),
        2: ('세군다 디비시온', [# 8
            '아틀레티코 말라보', '산 페드로 FC', '유니온 베게가', '몽고모 시티 FC', '바타 유나이티드', '루바 FC', '에비네용 스포르', '음비니 FC']),
        3: ('리가 디스트리탈', [# 8
            '에비네용 유나이티드', '코스코 FC', '레알 세이바', '아틀레티코 바타', '산 판타레온', '낭게 FC', '몽고모 유나이티드', '니에팡 시티'])
    },
    '코모로': {
        1: ('코모로 프리미어리그', [# 8
            'FC 드 자니', '볼칸 클럽', 'US 즈림카니', '엘란 클럽', '엔카니 FC', 'Fomboni FC', '스타일 뉴', '아파체 클럽']),
        2: ('디비전 2', [# 8
            '응가지 클럽', '에투알 드 생트', 'FC 무아시', '자니 시티 FC', '미치아미울리 스포르', '코모로 유나이티드', '음바치 FC', '이코니 유나이티드']),
        3: ('디비전 3', [# 8
            '사유스 스포르', '그랑드 코모로 FC', '도모니 스타즈', '앙주안 유나이티드', '모헬리 풋볼 클럽', '클럽 아프리카 코모로', '바우 스타즈', '체미 시티 FC'])
    },
    '탄자니아': {
        1: ('탄자니아 프리미어리그', [# 8
            '심바 SC', '야공 아프리카스', '아잠 FC', '싱기다 폰텐 FC', 'KMC FC', 'Mtibwa 슈가', '카게라 슈가', '탄자니아 프리즌스']),
        2: ('챔피언십 리그', [# 8
            'Pamba SC', 'Mbeya 시티 FC', 'JKT 탄자니아', 'Biashara 유나이티드', '그린 워리어스 FC', 'Transit 캠프 FC', '음베야 Kwanza', '코스탈 유니온 FC']),
        3: ('퍼스트 디비전', [# 8
            '도도마 시티 FC', '이링가 유나이티드', '루부 스타즈 FC', '아루샤 FC', '타보라 풋볼 클럽', '모로고로 유나이티드', '음트와라 스타즈', '키고마 시티 FC'])
    },
    '시에라리온': {
        1: ('시에라리온 프리미어리그', [# 8
            '보 레인저스', '마이티 블랙풀', '이스트엔드 라이온즈', 'FC 칼론', '다이아몬드 스타즈', '프리타운 포茨 오소리티', '올드 에드워디안즈', '완보이즈']),
        2: ('퍼스트 디비전', [# 8
            '캄보 이글스', '바이 부레 워리어스', '센트럴 퍼레이드', '골라 퀸즈 FC', '안티 오카스', '레알 레오네스', '프리타운 시티 FC', '마케니 스타즈 FC']),
        3: ('디스트릭트 리그', [# 8
            '케네마 스타즈', '보 유나이티드 FC', '코이두 타운 FC', '루사르 FC', '마라타 스타즈', '서던 이글스 FC', '노던 유나이티드 FC', '포트 로코 FC'])
    },
    '르완다': {
        1: ('르완다 프리미어리그', [# 8
            'APR FC', '라욘 스포르', '키요부 스포르', 'AS 키갈리', '폴리스 FC 르완다', '무쿠라 빅토리', '에틴셀 FC', '가소기 유나이티드']),
        2: ('세컨드 디비전', [# 8
            '루치로 FC', '에투알 드 레스트', '부게세라 FC', '아미라쥬 FC', '고릴라 FC', '루와마가나 시티', '은양자 FC', '인타레 FC']),
        3: ('서드 디비전', [# 8
            '키갈리 시티 FC', '부타레 풋볼 클럽', '기세니 스타즈', '루바부 스포르', '무상제 유나이티드', '르완다 유니온', '빅토리 스타즈 FC', '기샤리 FC'])
    },
    '짐바브웨': {
        1: ('짐바브웨 프리미어리그', [# 8
            'FC 플래티넘', '다이너모스 FC 하라레', '하이랜더스 FC 불라와요', '카프스 유나이티드', '치킨 인 FC', '응게지 플래티넘', '마니카 다이아몬드', '불라와요 치프스']),
        2: ('디비전 1', [# 8
            '블랙 라이노스 FC', '하라레 시티 FC', '하르츠 FC', '텐락스 FC', '와하와하 FC', '불라와요 시티 FC', '줄루 유나이티드', '그린 퓨얼 FC']),
        3: ('디비전 2', [# 8
            '미들랜드 스타즈 FC', '마쇼날랜드 풋볼 클럽', '카리바 스타즈', '무타레 시티 FC', '하라레 유나이티드 FC', '과루 FC', '츠olotsho FC', '뱅가 FC'])
    },
    '콩고 공화국': {
        1: ('콩고 리그 1', [# 8
            'AS 오토호', '디아블 느와르', 'AC 레오파드', 'CARA 브라자빌', 'JS 탈랑가이', '에투알 두 콩고', 'FC 나탈리스', 'V클럽 모캉다']),
        2: ('콩고 리그 2', [# 8
            'AS 퐁투아즈', '인터클럽 브라자빌', 'AS 체미노', '에투알 드 탈랑가이', 'AS 콩도르 니아우이', '디스포르티바 브라자빌', '페로비아루 브라자빌', 'FC 레 솔리드']),
        3: ('지역 디비전', [# 8
            '포앵트누아르 스포르', 'CS 라 만차', '니앙가 FC', '오요 스타즈 FC', 'FC 이요타', 'AS 시노코', '렝가 스타즈', 'FC 킬리만자로'])
    },
    '중앙아프리카공화국': {
        1: ('방기 리그 1', [# 8
            'AS 템페트 모카프', 'DFC8', '레알 코보니', '올림픽 리얼 방기', 'AS 톡라프', '카스트로 FC', 'SICA 스포츠', '우장 프랑스 스타']),
        2: ('방기 리그 2', [# 8
            '레오파드 드 발리', 'AS 소디암', '뱅구이 시티 FC', '에비앙 방기 FC', 'US 방기', '아틀레티코 방기', '레알 스타 드 방기', '레 드와프']),
        3: ('디스트릭트 리그', [# 8
            '발리 유나이티드 FC', 'FC 보방기', 'AS 사바나', '시부 풋볼 클럽', '밤바리 유나이티드', '부아르 시티 FC', '베르베라티 스포르', '카가 방도 FC'])
    },
    '라이베리아': {
        1: ('라이베리아 퍼스트 디비전', [# 8
            'LPRC 오일러즈', '바라크 유스 킹스 (BYC)', 'LISCR FC', '몬로비아 클럽 브루어리스', '닌바 콰도', '왓랑가 FC', '헤븐 일레븐 FC', '인빈서블 일레븐']),
        2: ('세컨드 디비전', [# 8
            '토니 FC', '주니어 프로 FC', 'NPA 앵커스', '가르드네르스빌 FC', '닌바 유나이티드', '머스크 FC', '샌디 FC', '자스 레인저스']),
        3: ('서드 디비전', [# 8
            '몬로비아 스타즈 FC', '지기 포터스 FC', '페이네스빌 FC', '라이베리아 쉬핑 FC', '체로키 FC', '글라디아토르 FC', '바르타 FC', '콩고 타운 유나이티드'])
    },
    '부룬디': {
        1: ('부룬디 프리미어리그', [# 8
            '비탈오 FC', '르 메사제르 르고지', '부몽고 FCO', '무스가티 FC', '플람보 두 센터', '아이글 노아', '올림픽 스타', '인터 스타']),
        2: ('리가 A2', [# 8
            '루몽게 스타 FC', '부줌부라 시티 FC', '르고지 풋볼 클럽', '카얀자 유나이티드', '은고지 시티 FC', '기테가 FC', '텔레콤 FC 부줌부라', '레 부프레 FC']),
        3: ('리가 A3', [# 8
            '부줌부라 스타즈 FC', '무루암비야 유나이티드', '치비토케 FC', '루타나 스타즈', '마캄바 풋볼 클럽', '루이지 시티 FC', '캉쿠조 유나이티드', '키란도 FC'])
    },
    '에티오피아': {
        1: ('에티오피아 프리미어리그', [# 8
            '세인트 조지 SC', '에티오피아 커피', '파실 케네마', '바히르 다르 시티', '하와사 시티', '하다마 시티', '디레 다와 시티', '메켈레 70 안데르타']),
        2: ('에티오피아 하이어리그', [# 8
            '웰왈로 아디그라트 유니버시티', '짐마 아바 지파르', '월키테 시티 FC', '세베타 시티 FC', '하디야 호사나', '시다마 커피', '아르바 민치 시티', '네게레 보란 FC']),
        3: ('내셔널리그', [# 8
            '디스포르티바 에티오피아', '데세 시티 FC', '곰바 시티 FC', '네케메테 시티', '아소사 FC', '지지가 시티 FC', '감벨라 유나이티드', '하레르 비어 FC'])
    },
    '레소토': {
        1: ('레소토 프리미어리그', [# 8
            '마틀라마 FC', '반투 FC', 'LCS FC', 'LMPS FC', '리올리 FC', 'LDF FC', '리포포 FC', '마추냐네 FC']),
        2: ('A 디비전', [# 8
            '리키라 FC', '마주에나 FC', '세포솅 FC', '리놀레 FC', '리틀 풋 FC', '만조니 FC', '로마 로버스 FC', '큐팅 유나이티드']),
        3: ('B 디비전', [# 8
            '마세루 시티 FC', '테야테야넹 FC', '레리베 스타즈', '마페텡 유나이티드', '모할레스 호크 FC', '부타 부테 워리어스', '모코틀롱 풋볼 클럽', '콰차가스 넥 FC'])
    },
    '보츠와나': {
        1: ('보츠와나 프리미어리그', [# 8
            '타운십 롤러즈', '가보로네 유나이티드', '조와넹 갤럭시', '오라파 유나이티드', '보츠와나 디펜스 포스 (BDF XI)', '수아 플래밍고스', '시큐리티 시스템스', '엘레븐 엔젤스']),
        2: ('퍼스트 디비전', [# 8
            '모고디차네 파이터스', '노트와네 FC', '프란시스타운 시티 FC', '익스텐션 건너즈', '모추디 센터 치프스', '마운 유나이티드', 'BR 하이랜더스', '경찰 XI']),
        3: ('디비전 1', [# 8
            '가보로네 스타즈 FC', '로바체 시티 FC', '팔라페 유나이티드', '셀레비 피크웨 FC', '세로우에 하이랜더스', '가나지 테리어스', '카니에 보요스', '츠와넹 유나이티드'])
    },
    '에스와티니': {
        1: ('에스와티니 프리미어리그', [# 8
            '음바바네 스왈로즈', '로얄 레오파드 FC', '음바바네 하이랜더스', '그린 맘바 FC', '영 버팔로스 FC', '만지니 원더러스', '모네니 파이럿츠', '일레븐 멘 인 플라이트']),
        2: ('내셔널 퍼스트 디비전', [# 8
            '만지니 씨 드롭스', '블랙 마바 FC', '레인저스 FC', '탐부티 FC', '밀레니엄 FC', '부쉬 벅스 FC', '세븐 드림스', '마들렌야 FC']),
        3: ('수퍼리그', [# 8
            '음바바네 시티 FC', '만지니 스타즈 FC', '피그스 피크 블랙 마바', '흘라티쿨루 라이온즈', '시테키 FC', '음랑가노 스타즈', '라부미사 유나이티드', '빅 벤드 유나이티드'])
    },
    '모리셔스': {
        1: ('모리셔스 프리미어리그', [# 8
            'Pamplemousses SC', 'GRSE 완더러스', 'AS 포트루이스 마리타임', '세르클 드 요아킴', '로쉬 브룬 FC', '사반 클럽', '쁘띠 리비에르 노아르 SC', 'AS 바코아스-콰트레 보른스']),
        2: ('퍼스트 디비전', [# 8
            '포트루이스 블랙스 스포르', '엔텐테 부쉬 로즈힐', '리비에르 뒤 랑파르', '큐어파이프 스타즈', '라 파스트 스포르치바', '모리셔스 포트 오소리티', '북부 유나이티드', '플라크 유나이티드']),
        3: ('세컨드 디비전', [# 8
            '로즈힐 유나이티드 FC', '큐어파이프 스트라이커스', '로드리게스 유나이티드 FC', '쁘띠 스타즈 SC', '샤말 FC', '밤부스 로버스', '마헤부르그 풋볼 클럽', '그랑 가브 FC'])
    },
    '차드': {
        1: ('차드 프리미어리그', [# 8
            '에투알 뒤 차드', '일렉트-스포츠 FC', '가젤 FC', '르네상스 FC 은자메나', 'AS 코톤차드', '투마이 FC', 'AS 디지아', '풀 아흘리 FC']),
        2: ('디비전 2', [# 8
            'AS 폴리스 은자메나', '장도르므리 차드 FC', '은자메나 시티 FC', '에스포아 드 무스쿠', 'AS 아틀레티코 차드', '미라쥬 FC', 'AS 부르고우', 'AS 벨레']),
        3: ('로컬 챔피언십', [# 8
            '문두 FC', '사르 풋볼 클럽', '아베셰 유나이티드', '봉고르 스포르', '파야 라르고 FC', '도바 시티 FC', '라이 스포르 클럽', '마오 유나이티드'])
    },
    '상투메 프린시페': {
        1: ('상투메 챔피언십', [# 8
            'UDRA', '스포르팅 프라야 크루즈', '6 드 세템브루', '알리앙사 FC 안보나', '포르투 가투', '데포르티보 과달루페', '인터 봄바림', 'FC 카이샹']),
        2: ('세군다 디비시온', [# 8
            '프라야 시티 FC', '데포르티보 산타나', '네베스 FC', '트린다데 FC', '스포르팅 프린시페', '데포르티보 아구아 그란데', '선데이 FC', '리베이라 페이시 FC']),
        3: ('디스트릭트 리그', [# 8
            '산토 안토니오 FC', '프린시페 스타즈 FC', '과달루페 스타즈 FC', '오퀘 델 레이 FC', '바이라 도 마르', '컨셉시온 FC', '콘도르 드 산투아메', '판투포 SC'])
    },
    '트리니다드 토바고': {
        1: ('TT 프리미어 풋볼 리그', [# 8
            '디펜스 포스 FC', 'AC 포트오브스페인', '클럽 산도', '라 호르케타 레인저스', 'W 코네션 FC', '센트럴 FC', '포인트 포틴 시빅', '카레니 오센틱']),
        2: ('내셔널 티어 2', [# 8
            '모르반 칼레도니아 유나이티드', '산 후안 자블로테', '쿠바 유나이티드 FC', '경찰 FC (트리니다드)', '프리즌 서비스 FC', '디에고 마틴 세미프로 FC', '토바고 유나이티드 FC', '아리마 노스 유나이티드']),
        3: ('지방 슈퍼리그', [# 8
            'FC 산타 로사', '퀸즈 파크 CC', '기야구아야레 유나이티드', 'UWI FC', '시파리아 스포르팅 클럽', '마투라 리반 FC', '발랑드 유나이티드', '샤구아나스 FC'])
    },
    '앤티가 바부다': {
        1: ('앤티가 바부다 프리미어리그', [# 8
            '그린베이 호퍼스', '그레네이즈 FC', '올드 로드 FC', 'SAP FC', '파햄 FC', '리버 플레이트 안티구아 FC', '엠파이어 FC', '올 세인츠 유나이티드']),
        2: ('퍼스트 디비전', [# 8
            '윌키스 FC', '존 휴스 FC', '피곳츠 불릿츠 FC', '글랜빌스 FC', '블루 재규어스 FC', '포트 로드 FC', '오타스 FC', '바부다 스타즈 FC']),
        3: ('세컨드 디비전', [# 8
            '세인트존스 시티 FC', '바부다 유나이티드 FC', '앤티가 유니온 FC', '잉글리시 하버 FC', '벨몬트 이글스', '볼란스 FC', '프레스타스 FC', '리베르타 FC'])
    },
    '몬트세라트': {
        1: ('몬트세라트 챔피언십', [# 8
            '플리머스 로버스 FC', '살레 FC', '우드브릿지 FC', '해리스 유나이티드 FC', '센트럴 스타즈 FC', '루크 FC', '세인트존스 유나이티드', '데이비 힐 스포르팅']),
        2: ('디비전 2', [# 16
            '올드 로드 몬트세라트 FC', '리틀 베이 FC', '커도우 패스 FC', '로크 리버 FC', '킹스톤 유나이티드', '세인트 피터스 SC', '브래디스 FC', '개리발디 힐 FC', '로버스 스타즈 FC', '살레 유니온 FC', '우드브릿지 스타즈', '해리스 스타즈 FC', '센트럴 유니온 FC', '북부 익스프레스 FC', '남부 이글스 FC', '몬트세라트 유니온']),
    },
    '벨리즈': {
        1: ('벨리즈 프리미어리그', [# 8
            '베르데스 FC', '벨모판 밴디츠', '벨리즈 디펜스 포스', '프로그레소 FC', '와기야 SC', '산페드로 파이럿츠 FC', '벤퀘 비에호 유나이티드', '플라센시아 아세아노 FC']),
        2: ('퍼스트 디비전', [# 12
            '카요 유나이티드', '오렌지 워크 라이온즈', '톨레도 스타즈 FC', '코로살 풋볼 클럽', '스트라이커스 풋볼 클럽', '레이크 I FC', '알타 비스타 FC', '포트 벨리즈 FC', '벨모판 시티 FC', '산페드로 스타즈 FC', '오렌지 워크 스타즈', '코로살 스타즈 FC']),
    },
    '앵귈라': {
        1: ('앵귈라 AFA 리그', [# 8
            '로링 라이온즈 FC', '독스 유나이티드 FC', '어택커스 FC', '살사 FC', '업라이징 FC', '알리안스 FC', '다이아몬드 FC', '스파르탄스 FC']),
        2: ('AFA 퍼스트 디비전', [# 8
            '더 밸리 FC', '이스트엔드 유나이티드 FC', '웨스트엔드 스타즈', '스트라이커스 FC 앵귈라', '리틀 디크 FC', '아일랜드 보이즈 FC', '블루 버드 FC', '샌디 그라운드 FC']),
    },
    '캄보디아': {
        1: ('캄보디아 프리미어리그', [# 10
            '프놈펜 크라운', '프레아 칸 리치 스바이리엔', '비스카 FC', '나가월드 FC', '보에웅 케트 FC', '앙코르 타이거 FC', '티피 아미 FC', '키리봉 소크 센 체이', '솔틸로 앙코르', '프레이 벵 FC']),
        2: ('캄보디아 리그 2', [# 8
            '내셔널 폴리스 FC', '아시아 유로 유나이티드', '솔틸로 앙코르 FC', '전기공사 FC (EDC)', 'NEXT FT', '라이프 FC', '캄보디안 아카데미 FC', '씨엠립 유나이티드']),
        3: ('프로방스 컵 리그', [# 8
            '시엠립 FC', '바탐방 FC', '시아누크빌 FC', '캄포트 FC', '타케오 FC', '파일린 시티 FC', '포삿 FC', '프레이 벵 FC'])
    },
    '네팔': {
        1: ('마터스 메모리얼 A-디비전 리그', [# 10
            '마낭 마르샹디 클럽', '네팔 경찰 클럽', '쓰리 스타 클럽', '트리부반 아미 클럽', '산카타 클럽', '자왈라켈 유스 클럽', '뉴 로드 팀', '히말라얀 쉐르파 클럽', '아미 클럽', '마첸드라 FC']),
        2: ('네팔 B-디비전 리그', [# 10
            '프라티바 유스 클럽', '보이즈 유니온 클럽', '풀바리 유스 클럽', '마디아푸르 유스 클럽', '반스바리 클럽', '사트도바토 유스', '나야바자르 유스', '기리자 프리사드 FC', '아르나마 FC', '상카사 FC']),
        3: ('네팔 C-디비전 리그', [# 8
           '카트만두 유나이티드 FC', '랄릿푸르 FC', '박타푸르 FC', '다란 풋볼 클럽', '포카라 스타즈 FC', '비라트나가르 시티', '부트왈 브라더스', '네팔간지 스타즈'])
    },
    '방글라데시': {
        1: ('방글라데시 프리미어리그', [# 10
            '바슌드하라 킹스', '아바하니 리미티드 다카', '모함메단 SC 다카', '치타공 아바하니', '셰이크 러셀 KC', '셰이크 자말 DC', '라흐마트간지 MFS', '포티스 FC', '브라더스 유니온', '아라미바그 KS']),
        2: ('방글라데시 챔피언십 리그', [# 8
            '파키라풀 YMC', '다카 완더러스 클럽', '와리 클럽 다카', '우타라 FC', '노펠 스포츠 클럽', '포티스 아카데미', 'BFF 엘리트 아카데미', '카르란 바자르 리미티드']),
        3: ('다카 리그 세컨드 티어', [# 8
            '다카 시티 FC', '빅토리아 SC 다카', '이스 가든 SC', '딜쿠샤 SC', '파라즈가니 SC', '스와디나타 KS', '각가풀라 유나이티드', '고팔간지 스포르팅'])
    },
    '라오스': {
        1: ('라오 프리미어리그', [# 10
            '에즈라 FC', '영 엘리펀트 FC', '마즈다 GB FC', '참파삭 아브니어 FC', '라오 아미 FC', '살라반 유나이티드', '루앙프라방 유나이티드', '남타 유나이티드', 'BIS 마스터', '사반나케트 FC']),
        2: ('라오 리그 2', [# 8
            '비엔티안 유나이티드 FC', '참파삭 유나이티드', '사반나케트 유나이티드', '퐁살리 FC', '우돔싸이 시티', '보케오 FC', '볼리캄싸이 FC', '세공 FC']),
        3: ('프로방스 리그', [# 8
            '루앙프라방 스타즈', '비엔티안 스타즈', '참파삭 스타즈', '남타 스타즈', '사반 유나이티드', '시엥쾅 유나이티드', '살라반 시티', '아타푸 FC'])
    },
    '마카오': {
        1: ('리가 드 엘리트', [# 10
            '벤피카 드 마카오', '청 풍', '갈라', '마카오 치바', '머스트 IPO 엘리트', '샤오 지앙', '마카오 대학', '항 사이', 'GD 아르틸레이로스', '선코 G. 유니버스']),
        2: ('세군다 디비장', [# 10
            '스포르팅 클럽', '스피니 레이드', '청 로이', '시오 푸', '홍 록', '완 관', '토이 스타', '호우 셍', 'H.C. 콜로아네', '카 이']),
        3: ('테르세이라 디비장', [# 8
            '마카오 유스 클럽', '동방 스타즈', '디스포르티바 마카오', '포르투 드 마카오', '마카오 라이온즈', '싱 도오 FC', '호이 판', '파이 셍'])
    },
    '쿡 제도': {
        1: ('쿡 제도 라운드 컵', [# 8
            '투파파 마라에렝가 FC', '니카오 소카탁 FC', '푸아이쿠라 FC', '아티우 FC', '마타베라 FC', '티티카베카 FC', '아바투아 유나이티드 FC', '타쿠바이니 FC']),
        2: ('쿡 제도 퍼스트 디비전', [# 8
            '아바루아 소커 클럽', '아로랑이 FC', '망가이아 풋볼 클럽', '마우케 FC', '미티아로 FC', '라카hanga FC', '푸카푸카 유나이티드', '펜린 스타즈']),
        3: ('쿡 제도 세컨드 디비전', [# 8
            '라로통가 FC', '아이투타키 FC', '마누아에 스포르', '팔메르스톤 FC', '타쿠바이니 스타즈', '푸아이쿠라 라이온즈', '마타베라 이글스', '니카오 스타즈'])
    },
    '미국령 사모아': {
        1: ('FFAS 시니어 리그', [# 8
            '파고 유스 FC', '우투레이 유스 FC', '바이알라 통가 FC', '릴라 FC', '타푸나 제츠 FC', '블랙 로즈 FC', '그린 베이 FC', '일라오아 앤 투아마아라']),
        2: ('FFAS 퍼스트 디비전', [# 8
            '파고 스타즈 FC', '파나우아티 FC', '아오아 에덴 FC', '누우우이 유나이티드', '레오네 라이온즈 FC', '마라마 풋볼 클럽', '타푸나 이글스', '바에아티 FC']),
        3: ('FFAS 세컨드 디비전', [# 8
            '사모아 유나이티드 FC', '투투일라 FC', '아누우 스타즈 FC', '파고 킹스 FC', '알로파우 유나이티드', '레오네 유스 FC', '아스 아카데미', '우투레이 스타즈 FC'])
    }
}